{
    "metadata": {
        "video_id": "LvFOkfZX4MY",
        "title": "Hong Kong Is in ‘Embrace Crypto Mode’, Says Justin Sun",
        "link": "https://www.youtube.com/watch?v=LvFOkfZX4MY",
        "duration": "7:05",
        "channel_name": "Bloomberg Television"
    },
    "transcript": {
        "0": "I guess let's talk about what you guys\nare doing on the Tron side in just a moment, but your reaction to the latest\non Sandbank when freed? I think we had Yahtzee of any Moka\nbrands last week and he said the industry and I'm paraphrasing is\ncheering the arrest of Sandbank when freed because this separates him from\nthe industry. Do you feel the same way?\nYes, I believe, first of all, the fall of DAX probably like marks on the end of\nthe crypto bearish market. I believe this is like the last bad news\nwe have. So I think right now the industry needs\nUnited to gather to show the strength and also to restore the confidence of\nthe customer to not only centralize exchange, but also to the whole\nindustry. Just it just got some news come from The\nNew York Times about buying rent free. ",
        "1": "Then TV and talks happening with us\nprosecutors over bail here. They're looking for a bail deal.\nThis is one of the reasons we're not on why he perhaps decided to go back and\nnot fight extradition here. But that's just coming through right\nnow. But give us a sense, though, Justin,\nbecause I think it was the 10th of November when you had said that you were\nwilling to actually help out FTSE. You were prepared to cover some of the\nlosses once due diligence was done. Now, what did you find in that due\ndiligence? It's going to be key.\nYes. So basically, I think Sam completely\nlost all older control RTX after he signed the Chapter 3.\nSo there is not like much left for due diligence, especially after the\nbankruptcy construction, because majority of the control rise goes to\nJohn Wray, the current CEO. ",
        "2": "So.\nBut still, I would be kind of surprised. You know,\nwe'll be exact. ISE to a United States for the trial\nin this show. The Puro.\nJustin, I'm curious, have you been in contact with Sam recently, recently?\nNo. Of course.\nOh, okay. OK.\nJust just just thought of asking. Not now.\nI mean, the other sort of parallel story here, and you probably know about this\nnew ETF, it's on unscripted that were launched in Hong Kong.\nI think it was it was late last week, right?\nIt was CSI Asset Management. And, you know, a lot of people were\npointing to that avenue of investment as perhaps not completely erased replacing,\nbut as a new avenue for investors to get ",
        "3": "exposure to crypto, because obviously\nthe optics are it's safer in these traditionally changes.\nHow would you respond to that? Yes, I definitely believe this is a big\nmove for the whole crypto industry because I was trading crypto in Hong\nKong, I think back to 2000 and 20. So at that time on there, even now.\nBasically, I think at that time, Hong Kong regulators are not even comfortable\nto let us trade that crypto reskill products.\nSo basically at that time, we don't have BGF at all.\nSo the US crypto ETF Hong Kong either have either only reskilling or that by\nthat time our Hong Kong regulators fewer ",
        "4": "speak.\nWhy is CRM is very sensitive? They want to be aligned with us a\nChinese government regulation. So so they don't.\nYou want your to try to rescue crypto at that time.\nBut right now I think we're seeing change dramatically in the past two\nyears. I will say how right now I think he is\nin a very embrace crypto mode. So.\nSo that's why I think not only the launch crypto ETF today and that they\nwelcome like every exchange to establish their Hong Kong branch.\nI think not only is Mark's basically pleased, the opening up of crypto in\nHong Kong, but I think he's also opened up the overall crypto policies in China.\nI believe then that spool markets with ",
        "5": "depended on Chinese market, which we\nhave seen in the past, you know, in 2000 and twelve and to 2000 and 17 actually\ntrue markets in surging and the EU 17 is decided by Chinese currency and also\nChinese markets at that time. Right.\nLike 90 percent of the water is depended by by Asia.\nMark CAC is. Well adjusted, I'd like to ask you about\nthat, because do you think regulators in Hong Kong approving embrace the embrace\nof crypto? Do you think that's something that might\nindicate a change of heart from regulators on the mainland?\nYes, absolutely. I think right now Chinese regulators\nseize Hong Kong basically like a ",
        "6": "Shenzhen.\nSo before I think for most of the policy makers, they see Shenzhen as an\nexperiment zone. So they want to try anything, say they\nwill allow like Shenzhen, do it first. But right now, I think Hong Kong\ndefinitely have a better position compared to Shenzhen because he has a\nway better status and also infrastructure, all\nfinancial institution. So that's why I think right now they are\nusing Hong Kong as an experiment place so they can see all the feedbacks.\nOh, the results was they are, Bob, like crypto.\nSo. So that's why I'm super bullish and also\nlooking forward to seeing the result. ",
        "7": "All right.\nOh, the Hong Kong crypto policy. "
    }
}