{
    "metadata": {
        "video_id": "j4POGVofD5E",
        "title": "Justin Sun Owns TrueUSD - Episode 122",
        "link": "https://www.youtube.com/watch?v=j4POGVofD5E",
        "duration": "34:56",
        "channel_name": "Crypto Critics' Corner"
    },
    "transcript": {
        "0": "Welcome back, everyone. I am Cas Piancey. I'm joined, as usual, by my partner\nin crime, Mr. Bennett Tomlin. How are you today? I'm doing pretty good. How are you Cas? Doing good. We are going to be talking about\nI feel like this is just a topic that never goes away\nas much as I want it to. Our boy\nJustin Sun and his stablecoin TrueUSD. I guess I shouldn't\nbe saying his stablecoin but that's what we all know it as at this point. But yeah, we're going to get into all the\nweird shit that's been going on with it. It's been just a strange\neven we were talking about it last time with the DataFinnovation Boys. There's been some weird\nupdates, the lawsuit, etc. So. So let's start. Let's start\nthere. Let's start with the lawsuit. Sure. So just for some context, last time\nwe talked about this with Jonathan Reiter and Patrick Tan, the world,\nor at least the knowledgeable connected ",
        "1": "world, assumed\nTrueUSD was connected to Justin Sun. We knew Justin\nSun was a partner market maker, but we assumed that since December 2020, when Techteryx bought the brand name,\nthat Justin Sun has owned it. But that was not publicly known\nin the interim. Since we did that last episode,\na couple of things have been revealed. One of those things, as you mentioned,\nis that former TrustToken's CEO Daniel Jaiyong An is suing Archblock,\nformerly TrustToken, and in the course of that lawsuit includes some conversations, negotiations and information about a period in 2020\nwhen the Tron Foundation was trying to purchase TrueUSD in a in a deal that was being negotiated\nby Can Sun, a lawyer and Justin Sun and the Tron Foundation\nto purchase TrueUSD. So that came out. ",
        "2": "The other piece of information just before\nwe really get into this conversation is Adam Cochran, a venture capitalist, did some digging into TrueUSD\nand identified a bunch of other links\nthat show up like it seems. Jennifer Jiang may also be on\nsome of the BitTorrent related companies and stuff like that\nand has all these other preexisting connections to Justin Sun,\nwhich really kind of undercuts their December 2020 statement\nthat Justin Sun has no involvement at all. So those were like the two pieces\nof information that have come out. They've taken it from Justin Sun. So I just want us to hit the I want us to\nhit the brakes here for a second. I just want us to hit the brakes,\nthrow the car into reverse, because I think we've\nwe've kind of jumped into a lot here. I know we've talked about TrueUSD, we've\ntalked about these stablecoins before, and I know that a stablecoin\nas far as complexity goes, it can be they can be very complex\nand they can be not complex ",
        "3": "TrueUSD at what its base value is,\nbut what it's supposed to be. It's supposed to be one of these simpler\nstablecoins. So that isn't what I want to get into us\nreversing and discussing. I do want us to talk about TrueFi. I want us to talk about our Archblock. I want us to talk about these entities\nthat have been and Techteryx. I want us to talk about these entities\nthat have been popping up, doing one or two things,\ndisappearing, rebranding, renaming. These are the corporate shenanigans that we're used to\nbecause we've been dealing with this with tether\nand these other entities forever. But let's talk about it. So what was TRU? What was TrueFi? What was TrueFi or what is TrueFi? What was the TrustToken ecosystem? What was this lending program, etc.? Yeah, so this is a little complicated,\nbut a US based company called\nTrustLabs was started back in like 2017 to start doing tokenized assets, focusing\nmost of their effort on Stablecoins. ",
        "4": "So they had a couple of other efforts. They eventually launched\na variety stablecoins TrueUSD, TrueAUD, TrueHKD, and TrueGBP\nso British pound Hong Kong dollar and probably Euro\nif I didn't say that already. Then they started launching\nsome other things. They did a fundraise with their Tru token where Alameda Research\nwas a lead investor, and the Tru token was meant to govern the TrueFi\nlending platform, which was a lending platform\ndesigned for uncollateralized loans of primarily stablecoins\nto people extended through this platform. Alameda Research,\nwho again as we mentioned, was one of the lead investors in the Tru\ntoken, was extended millions of dollars of uncollateralized\nloans through this platform from an entity called TrustTrading, which is a wholly owned\nsubsidiary of Archblock, which is what TrustToken rebranded to\nafter they sold off TrueUSD and all that. ",
        "5": "Besides that, there's yeah. And so that's Archblock. That's true for Alameda Research\nas we mentioned was a lead investor in Tru\ntoken, was getting loans from TrueFi. According to ChainArgos research\nwas like the largest minter and redeemer of TrueUSD, followed by\nI think Justin Sun was in second place. And so yeah, that was broadly like the set of entities\nwe're looking at here. We should also mention Techteryx, right? Techteryx, which is nominally an Asian\nAsia based conglomerate that seems like it's actually incorporated\nout of the British Virgin Islands where they, which was used to purchase initially just kind of the name TrueUSD and Archblock was still in charge\nof a lot of the administration. A few months ago,\nProtos reported that the private keys and the rest of the stuff that Archblock\nhad been managing had been transferred over to Techteryx, and shortly\nafter we published ",
        "6": "that TrueUSD came out and announced\ntheir international transition. And so now TrueUSD is kind of more fully separate from Archblock,\nwhich used to be TrustToken and seems to be basically wholly\nand fully controlled by Justin Sun. Yeah, that's right. We don't have any like, I don't think there's any way to fully\nprove it at this point. So, you know, allegedly there's the word allegedly Techteryx and TrueUSD\nand the rest of this stuff is now completely controlled\nby Justin Sun alleged. But there's also been\nsome weird shenanigans with that. I mean in terms of its collateral,\nin terms of where its collateral is. I think we got into it with the boys\nlast time. So we don't necessarily\nneed to get into the depths of that. So but so sorry to interrupt you,\nbut you bring that up and I didn't think we had to get into it,\nbut there was a little bit of a note in Daniel's lawsuit that makes me think\nwe need to bring it up, ",
        "7": "because one of the things we talked about\nis how the collateral being held at FlowBank is no longer\nappropriately being held in escrow and instead being held directly\nby agents of Techteryx or whatever. What was mentioned in Daniel's\nlawsuit is that Techteryx is currently trying to or TrustToken\nor Archblock. There's\ncurrently an attempted restructuring of some of these entities\nthat will put them in Switzerland. And Daniel is opposed\nto that restructuring, believing it unfairly deprives him of wealth\nthat is supposed to be his. But so that was kind of the interesting\nwrinkle to me is that we saw all this money moved to Switzerland in this account\nthat was not appropriately escrowed. And then we hear that there's an attempted\nrestructuring going on in that same jurisdiction. I want to point out\nthat this lawsuit was filed pro se. And it reads like it is. And it reads like it, which is it's an important point\nbecause for anyone who's not aware, ",
        "8": "that means that there's no lawyer\ninvolved in this, that this guy is is doing this lawsuit on his own\nwithout the help of a lawyer. And yeah, that it doesn't stand much of a chance\nis basically what that means because generally\nwhether you're defending yourself in a court of law or you are suing\nsomeone else in a court of law, if you're doing it on your own\nwith the help, without the help of legal assistance,\nyou're probably not going to get very far. And so, yeah, we can presume as much. Also because this guy claims\nthat he's owed $96 million and you would be able to get a lawyer to agree to terms\nif that if they actually thought you had a chance\nof seeing that $96 million. It doesn't sound like any lawyer thought he had a chance\nof seeing that $96 million. So and we should also. I just wanted to ask a caveat\nto the to the lawsuit. And this is kind of a countersuit\nbecause Archblock formerly TrustToken\nhas had a separate lawsuit against him ",
        "9": "for deleting their internal Slack\nwhen he was voted out of the CEO position. And that's been ongoing for over\nlike two years now. Yes, that is a lengthy\nI guess he's been pushing for a lot of discovery information\nand and vice versa. And yeah, it's been a slow process,\nslow legal wrangling. Yeah, a lot of weird claims and. Yeah, so I think the most important claims\nwe should take out of it are not some of the ones about behavior of certain executives\nthat were given without evidence. The part that seems more plausible to me\nare the parts where we can see some of the messages\nregarding these negotiations and some of the names mentioned\nthat has a lot more credence to it and some of the other allegations\ncontained in it. It doesn't. It doesn't to me. So there there I believe Bennett is\none of the things he's speaking about, for instance, is that there is a text\nmessage exchange with Justin Sun. It's hard to call it even an exchange\nbecause it's almost all. ",
        "10": "One-sided. Daniel sending messages to Justin Sun Which leads me to believe\nhe was sending these messages knowing full well that he was going to be\nscreenshotted in this conversation because he was like,\nokay, I'm going to look good right here. Whereas he doesn't\nshow us the entirety of this conversation. When it started,\nwhat was said, what the hopes and and aspirations were for this, for this\ntake over. All he shows is him saying to Justin\nthat he thinks that's a bad idea. Yeah. Grain of salt. There. There is one other thing\nI want to highlight, though, is he does include the name of a lawyer\nwho is supposedly helping Justin's son negotiate this and point\nspecifically to a lawyer named Can Sun, which we don't know\nif there's any relation to Justin there. It's a relatively common name. So we don't want to jump\nto too many assumptions. But this lawyer is interesting\nbecause they worked for Fenwick & West, ",
        "11": "which is a firm that represented the BitTorrent Foundation in 2018 or 2019, when the Tron Foundation was acquiring it\nand then Can Sun left Fenwick and West, where they were working\nwith Daniel Friedberg to go be a general counsel\nat FTX, underneath Daniel Friedberg. And so that name was an interesting. The best career decision. Can we just say? Well. I think it is telling in the context\nof some of the other Alameda research connections\nI alluded to before. Right? Alameda Research was the largest\nor was a lead Tru token investor was getting like the largest\nloans out of anyone on the TrueFi platform was the largest issuer\nand redeemer of TrueUSD like that is important context when we're considering the\nthis lawyers trajectory. Sure sure that we've gone\ninto their escapades before. ",
        "12": "We urge people\nI urge anyone to listen to our episode with Jason Bral where we talk about the some of the lawyers\nthat are now getting mentioned, a lot and we were talking about it years\nbefore all of this nonsense. These guys have been involved in crypto\nfor a while, I think. I mean, I remember when you and I\nwere first getting into cryptocurrency, so many people, so many of the people who were putting a lot of money into\nit were poker. But like it was pretty commonplace. I, I don't know if there's\nthat same association these days, but it certainly was a big,\na big deal before. I know now that with Rollbit getting such a big platform from a bunch of individuals\non crypto currency Twitter that perhaps we're seeing\nthis kind of poker gaming, uh, illegal gambling stuff getting popular again\nand we'll see where that goes. ",
        "13": "But for a while there it seemed like\nthere was at least a break. Yeah. So I think there's a couple of dynamics\nthere, and I think there's a reason it's coming back to. You'll remember when we had Jason\non to talk about he talked about like pre Black Friday in the lead up\nwhere there was starting to be more and more pressure\non some of these poker sites, it became harder and harder to deposit\nand withdraw money from these sites. And so the poker players\nwho were still using them got comfortable using more and more unconventional methods of moving money in order to continue\nhaving this opportunity. He mentioned jewelry, exactly like jewelry\nbeing a very common thing. Which is like the same way that Backpage was doing it for a while\nfor some of their stuff. And so what's interesting to me\nis that I think this allowed them to be well positioned\nto take advantage of crypto early on because they were familiar\nwith many of these unconventional rails that crypto companies began\nto rely on as crypto companies ",
        "14": "began to get banked at Signature\nand Silvergate and everywhere else, some of that barrier to entry decreased and it became easier\nfor some of these people to use it. I think as we've seen the deep\nbanking of crypto, it will become like\nthe proportion of people like that poker players and stuff like that will again\nkind of shift more towards overrepresentation as some of the barriers\nto trading crypto go up. Okay. Yeah, that's an interesting, interesting\nperspective I hadn't been thinking about. We obviously had to continue the continuous line of these lawyers,\nthe legal, the legal representation for for major cryptocurrency exchanges\nand Yeah. And other entities have has for some\nreason always skewed toward the same legal representation of the worst outfits\nin the poker world back in the day. So I don't know what that means. I'm just saying that they were hiring\nthe legal representation for the worst ",
        "15": "companies in poker back in the day,\nwhatever, whatever that means. But anyway, so there's some other stuff\nthough, in regard to Justin Sun outside of just this lawsuit,\none of the big things that's been that has been getting a lot of attention,\nactually, not just you and you know,\nand the DataFinnovation boys, but but other people, too, have been focused on this wrapped Bitcoin, which seems\nto have vanished into thin air, which is like pretty sure\nsomething Bitcoin can't can't do. Right. Like it\ncan't just vanish off the blockchain. How does that happen?\nThere was a boating accident. Um, yeah. So what were. On the blockchain? There are a couple versions\nof wrapped Bitcoin on Tron. There's one very small one\nthat's done by like the same people who did wrapped Bitcoin on\nEthereum custody is done by Bitgo and it's very easy to find the addresses\nfor that one, but no one uses it. ",
        "16": "The one everyone uses is a product\nthat was initially offered by Poloniex. Poloniex, as we've mentioned on here\nbefore, seems to have been acquired by Justin Sun. We’ll say seems to be since he wants\nto pretend he didn't do it, that one you know one can find the backing for\nI've gone looking I have not been able to find the backing\nI purchase. Asked Poloniex where the backing is,\nand they said You're not a customer. We can't tell you that. And no\none else seems to be able to find it. And that is not great because, well,\nit's thousands and thousands of bitcoin, including a significant portion\nof the Bitcoin reserves at who will be like customer reserves\nthat are supposed to be allocated for customers are not in regular Bitcoin\nlike you would expect. They're in this wrapped bitcoin\nthat is from Poloniex where no one can find where the tokens are\ncustody besides will be. You see a bunch of them go to SunSwap to ",
        "17": "JustLend those protocols. I know. That. Sorry, sorry, sorry. So for anyone who's. Yeah, we'll pause again here. Justin Sun is so self-obsessed that everything he creates has to in\nsome way like have his name associated with it. Obviously, just to lend is as in Justin Sun, Justin, sun lend, JustLend. And then there's what was its SunSwap. SunSwap. Yes, you can swap on Sun’s personal dex. And so yeah, there are\nthousands of Bitcoin that are supposedly on the Tron network where no one can find\nthe corresponding bitcoins on the Bitcoin network, the entity\nthat's supposed to be custodian them. And managing these swaps\nwon't tell anyone where they're stored. And that same entity sorry,\nthat same entity promised back in November that they would release\na proof of reserves shortly. They have yet to release\nany kind of like Merkle proof of reserves. ",
        "18": "Okay. And when you asked them about,\nthey said they're still working on it. We asked them why eight months\nwasn't enough time to finish it, and they just said\nwe're still working on it. This brings around to a larger point\nthat I'm sure we've touched on before, but this this is something I've noticed\na lot more lately, which is that when when were these wrapped Bitcoin\noriginally like created. Like 2018. Okay, this speaks to. So I think one of the ongoing lies that. 2020. 2020. Okay. Nonetheless,\nthree years. So this speaks to me, to me,\nthis speaks to there's this consistent narrative\nthat the blockchain and cryptocurrency provides transparency\nbecause you can, you can go on these scanning, you can use scanning tools,\nyou can use breadcrumbs, you can use, you can use all of these things\nto try to get get information\nthat you wouldn't be able to otherwise, ",
        "19": "for instance, from the Federal Reserve\nor whatever they want to say. Unfortunately,\nwhat you just what you just proved is that this dude did this thing in 2018. No one knows where these coins are now. 2020 however long they've been gone. If they ever were wrapped\nin the first place, like no one knows, no one knows and that it's there isn't the what transparency. This is obfuscation. This is this is creating extra steps\nthat people just don't fucking care about. Nobody's going to bother checking to ensure that the wrap\nit quite like nobody fucking cared. Nobody cared in 2020. Like hardly anyone cares, right? Like now people care\nbecause they're like, Dude, are there just millions of dollars\njust up and walked away? What? What happened? Right. But like, if Protos hadn't done\nthis and people hadn't been asking some questions,\neventually who knows? Right? And I and I just it just bugs me\nbecause there's this narrative of it being so transparent. ",
        "20": "And the reality\nis, where's the transparency? This is obsfucation. It's an extra layer to trying to even if you say, like,\nwe proved it, there's no Bitcoin here. They just go, Oh, well,\nwe're auditing it and figuring it out. We'll get back to you like,\nwhat does that even mean? Where are they? Just give me an address.\nPut them in an address. Give me the address. Then we can all say, Hey,\nthat address has them. And if someone moves them, we can go. Why the fuck are you moving? The ones that are supposed to be\nin that address, but they don't want to do that. And I think personally, yeah, yeah. I think kind of what we're getting\nat here, like through like the reason this to me is connected to TrueUSD beyond\njust the fact that it's just is it points towards kind of this pattern\nof what you're talking about claiming transparency\nclaiming this openness while doing everything possible\nto try to obscure the true intention with TrueUSD that's\nobscuring the nature of the ownership where the collateral is stored,\nhow it's stored, and what that means. Even the nature of like we talked about\nthis when the chain Argos guys were on, it seemed like attestations for TrueUSD\nrestarted once they started manually ",
        "21": "sharing the information for this non\nescrow bank account with The Network Firm. And so that isn't\nparticularly transparency. That's not using the blockchain\nfor your best effect. Same with this BTC. There are millions of dollars of value\nbeing placed in these protocols and being treated\nas if it is fully collateralized by bitcoin with no other claim against it\nwithout the evidence. That's true. And like this is a pattern throughout\nall of Justin's things and we've talked about on some of his Tron projects,\nbut just sticking close to him for now, like he there's this other new project they launched recently called Stake USD and Staked USD\nis supposedly controlled by a new entity called the RWA DAO\nor Real World Assets DAO. And the idea is they're going\nto take all these stablecoins and they're going to invest them in\nsomething in the real world\nand pay the yield back to token holders. ",
        "22": "Unfortunately,\nthere doesn't seem to actually be a DAO. There was no they claim\nthey did this in collaboration with JustLend Dao, but there's no\nproposal on JustLend DAO related to this. No discussion of this\nin the JustLend governance forums and 85% of this staked USD goes to Huobi, which again is almost\ncertainly Justin Sun owned. But we have to say Justin\nSun advised because Justin Sun still feels the need to lie\nabout this. 85% of the total supply of this new Tron\ntoken that's being invested in something with no disclosure goes to this exchange and is included in the Nansen dashboard that who will be published to try to prove\nthey have all the assets they claim. So and this yeah this gets me back into\nso woe be like I just want to I want to point out to everyone\nand I know some people are aware of how I have my my own personal ",
        "23": "animosity towards Justin Sun that he is\nmy Moby-Dick, my, my white whale. If you will. Watch the episode with Josh Cincinnati\nand Laurence for that one. Right. And many other episodes as well. When you look at at everything\ncombined for this for this gentleman, um, he's not allowed in mainland\nChina anymore. I want to make this clear under, under his\npassport that is his Chinese passport. He is no longer allowed in the country. When he does go, you can almost guarantee\nthat he is using a St Kitts and Nevis passport or his Grenada passport\nor his Malta passport or his whatever passport, his Central\nAfrican Republic passport,\nwhichever one he wants to pop out and use. He's using one of those instead. Why? Well, obviously because the the CCP wouldn't want him coming back. ",
        "24": "Why won't you got to ask them?\nI don't know. I don't know why they what would happen\nif he did return under his passport. Zhao Dong. Right. Yes. Go ahead and watch our episode about Zhao\nDong and RenRenBit. But there there's also the issue of him\nestablishing all these companies in Hong Kong, not under his again, not under his Chinese name. He's only doing it with his St Kitts\nand Nevis passport. He's using other individuals to including apparently his parents, possibly as like individuals\nwho are owning these companies or representing\nthese companies like Techteryx, like the things\nhe's doing to jump through hoops, to try to get through the legal system\nin ways that he must think are effective. It just screams\nred flags on everything he touches. ",
        "25": "So whether it's Poloniex, or USDD, which is just the stupidest\nfucking stablecoin in history. Or there's the other one. What was it? JUSD or USDJ. Whatever the hell it is, that one is us actually above right USDJ\nPerpetually above a dollar. I think it's probably trading for a dollar\n12 right now or something like that. It doesn't. It doesn't matter. None of it matters in a cosmic sense. Now it all of it. And this is this has been\nmy one of my issues for a long time is that for for probably two, three,\nfour years now, people have been saying Justin is rich,\nJustin is so rich. This was then this is so similar\nto the SBF narrative to me, because when they go, he's so rich,\nI go, okay, where though he with what? With what assets,\nwhat real world assets does this guy have that suggests he actually has money? And when you look at the shit\nhe's doing with his cryptocurrencies, ",
        "26": "the stuff he's hiding, the stuff\nhe is stealing, the lawsuits he's involved in, like the wallaby people are suing him\nbecause he has continued to use the Huobi name when he said\nhe wasn't going to like all of these things combined to show an individual\nI wouldn't I wouldn't trust for any amount of money,\nany amount of money. I wouldn't hand this guy a nickel. I don't know what this guy would do\nwith it. Like this guy screams bad news\nand you just you just naming more things to me\nwhere I'm like, huh? And this is to be expected. Okay. He says he wrapped the Bitcoin,\nbut he didn't do it. Then he sent all his money to will be\nand then he and he stole customer funds\nand they need it. Sure. None of this is surprising to me. Yeah, and I think that's kind\nof what we're getting at here, is these events exist\nin a pattern of behavior for just insane. And the reason I think it's important\nto highlight these specific ones is the same reason we wanted to have Jonathan\nand Patrick of ChainArgos on is because this kind of offshore\nfinancial system ",
        "27": "involving many of these actors Alameda Research, FTX, Justin Sun, TrueUSD and of course our friends at the world's\nmost transparent stablecoin Tether has its uses from like light gray but never fully white to like fully dark black black market stuff and many of the behaviors and maneuvering seem like someone who has fewer dollars\nthan they're supposed to for all the people they owe\nand think if they can keep things moving for long enough,\nthat fact won't come out. And sometimes these entities\nend up in that position because bank accounts get seized,\nbank accounts get frozen money they thought they had ends up\nnot being money they have. And that could be part of this, right? Like TrueUSD presumably\nlost some money at Prime Trust though ",
        "28": "apparently it's only 20K\nAnd so yeah, you have kind of this pattern where sometimes these entities seem really wealthy\nbecause they're behaving really wealthy, but they're behaving really wealthy\nto continue the fiction that they have all that money\nbecause they need to have all that money or they're in much deeper shit. One of the important parts that I think\neveryone has already kind of forgotten about the FTX’s\nand Alameda fiasco was that he was marking illiquid assets as though he could sell them\non the open market for the value they were trading at on FTX\nor whatever that day. Like insanity, you're going to be taking massive haircuts\nif you try to sell these positions. And we don't know what\nthe other investments are for things like TrueUSD, right? We don't know what\nthese other investments are. We don't know what these things are\nthat are actually backing this thing at this point, other than they're being\nmarked to some imaginary value that says that they're fully backed\nand we don't know what it's backed with. And this is like\nthis is part of the issue, right? ",
        "29": "Yeah, Yeah. And like even specifically in TrueUSD,\nwe already talked about how some of these things aren't\nappropriately held in escrow, but they won't make any kind of representations\nabout the quality of securities being held at First Digital in Hong Kong, where they're holding\na significant portion of their assets. And First Digital themselves just launched their own stablecoin,\nwhich immediately got listed on Binance like immediately, like two days after it\nlaunched was already listed. They said so. So to be fair\nand just so everyone is aware, they they started the the stablecoin\nin in partnership with Binance and and like Huobi and these and like these and Justin Sun like that they were working together with them\nfor sure from the very get go and like that like there's no that's not\nthat isn't surprising to me. But I do want people to realize that First Digital is a trust\nbased out of Hong Kong. Do do we really think that they're moving\nbillions of U.S. dollars into and out of Hong\nKong through this, through this, ",
        "30": "through this trust? Maybe? I doubt it. It's like we talked about\nwith Jonathan and Patrick. If they are, it's in a more convoluted\ntransaction. Right. Involving other counterparties\nor entities or structures between the U.S. dollars and the assets that end up\nat first digital backing, TrueUSD. And that's been kind of the point\nof complexity at the heart of these stablecoins\nsince we started covering Tether in 2017, the mechanics they claim,\ndon't match up with their behavior, like the mechanics of them\ncollecting a U.S. dollar from someone, storing it in a bank\naccount and only then issuing the asset and then wiring that dollar back out\nonly when it's redeemed does not match up with the behavior\nof really any of the stablecoins USDC and Paxos whatever, fine, the US\nbased ones we're not going to worry about. But like that has been true\nsince the beginning ",
        "31": "and we have heard for years with varying\ndegrees of accuracy that Tether’s transactions actually involved a much\nmore convoluted set of counterparties that was meant to kind of aid\nin capital flight, transform renminbi into tether's. So that can be used there. Right. And so we need to remember\nwhen we're talking about just and all this, that one of the principal\nuse cases for many of these fake dollars is capital flight, Is money\ntrying to get out of China. Yeah, I mean, it's been a point\nthat Protos has been particularly keen to make about about FTX’s,\nabout these entities and about some other some other stuff\nlately. Like I do think you know,\nyou don't have to be like whether you agree\nwhether you think Chinese capital flight is a good or bad thing,\nit doesn't really matter. It just is a thing that's happening. And clearly,\nyou know, someone's mad about it, right? You're breaking those rules and you're not obeying the laws\nand someone's going to be pissed. ",
        "32": "Either it's going to be the U.S. or it's going to be China\nor it's going to be both. Well, and and it has been China. China's busted a couple of them tether\nwhat they call money laundering rings, which always sit somewhere between like money laundering,\ngambling proceeds and capital flight are all kind of described\nby the Chinese state apparatus as like broadly the same type of thing. But they've busted a couple of tether\nbased rings in the last couple of months. So they don't seem happy about that. No, I mean, the the Chinese government has made it\nvery clear how they handle this stuff. And that is a basically shoot\nfirst, ask questions later. They they're not. Zhao Dong was sitting in a jail cell\nfor a year before he had a trial. And the trial lasted for like three days. And he was guilty. Right. Like these this they they don't operate\nthe way we do here. And I'm not suggesting\nthat's a good thing. I'm suggesting that's a real thing. And that that is what you have to consider\nif you're going to be ",
        "33": "doing business in these places\nor with people in these places. And I think like Justin\nSun is a prime example of the way you know, I don't know what\nyou want to call it illicit. I don't know how you want to term it. Just funds that are questionable,\nquestionable in their sourcing, questionable in how they were acquired, questionable in\nin what they're destined to do. Funds that. The way those funds. the banking system is reticent to accept. Which is crazy because the banking system\nis will happily accept most money is you got to be. HSBC will build you a window\nto shove your cash through if you need to. This is exactly right. So if you can't get HSBC on board,\nwhat the hell are you doing? Yeah, I don't know. A million questions about Justin Sun still so I'm glad we're bringing him up again,\neven though I hate talking about it. And yeah, we'll see what happens. We'll see what happens with True. Is there anything else\nthat you want to touch on with these ",
        "34": "with these platforms, these Justin Sun\nrelated platforms and, and vehicles? Well, I just want people to know\nthat I know the CasCoin Exchange proof of reserves\nhas been delayed for eight months, but we're still hard at work on it\nand we expect to have it out any day now and we guarantee it'll show you that\nwe have assets. Yeah, we are using a top 100 auditor, so I don't know why\nanyone could claim otherwise. And I look forward honestly, I'm\nlooking forward to us getting the the audit done because I'm tired of people\nFUDding my CasCoin bags. Remember guys that yes, we are under investigation by the DOJ\nand the SEC and the CFTC, but under investigation means that they\nhaven't charged you with anything yet. "
    }
}