{
    "metadata": {
        "video_id": "j3RpmY06KzU",
        "title": "Coinbase CEO Armstrong on Being sued by the SEC, future of regulation",
        "link": "https://www.youtube.com/watch?v=j3RpmY06KzU",
        "duration": "15:27",
        "channel_name": "Bloomberg Television"
    },
    "transcript": {
        "0": "YESTERDAY COINBASE AND THE SEC\nHAVE BEEN IN THIS MONTH'S-LONG DISPUTE OVER DEFINING A LOT OF\nTHE CRYPTO ENVIRONMENT, AND THEY BROUGHT A CERTAIN AMOUNT\nOF CHARGES AGAINST YOU, TO WHICH YOUR CHIEF LEGAL OFFICER\nYESTERDAY TOLD ME YOU GUYS ARE WILLING TO FIGHT THIS PRETTY\nSIGNIFICANTLY. WHEN YOU SELL THOSE CHARGES\nBROUGHT AGAINST YOU, WHAT IS THE FIRST THING YOU DID, AND\nHOW FAR DO YOU THINK YOU ARE GOING TO HAVE TO GO HERE? BRIAN:\nTHIS IS NOT UNEXPECTED. WE HAVE BEEN IN THE DISCUSSIONS\nWITH THE FCC GOING BACK TO BEFORE WE WERE A PUBLIC COMPANY.\nWE STARTED SHARING HOW WE LIST ASSETS ON THE PLATFORM, HOW WE\nTHINK ABOUT OUR STAKING PROGRAM. AND THROUGH A LARGE NUMBER OF\nDIALOGS THEY ALLOWED US TO BECOME A PUBLIC COMPANY.\nWE HAD MANY DISCUSSIONS WITH THEM IN THE LAST YEAR, WHEN\nTHEIR TONE STARTED TO CHANGE AND THEY STARTED TO COME TO US\nWITH MORE QUESTIONS ABOUT THE BUSINESS.\nWE MET WITH THEM PROBABLY 30 TIMES OVER THE LAST YEAR, AND\nWE STARTED TO ASK THEM FOR FEEDBACK.\nHE SAID, WE WOULD LIKE THERE TO ",
        "1": "BE A ROBUST MARKET IN THE U.S.\nTO TRADE CRYPTO SECURITIES, OF THE 1000-PLUS ASSETS WE HAVE\nREVIEWED TODAY. WE HAVE REJECTED 90% OF THEM.\nWHAT FEEDBACK DO YOU HAVE FOR THIS, FOR US?\nHOW CAN WE REGISTER? HOW CAN WE WORK TOGETHER?\nUNFORTUNATELY WE WERE MET WITH SILENCE.\nWE GOT NO FEEDBACK IN THOSE MEETINGS.\nTHE FIRST MEETING WHERE THEY WERE SCHEDULED TO GIVE US\nFEEDBACK THEY CANCELED IT A FEW DAYS BEFORE THAT, AND THEN WE\nGOT A NOTICE A FEW DAYS AFTER THAT. IT IS UNFORTUNATE.\nWE WORK WITH REGULATORS ALL OVER THE WORLD, OTHER\nREGULATORS IN THE U.S. I AM A REASONABLE PERSON TO GO\nALONG WITH, BUT UNFORTUNATELY THE SEC UNDER THIS CHAIR HAS\nTAKEN A REGULATION BY ENFORCEMENT APPROACH INSTEAD OF\nCREATING A CLEAR WORKBOOK THAT CAN ALLOW THIS INDUSTRY TO BE\nBUILT IN A TRUSTED WAY. SONALI:\nWHEN WAS THE LAST TIME YOU PERSONALLY MET WITH GARY\nGENSLER, AND WHAT DID YOU SAY? BRIAN:\nWHEN HE FIRST CAME IN AS THE ",
        "2": "CHAIR I REACHED OUT TO HIM.\nI TRY TO MAKE AN EFFORT TO CONNECT WITH HIM IN PERSON,\nBECAUSE THAT IS WHAT I TRY TO DO WHEN A NEW REGULATOR TRIES\nTO COME IN. UNFORTUNATELY WE WERE NOT ABLE\nTO CONNECT AT THAT TIME. WE CANNOT GET ON HIS CALENDAR.\nWE FOLLOWED UP A FEW TIMES IN THE YEAR AFTER THAT.\nWE EVENTUALLY GOT A MEETING THAT WAS VIRTUAL.\nIT MAY HAVE BEEN COVID-RELATED, BUT WE WERE ABLE TO GET A\nVIRTUAL MEETING. UNFORTUNATELY IT WAS A PRETTY\nICY RECEPTION. WE CAME IN HAT IN HAND AND\nSAID, YOU HAVE ASKED PEOPLE TO REGISTER.\nRESPECTFULLY, WE ARE HERE TO REGISTER.\nWHAT WOULD YOU LIKE US TO DO? HIS RESPONSE WAS, YOU KNOW,\nTALK TO YOUR LAWYER. I'M NOT HERE TO ADVISE YOU.\nTHAT WAS KIND OF HOW THE CONVERSATION STARTED.\nAT THAT POINT WE REALIZED THERE WAS A GAP.\nWE FELT LIKE THIS WAS AN IMPORTANT TECHNOLOGY THAT WE\nFELT NEEDED TO BE BUILT IN A ",
        "3": "TRUSTED WAY IN THE U.S., IN A\nWAY CONSUMERS WERE PROTECTED. I DON'T KNOW WHAT HIS\nMOTIVATIONS OR PERSONAL VIEWS WERE, BUT IT DID NOT SEEM LIKE\nHE WAS ON THE SAME PAGE. SONALI: WHAT DOES THIS MEAN FOR YOU?\nIF THE GOVERNMENT CRACKED DOWN SO HARD ON CRYPTO, ON COINBASE,\nTHE SEC, DOES COINBASE EXIST IN FIVE YEARS? >> ABSOLUTELY WE DO.\nTHE SEC CHAIR MAY HAVE A CERTAIN POINT OF VIEW BUT IT IS\nNOT REPRESENTATIVE OF THE WHOLE U.S. GOVERNMENT.\nTHE SEC CHAIR IS AN OUTLIER IN THE U.S. GOVERNMENT.\nWHEN I MEET WITH MEMBERS OF CONGRESS, THE BROAD CONSENSUS\nON BOTH SIDES OF THE AISLE, IT IS A PRETTY REASONABLE VIEW\nTHEY HAVE. WE DO NOT KNOW EXACTLY WHAT THE\nTECHNOLOGY WILL BECOME WHAT WE ARE ",
        "4": "LET US APPLY SOME BASIC IDEAS\nAROUND MLK YC AND OTHER FINANCIAL STATEMENTS AND MAKE\nSURE THERE IS NO WASHED RATING AND LET US CREATE A CLEAR\nMARKET STRUCTURE WHERE BUSINESSES CAN UNDERSTAND WHICH\n-- WHO SHOULD THEY TALK TO ABOUT WHAT KIND OF ASSETS?\nCONGRESS IS RECOGNIZING THIS AND THE WHITE HOUSE IS AS WELL.\nDIVIDED ADMINISTRATION PUT OUT AN ADMINISTRATIVE ORDER A YEAR\nAGO PASSING ALL OF THE BRANCHES OF GOVERNMENT TO SORT OF ST\nSAY GET YOUR DUCKS IN A ROW REGARDING CRYPTO. >> DO YOU HAVE THE FINANCIAL\nRESOURCES TO DO THAT? >> EVEN IF THIS TAKES SOME\nTIME, THAT IS OK. IN Q1 WE HAVE ADJUSTED EVEN A\nPOSITIVE AS A COMPANY EVEN IN THE DEPTH OF THIS CRYPTO BEAR\nMARKET IF YOU WANT TO CALL IT THAT, WE HAVE OVER $5 BILLION\nIN THE BALANCE SHEET. ",
        "5": "FRANKLY EVEN IF THIS COMPLAINT\nCAME IN FROM THE SEC IT IS BUSINESS AS USUAL TODAY.\nARE CONTINUING TO TRADE THE ASSETS WE HAVE ON OUR PLATFORM\nAND WE TRADE OVER 200 AS IT ON OUR PLATFORM, THE SEC COMPLAINT\nMENTIONED 13 OF THEM. A SMALL PERCENTAGE OF THE ASSET\nTHAT WE TRADE. ALSO HAVE BUSINESS OVERSEAS AND\nOTHER COUNTRIES. WE DRIVE A LOT OF REVENUE FROM\nOTHER SOURCES THAT ARE NOT LINKED TO TRADING FEES. THIS WELL-CAPITALIZED AND\nADJUSTED ACCORDING TO Q1. WE HAVE A GREAT LEGAL TEAM\nPOLICY TEAM THAT IS WORKING ON THIS AND WHAT I WANT 99 PERCENT\nOF THE COMPANY TO BE FOCUSED ON IS JUST BUILDING GREAT PRODUCTS\nBUILDING GREAT -- BUILDING GREAT INFORMATION FOR OUR\nCUSTOMERS. THE VAST MAJORITY OF THE\nCOMPANIES TO KEEP BUILDING. ",
        "6": ">> HOW LONG DOES REGULATORY\nOVERHANG LAST? THIS COULD TAKE MANY MONTHS.\nDO YOU THINK THAT YOUR INVESTORS MAY LOSE SOME DATA OR\nYOUR CUSTOMERS WHILE YOU GO THROUGH THIS? >> THIS IS NOT A NEW CONCEPT.\nTHERE HAS BEEN A LOSS OF DISCUSSION, THE SEC HAS HAD\nRHETORIC AROUND THIS FOR SEVERAL YEARS THAT I THINK HAS\nINFLUENCED THE MARKET. THE INVESTORS IN COINBASE ARE\nOF THE BOYS THAT, IF THEY ARE -- THEY ARE COMFORTABLE IF THAT\nSOMETHING IS BEING REVEALED. THEY ARE TAKING A LONG-TERM\nVIEW THAT COINBASE IS A DIFFERENT COMPANY.\nWE ARE THE ONLY COMPANY THAT WAS BASED HERE IN THE U.S.\nTHAT WENT PUBLIC THAT HAS AUDITED FINANCIAL STATEMENTS\nAND HAS TAKEN A COMPLIANCE FIRST APPROACH.\nEVEN IN THIS RECENT SEC COMPLAINT THAT YESTERDAY -- IT\nWAS UNFORTUNATE THAT THEY DID IT BACK-TO-BACK WITH OTHER\nCOMPLAINTS THAT WENT OUT THERE THAT MAY HAVE BEEN INTENTIONAL\nTO TRY TO CONFLATE THE TWO. I THINK PEOPLE ARE SMARTER THAN\nTHAT AND THEY RECOGNIZE THAT ",
        "7": "THIS COMPLAINT AGAINST COINBASE\nTHERE WERE NO ALLEGATIONS. ALLEGATIONS OF MISAPPROPRIATION\nOF CUSTOMER FUNDS AND WASH TRADING, MYSELF AND THE\nEXECUTIVE TEAM WERE NOT NAMED PERSONALLY AND IT IS DEBATING\nTHE LEGAL TECHNICAL QUESTION OF SOME OF THESE ASSETS ARE\nCOMMODITIES OR ARE THEY SECURITIES?\nTHAT IS SOMETHING THE COURT WILL HAVE TO THING ABOUT.\nWE HAVE BEEN ASKING THE SEC FOR A LONG TIME.\nHOW TO GET MORE CLARITY. IT IS NOT OUR FIRST CHOICE WE\nWOULD RATHER DO THE REGULAR HEDGES PUBLISHED A CLEAR\nRULEBOOK BUT THEY WILL NOT DO THAT THE COURTS ARE THERE IN\nTHE U.S. TO SET OURSELVES UP. >> THIS WAS ABOUT SECURITIES. PART OF THIS WAS ABOUT STAKING\nALSO, STAKING OBVIOUSLY IS BECOME MORE IMPORTANT PART OF\nTHE CRYPTO ECOSYSTEM, DO YOU PLAN BASED ON HOW THE\nREGULATORS ARE TREATING STAKING ",
        "8": "TO WIND DOWN YOUR STINKING\nSERVICE? >> AGAIN -- STAKING SERVICE? >> STAKING ONLY REPRESENTS 3%\nOF OUR NET REVENUE. IT IS PART OF THE DECENTRALIZED\nBLOCKCHAIN'S. COINBASE'S STAKING PRODUCT IS\nBUILT ON A WAY TO BE COMPLIANT AND WE HAVE BEEN DIFFERENT THAN\nSOME OF THE OTHER ONES OUT THERE WHICH HAVE BEEN CALLED\nSTAKING. WHAT -- WE ARE GOING TO CONTINUE OUR OPERATING BUSINESS.\nDOES COINBASE HAVE THE ABILITY TO SERVICE THE SCALE. STAKING IS A DECENTRALIZED PART\nOF THE DECENTRALIZED PROTOCOL. ",
        "9": "COINBASE IS REALLY JUST A\nPASS-THROUGH MECHANISM. WE ARE HELPING PEOPLE ACCESS\nTHESE PROTOCOLS. SOME OF THE NOTICE CALLS HAVE\nLOCKUP PERIODS. WE ARE JUST MAKING THE\nINFORMATION AVAILABLE TO THE CUSTOMER. THE FUNDS ARE BACKED 1-1 WHEN\nYOU ARE STAKING SOMETHING IT IS BEING PLEDGED INTO THESE\nDECENTRALIZED PROTOCOLS AND WE DO NOT HAVE THE ABILITY TO MOVE\nIT SOMEWHERE ELSE AT THAT POINT. WE ARE GETTING PEOPLE ACCESS TO\nTHE DECENTRALIZED PROTOCOLS. >> THE BUSINESS WITHDRAWALS\nHAVE A MATERIAL IMPACT ON ETHEREUM'S PRICE AND HOW DOES\nCOINBASE PREPARE FOR SOMETHING LIKE THAT? >> WHAT DO YOU MEAN? >> IS THERE A BROADER RUN YOU\nHOW TO BE PREPARED FOR? IN OUR BUSINESS WE ARE NOT A\nBANK. ONCE WE DO NOT DO FRACTION RESERVE. BACK ONE TO ONE AND YOU DO NOT\nNEED TO TAKE OUR WORD FOR IT. ",
        "10": "AUDITORS, WHO HAVE GONE IN AND\nVERIFIED ALL OF IT. YOU CAN CONFIRM IT OUR\nFINANCIAL STATEMENTS. IF PEOPLE WANT TO WITHDRAW\nFUNDS 100% OF IT IS THERE. BARATUNDE: HOW DO YOU >> HOW DO YOU\nANSWER THE INDUSTRY? ON THE OTHER END, FINANCIALLY,\nRATES ARE HIGHER. KEEPING THEIR MONEY IN A BANK. WHY SHOULD\nTHEY KEEP THEIR MONEY WITH YOU? >> THAT HAS BEEN THE EVOLUTION\nOF STABLECOINS AND WE ARE ACTUALLY IN CONSORTIUM WITH\nANOTHER COMPANY IN THE SPACE. WE HAVE CREATED A UST COIN\nWHICH IS THE SECOND CARD TO STABLECOIN OUT THERE AND AS YOU\nMENTIONED THE INTEREST RATES IN THIS ENVIRONMENT HAVE BEEN BOTH\nA GOOD SOURCE OF REVENUE FOR US BUT IT IS ALSO SOMETHING THAT\nWE HAVE PASSED ALONG TO CUSTOMERS. CUSTOMERS CAN EARN REWARDS ON\nUSDC AND GET ACCESS TO SOME OF ",
        "11": "THESE HIGHER INTEREST RATE\nENVIRONMENTS. >> BARTER QUESTION ABOUT THE\nINDUSTRY. -- A BROADER QUESTION ABOUT THE\nINDUSTRY. HOW MUCH OVERHANG WILL IT HAVE? >> IT IS HARD FOR ME TO SAY.\nYESTERDAY WITH THIS COMPLAINT THAT CAME OUT, CRYPTO WAS UP.\nI WOULD NOT HAVE EXPECTED. I DO NOT KNOW IF IT MEANS\nPEOPLE KNEW SOMETHING WAS COMING BUT THEY EXPECTED IT TO\nBE WORSE THAN IT ACTUALLY WAS? OR IF THEY JUST FELT THAT THEY\nARE A BELIEVER IN IT OR SOMETHING?\nI DO NOT TRY TO PREDICT WHAT WILL HAPPEN IN THESE MARKETS.\nWE DO NOT OPERATE A HEDGE FUND OR ANYTHING LIKE THAT.\nWE WANT TO PROVIDE A GOOD SERVICE TO OUR CUSTOMERS AROUND\nTHE EXCHANGE AND ALL OF THE PRODUCTS WE OFFER. >> I WANT TO ASK ABOUT\nARTIFICIAL INTELLIGENCE. WE HAVE BEEN TALKING ABOUT ALL\nDAY. AS A CURRENT ENTREPRENEUR HOW\nDO YOU SEE AI -- CRYPTO ",
        "12": "ENTREPRENEUR HOW DO YOU SEE AI\nAS A COMPETING FACTOR? DO YOU SEE IT DOVETAILING WITH\nYOUR INDUSTRY AT ALL? >> AI IS ONE OF THOSE IMPORTANT\nTECHNOLOGY TRENDS THE U.S. NEEDS TO GET RIGHT ALONG WITH\nCRYPTO AND WE ARE SEEING A SIMILAR QUESTION START TO\nHAPPEN IN CONGRESS WHICH IS HOW SHOULD THIS BE REGULATED?\nTHERE ARE A COUPLE OF INTERESTING INTERSECTIONS\nBETWEEN AI AND CRYPTO. IN AI IT IS SO EASY TO MASS\nGENERATE THINGS WHETHER IT IS IMAGES OR AN ARTICLE.\nTHE PROMENADES OF THOSE OUT OF THE AUTHENTICITY OF IT CAN BE A\nLITTLE BIT HARD TO FIGURE OUT. IN A WORLD OF CRYPTO, WITH NFTS\nAND WHATNOT YOU CAN ACTUALLY HAVE A DIGITAL SIGNATURE THAT\nPROVES THIS WAS ISSUED BY BLOOMBERG OR BY BRIAN ARMSTRONG\nAOR BY WHOEVER. ",
        "13": "THE OTHER THING THAT MIGHT BE\nINTERESTING IS THAT A LOT OF THESE AUTONOMOUS AGENTS.\nPEOPLE ARE USING THEM TO ORDER GROCERIES OR BUILD THIS WEBSITE\nOR SPIN UP THE SERVER. THEY WILL NEED FINANCIAL MONEY.\nTHERE WERE ANY MONEY TO DO THINGS IN THE WORLD.\nTHESE AI AGENTS. I THINK ACTUALLY IN THE FUTURE\nYOUR GOING TO SEE A LOT OF CRYPTO TRANSACTIONS HAPPENING\nBETWEEN AI AGENTS. BETWEEN AI AND VARIOUS\nBUSINESSES AROUND THE WORLD. CRYPTO IS THE NATIVE MONEY OF\nTHE INTERNET. THE INTERNET IS GLOBAL AND\nDECENTRALIZED AND EVERYBODY CAN PARTICIPATE IN IT.\nIT WOULD NOT MAKE SENSE TO USE THE DOLLAR OR THE EURO IN A\nTRULY GLOBAL CONTEXT IF YOU WANT TO BE COUNTRY AGNOSTIC.\nI THINK AI WILL USE CRYPTO MORE. >> HOW MUCH ARE YOU WORKING ON\nTHE FUTURE? >> WE ARE NOT TRYING TO BUILD\nSOMETHING THAT IS ALLOWING BOTS ",
        "14": "TO TRANSACT IN CRYPTO AT THE\nMOMENT. WHAT WE ARE DOING IS PUTTING\nGOOD INFRASTRUCTURE. PICKS AND SHOVELS IF YOU WILL.\nWITH COINBASE CLOUD, WE ARE MAKING OUR APIS ARE ON HOW\nCRYPTO IS STORED AND TRANSACTED. COMMERCE HAPPENS.\nWE ARE EXPOSING THOSE LIKE AMAZON WEB SERVICES.\nWHAT BUSINESSES WILL INTEGRATE THOSE OVER TIME.\nWE ARE ALSO USING AI IN OUR BUSINESS IN A FEW OTHER WAYS.\nWE USE IT FOR FRAUD PREVENTION. UNFORTUNATELY WE GET PEOPLE TO\nGO UP AND PUT IN ITS OWN CREDENTIALS THAT WE HAVE\nDEVELOPED A VERY GOOD MACHINE LEARNING TO DETECT THAT.\nWE ARE OCCASIONALLY TESTING IT IN A FEW OTHER AREAS TOO.\nTHAT IS AROUND OUR DESIGN TEAMS. THEY WILL LOOK AT\nMAJORITY OR DOLLY AND SORT OF GENITIVE AI.\nSHOW ME FIVE IDEAS OF WHAT AN INTERFACE MAY LIKE LIKE.\n-- LOOK LIKE. ",
        "15": "AI IS A GREAT ASSISTANT.\nIT DOES NOT -- I DO NOT THINK AI IS TAKING PEOPLE'S JOBS AND\nTAKING TASKS OFF THEIR PLATES TO MAKE JOBS MORE EFFICIENT. TO HAVE A RESEARCH ASSISTANT,\nTUTOR, A MENTOR, THERAPIST, EVERYBODY CAN HAVE ONE OF THESE\nPAIRED WITH THEM. >> THANK YOU FOR YOUR TIME AND\nTAKING OUR QUESTIONS. "
    }
}