{
    "metadata": {
        "video_id": "Qqaf2hxce_4",
        "title": "Coinbase CEO Brian Armstrong on regulation: It's really imperative that we get this right",
        "link": "https://www.youtube.com/watch?v=Qqaf2hxce_4",
        "duration": "7:19",
        "channel_name": "CNBC Television"
    },
    "transcript": {
        "0": "THIS MORNING. COINBASE CEO HAS BEEN TALKING TO WASHINGTON OFFICIALS. I SPOKE TO ARMSTRONG YESTERDAY  AND ASKED HIM ABOUT THE EVENT HE ORGANIZED CALLED STAND WITH  CRYPTO DAY. >> YEAH, STAND WITH CRYPTO DAY. WHAT THIS IS REALLY ABOUT IS  THERE'S 52 MILLION AMERICANS IN  THE U.S. WHO HAVE USED CRYPTO  NOW. THAT'S 3X AS MANY THAT OWN AN  ELECTRIC VEHICLE. MANY ARE FRUSTRATED THAT THE  U.S. DOES NOT HAVE CLEAR RULES  ON THE BOOKS YET AND IT'S  PUSHING A LOT OF THIS INDUSTRY  OFFSHORE. I'M HERE IN D.C. WITH 40  FOUNDERS OF OTHER CRYPTO  COMPANIES. IT'S EXCITING TO GET THE MEMBERS OF CONGRESS TO MEET PEOPLE IN  THEIR OWN DISTRICTS STARTING  ",
        "1": "COMPANIES AND THAT ARE TRYING TO BUILD INNOVATION AND JOBS IN  THEIR OWN DISTRICTS. >> IT IS ON THE EVE, IF YOU  WILL, OF THE TRIAL OF SAM B BANKMAN-FRIED, WHICH STARTS NEXT WEEK. >> UNFORTUNATELY THE TRIAL IS SO SALACIOUS IT DOES KEEP GETTING  HEADLINES. I THINK IF YOU GO BACK IN TIME,  THIS REMINDS ME A LITTLE BIT  ABOUT THE MOUNT GAWKS ISSUE THAT HAPPENED. THERE HAVE BEEN SOME NEGATIVE,  BAD PEOPLE ATTRACTED TO THIS  INDUSTRY. THERE'S 40 FOUNDERS THAT ARE  HERE WITH ME IN D.C. WHO ARE  BUILDING THIS IN A TRUSTED AND  RESPONSIBLE WAY. THEY MAY NOT GET THE SAME  SALACIOUS HEADLINES BUT THEY ARE HERE IF WE CAN CREATE REGULATION THAT AVOIDS THINGS LIKE FTX BUT  PRESERVES THE INNOVATION  ",
        "2": "POTENTIAL. >> I KNOW YOU'VE BEEN CRITICAL  OF CRITICS OF CRYPTO. DO YOU SEE ANYTHING SHIFTING AS  YOU'RE THERE IN D.C.? >> YEAH, FROM OUR PERSPECTIVE,  THERE HAS BEEN A PRETTY POSITIVE DEVELOPMENT. WE YOSAW TWO BILLS EARLIER THIS  YEAR THAT GOT BIPARTISAN SUPPORT IN THE HOUSE COMMITTEES. WE ALSO SAW THE JUDICIAL BRANCH  OF OUR GOVERNMENT SEND A CLEAR  SIGNAL IN THREE SEPARATE COURT  RULINGS BY THREE SEPARATE JUDGES THAT THE SEC'S APPROACH WAS NOT  WORKING. IT WAS ARBITRARY AND CAPRICIOUS  AND UNLAWFUL IN SOME CASES. THAT SENT A CLEAR MESSAGE TO  CONGRESS AS WELL THAT THEY'RE  GOING TO HAVE TO STEP IN HERE  AND ACT BY CREATING NEW  LEGISLATION. >> WHAT IS THE STATE OF PLAY  WITH THE SEC CASE VERSUS  COINBASE? >> WELL, WE FEEL VERY CONFIDENT  ABOUT THE CASE. I MENTIONED THERE'S BEEN THREE  ",
        "3": "JUDGES THAT HAVE RULED IN OTHER  CASES AROUND CRYPTO, AND SOME OF THOSE FACTS ARE RELEVANT IN OUR  CASE. FOR INSTANCE, IN THE TERAFORM  CASE THE JUDGE RULED THE  UNDERLYING ASSETS WERE NOT  SECURITIES. THAT'S AN IMPORTANT FACT IN OUR  CASE AS WELL. IT WOULD HAVE BEEN BETTER IF THE REGULATOR HAD ACCOMPLISHED CLEAR RULES AND ENGAGED IN A RULE  MAKING PROCESS AS THEY'RE  REQUIRED TO DO AND THAT WAY WE  COULD ALL FOLLOW IT. IN THE ABSENCE OF THAT, IT  APPEARS THE COURTS WILL HAVE TO  COME IN AND CREATE THAT CLARITY  FOR NOW AND ULTIMATELY I THINK  IT WILL END UP BEING CONGRESS. >> YOU ARE EXPANDING INTERNATIONALLY AND DOING SO  AGGRESSIVELY, I IMAGINE AS A  FUNCTION OF THE REGULATORY OR  TIGHT REGULATORY BODY IN THE  UNITED STATES. IS THAT WHAT'S HAPPENING? >> WELL, COINBASE IS BASED IN  THE U.S. AND WE'RE NOT LEAVING  THE U.S. THIS IS THE BIGGEST MARKET FOR  US AND WE'RE THE LEADER IN IT. BUT WE ALSO WANT TO BE AN  INTERNATIONAL COMPANY THAT  ALLOWS US TO HELP MANY PEOPLE  ",
        "4": "AROUNDTHE WORLD FROM THIS  TECHNOLOGY. WE DO HAVE A PRETTY EXCITING  ANNOUNCEMENT ABOUT THAT. TODAY WE'RE ANNOUNCING OUR  INTERNATIONAL EXCHANGE GOT  REGULATORY APPROVAL TO OFFER  PROFESSIONAL FUTURES AND TRADING TO RETAIL CUSTOMERS. WE'RE EXCITED ABOUT THAT BECAUSE IT'S A WAY TO BRING IN A WHOLE  OTHER SET OF PEOPLE AROUND THE  WORLD WHO CAN START TO  PARTICIPATE IN THIS MORE OPEN  AND FREE AND FAIR FINANCIAL  SYSTEM. >> WHEN YOU LOOK ACROSS THE  GLOBE, DO YOU SAY TO YOURSELF  THAT OTHER PARTS OF THE WORLD  ARE NOW MUCH MORE FAVORABLE  TOWARD CRYPTO? YOU'VE MADE THE ARGUMENT  HISTORICALLY FROM AN AMERICAN  PERSPECTIVE, YOU DON'T WANT TO  SEE AMERICAN COMPANIES  EFFECTIVELY MOVE ABROAD. >> UNFORTUNATELY, I WOULD HAVE  TO AGREE WITH THAT, THAT AT THIS POINT THE U.S. IS BEHIND,  SEVERELY BEHIND ACTUALLY. IF YOU LOOK AT THE OTHER G-20  COUNTRIES, 83% OF THEM NOW  EITHER ALREADY HAVE CRYPTO  LEGISLATION ON THE BOOKS OR IT'S IN PROGRESS. IT'S BEING DRAFTED, IMPLEMENTED. THE U.S. IS BEHIND HERE AND  ",
        "5": "WE'VE SEEN THE SHARE OF THE U.S. JOB MARKET AROUND CRYPTO SHRINK  FROM ABOUT 40% TO NOW IT'S ABOUT 29% AND IT'S DUE TO THIS LACK OF REGULATORY CLARITY. WHEN I SPEAK WITH MEMBERS OF  CONGRESS, I HAD A GREAT MEETING  THIS MORNING WITH NANCY PELOSI  AND A NUMBER OF OTHER MEETINGS  LATER TODAY, THE GENERAL BROAD  CONSENSUS VIEW IS COMMON SENSE. IT'S LET GET CLEAR RULES ON THE  BOOKS AND PROTECT CONSUMERS AND  PRESERVE THE INNOVATION  POTENTIAL OF THIS INDUSTRY. >> WHAT DO YOU THINK HAS TO  BECOME THE INFLEXION POINT FOR  THAT TO HAPPEN IN THE UNITED  STATES? I KNOW YOU TALKED ABOUT LAUMT  LOOKING MORE FAVORABLY UPON WHAT YOU'RE DOING AND THE CRYPTO  INDUSTRY. BUT THERE STILL SEEMS TO BE THIS RESISTANCE AND WORRY THAT IT'S  ALMOST TOO HARD TO REGULATE SOME OF THESE CRYPTO CURRENCIES THAT  EVEN IF YOU COULD REGULATE THEM  HERE IN THE U.S., THAT YOU CAN'T REGULATE THEM PROPERLY OUTSIDE  THE U.S. AND THAT UNTO ITSELF  ",
        "6": "CREATES THE CONUNDRUM. >> I'M NOT SURE I'D AGREE WITH  THAT. THE WAS AND WE'VE SEEN THAT IN  SINGAPORE, HONG KONG, THE U.K.,  BRAZIL, AUSTRALIA. IT'S REALLY JUST THE U.S. THAT  IS SOMEWHAT OF AN OUTLIER HERE. I'D SAY IT'S A SECURITY ISSUE. IT'S REALLY IMPERATIVE THAT WE  GET THIS RIGHT. >> I SAW YOU TOOK TO TWITTER OR  I SHOULD SAY X NOW, IN REGARD TO JPMORGAN CHASE LIMITING THE WAY  THEY'RE ALLOWING CUSTOMERS IN  THE U.K. TO INTERACT WITH CRYPTO CURRENCIES. WHAT DO YOU THINK'S GOING ON  THERE? >> YOU KNOW WHAT, I'M NOT SURE. I HOPE TO FIND OUT MORE  INFORMATION ON THAT. BUT ONCE IN A WHILE WE DO SEE A  BANK SOMEWHERE IN THE WORLD THAT DECIDES THEY WANT TO DEPLATFORM  ",
        "7": "THIS WHOLE INDUSTRY. I DON'T THINK THAT'S OKAY. I DON'T THINK THAT'S THE ROLE OF BANKS IN SOCIETY. I THINK THE GOVERNMENT SHOULD DECIDE WHAT'S OKAY AND WHAT'S  NOT. AND THE CITY MINISTER IN LONDON  HAS MADE IT VERY CLEAR THEY WANT THE U.K. TO BE A CRYPTO HUB. THEY ARE TRYIN "
    }
}