{
    "metadata": {
        "video_id": "Z14yMF0w78s",
        "title": "Coinbase CEO slams SEC, considers investing more outside the U.S.",
        "link": "https://www.youtube.com/watch?v=Z14yMF0w78s",
        "duration": "9:27",
        "channel_name": "CNBC International TV"
    },
    "transcript": {
        "0": "into this conversation with\nBryan Armstrong, the CEO of Coinbase. Brian, let's kick off.\nLook, it's been an interesting start to the year for Bitcoin.\nWe've seen a big rally markets generally higher, what's been\ndriving that action? Yeah, well, I mean, just zooming\nout, we've seen crypto go through many different cycles\nover the last 10 years, there's probably been four of these\ncycles where there's rational exuberance and despair. And so\nwe always just try to zoom out and not get too attached to\nshort term price fluctuations. But I think you're right,\nBitcoin is up 71% year to date, we may have seen the bottom, we\nmay not we'll have to see. And I think one of the big things\ndriving that is probably, you know, the collapse of Silicon\nValley Bank has caused a renewed interest in people saying, Hey,\nwhat are the alternatives out there? Maybe there's a financial\nsystem that's not so connected to the traditional banking\nsystem that's more fair and free and global? And of course,\nthat's that's cryptocurrency. Yet, when we look at better the\ndata, we're not yet seeing retail participation, bank\nvolumes remain quite thin. Is that what you're what you're\nclocking into on Coinbase? ",
        "1": "Well, I mean, retail sentiment\ntends to fluctuate again, with these, these cycles. And so you\nknow, just zooming out, we look at as often developer activity,\nright, that's a good indicator of where things are going in the\nfuture. And actually, developer activity is up year over year,\neven, you know, in 2022, it came down quite a lot. But the\ndeveloper activity was up. And so that that's a positive\nindicator. We also shared in our q4 earnings, for instance, that\nthere's been an increased onboarding of institutional\ncustomers. So I think there's been, even though the market has\nhad some turmoil, there's been a flight to quality and Coinbase\nis really, you know, the only publicly listed company in the\nUS are financials are audited. And so people want to\nparticipate in the crypto space, they're going to come to\nCoinbase. And look, your share price is up 90 odd\npercent this year, as well, in tandem with what we've seen in\nthe markets, you know, investors are looking at Coin basis versus\nwondering what's going to happen next year, is this year you\nreturned to profitability? Well, I don't want to make any,\nyou know, future forward looking statements. But I will say we\nare I shared this in our q4 earnings as well, we're\nadjusting the business to sort ",
        "2": "of generate EBITA in any market\nenvironment, whether that's up or down. So of course, we had\nseveral cost reductions, you know, headcount reductions over\nthe last year, we really want to operate the business with\noperational efficiency. So we can, we can generate that EBITA.\nAnd one thing that was really positive as well, we've seen a\nbig shift in our revenue away from trading fees towards, you\nknow, subscription and services, we call it. And so that's now\nalmost half of our revenue. It's making our business a lot more\npredictable through these big up and down cycles. Are you\nexpecting to have to do any more layoffs\nthis year? No, we've, you know, we\nmodel out every year with a bull base and bear case and through\nany of those scenarios, we don't think we'll need to reduce\nheadcount further. But, you know, no CEO can predict the\nfuture perfectly. And you always have to make sure if something\nreally unforeseen does happen, you adjust quickly. I know you've been very\ninterested in international expansion here in the UK, in\nparts of Europe and elsewhere, as well. One jurisdiction I\nwanted to get your thoughts on was Hong Kong, because this is a\nfascinating one, you know, the Chinese mainland crackdown on\ncrypto over the last few years. Now, Hong Kong is sort of trying\nto position itself as a crypto ",
        "3": "hub. Is this a new market?\nYou're looking at in terms of expansion? Yeah, I mean, I think it's\nreally exciting what's happening in Hong Kong, it's it is kind of\nparadoxical with the Chinese government, you know, taking\nover it, they've China has, of course, banned crypto as sort of\nan oppressive regime. But surprisingly, Hong Kong is\nactually leading in a bit in terms of getting that regulatory\nclarity. And just zooming out, we're actually seeing really\ngood regulatory clarity emerged in Europe with a mica legislate\nlegislation. You know, here in the UK, I've been meeting with\ntop government officials, and there seems to be strong\nmovement towards a stable coin bill. You know, we're seeing\nsome of that in Singapore and other countries around the\nworld. So I think that's really positive. And basically, that's\nthe big thing that will unlock growth in crypto is we need that\nregulatory clarity. We actually need more of that in the US, the\nUS is a little bit behind on this. And certain regulators are\ntaking more of a regulation by enforcement approach, which is\nnot helping. Yeah. And you've been sort of\ntalking and been pretty critical of the SEC and others as well,\nin terms of their regulatory approach. What does that mean\nfor coin basis business in terms of are you looking at other\njurisdictions to set up shop in ",
        "4": "terms of headquarters?\nRelocation, anything of that Yeah. Well, you know, we're a\nbusiness with a, like any sort? business, we have a budget, and\nwe have to decide where to allocate it. And so that means\nwhat products we want to build, but it also means what countries\nwe want to invest in, in any given year. And with the US kind\nof lagging a little bit having this this regulation by\nenforcement approach that's really instead of just creating\na clear rulebook, so everybody has to play on a level playing\nfield. We are looking at other markets. I think the UK is\nactually a very good one for us. It's our, you know, the first\ncountry we went into outside of the US, it's our second highest\nrevenue country, and the UK, we've seen really great\nleadership from everyone from the pm to city minister, kind of\ntalking about how they want crypto to be based here in the\nUK, they want it to be a web three hub that's really\nattractive for us. And so we have an office here we have a\npresence. I think we're probably going to invest more. Let's talk about the SEC a\nlittle bit. They issued your WELS notice not too long ago,\nhave you got more clarity on precisely what the SEC is\nworried about right now? Unfortunately, no. You know,\nwe've met with them over 30 ",
        "5": "times in the last year. And then\nof course, you know, they allowed us to go public as the\nnext one, we filed in had many, in depth conversations with them\nabout our business. But even over the last month, or sorry,\nthe last year, we had 30 meetings, and never got a single\npiece of feedback from them about what we could be doing\nbetter or differently. And then this WELS notice arrived. And so\nit's really, it's really unfortunate, I think we're gonna\nhave to actually end up going to court to get the clarity we need\nand create that case law. It's a really, it's an abdication of\nresponsibility. I mean, the regulator's job is to publish a\nfear rulebook, and allow that market to be safe, but also to\nflourish in that country. And I think they've completely\nabdicated responsibility, investors are worried that this\ncould turn out to be a years long battle we seen with ripple,\nfor example, in the SEC, this is going on, and going on for some\ntime, are you prepared for a battle with the SEC of this kind\nof length? Absolutely. I mean, you know, we\nnever seek litigation. But it seems in this case that they\nhave initiated it. And if we need to get the courts to get\nthe clarity that we need, that we're very prepared to do that.\nI think the law is on our side, ",
        "6": "and the SEC has to follow rule\nof law, I think their actions have not would not be\nsympathetic to a jury. And so we're very prepared for this.\nWe're going to court to win. Just to be clear, I think we\nhave a very strong case. And that's what exactly what we\nintend to do. In terms of regulation in the\nUS, what is it that you would like to see at this point,\nbecause the SEC has been very much leading by enforcement at\nthis point in time. Other jurisdictions like cam in the UK\nvery much thinking about how to bring crypto assets into the\nregulatory fold, etc. So what is it in terms of the US that you'd\nlike to see? Yeah, so there's a few pieces, I\nthink, you know, getting a clear, stable coin bill passed\nin the US, that would be a great first step, there's a couple\nparties already working on this. The next big piece, I think,\nwould be to just to get comprehensive legislation around\nthe centralized actors and crypto, let's not, you know,\nfigure out the decentralized thing. I'll talk about that in a\nsecond. But there's clear consensus that the centralized\nexchanges, custodians, etc, should be regulated, they can\napply to a lot of the best practices from traditional\nfinancial services. Europe has already done it, you know, UK is\nworking on it. So there's no ",
        "7": "reason why the US needs to be\nleft behind. I think getting clarity about what's a commodity\nand what's a security, we have this crazy situation right now,\nwhere the heads of these two federal regulators in the US are\nmaking contradictory statements almost every few weeks, about,\nyou know, Aetherium, for instance, like the CFTC says,\ncommodity the SEC says, security. So of course, you\nknow, how is a business supposed to operate in this environment\nwhere even the federal regulators can't agree chitlins against them without\nargue? Well, we've told you what they are. We've said what a\nsecurity is. We've been very clear on that. Yeah. But what am I supposed to\ndo, if the other federal regulator that we have to work\nwith is saying something contradictory, right. And I want\nto make a good point here, which is that, you know, him making a\nspeech is not regulation, that's it's offering an opinion, we\nneed something clear. And there is a there's something called\nthe Administrative Procedures Act in the US, they're required\nby law to engage with industry have a comment period, and\npublish a clear rulebook, and they are not doing that. And so\nthis rhetoric, you know, kind of playing for political points or\nto the media is not helping ",
        "8": "anybody. In fact, it's causing a\nlot of harm to the US economy and the US consumer. But I just want to get your take\non a couple more things. Firstly, your stock, you've been\nselling it over the past few months, there's been a lot of\nspeculation made about from the crypto community about why this\nis happening. How do you respond, and particularly around\nthe SEC, WELS? Notice when there's more stock being sold? Oh, well, yeah, I mean, I think\nabout a year ago, I mentioned I was going to sell about 2% of my\nholdings over the next year. And so, you know, it's important for\nme to kind of fund other initiatives in science and\ntechnology. And I think, you know, if you've been working on\nsomething for 10 years, and you know, 97% of your net worth,\nisn't it? I'm going to slowly, you know, over the next like,\n510 years, like slowly diversify and just your Outlook now for\nthe rest of the year. What are out of that, your expectations in terms of\nthe broader markets? You mentioned, institutional players\nare sort of coming back into the fold. Do you expect those retail\nparticipants to come back in or or do you think they've just\nbeen heavily burned by the last cycle? Retail Investors, their\nsentiment fluctuates along with, ",
        "9": "you know, crypto prices, or it's\nnot even necessarily the prices because that's very trading\nfocus. It's really about what are the new use cases? So in\npast crypto cycles, we saw things like, you know, NF T's\npeople got excited about or defy right, and, you know, new\nemerging use cases, I think those are the things which tend\nto drive these these crypto price cycles. And so, you know,\nI feel very confident that crypto is going to increase over\na period a long period of time, but what happens in any given\nquarter or month or year? I don't know "
    }
}