{
    "metadata": {
        "video_id": "WJHk2ywS7To",
        "title": "Fireside chat with Brian Armstrong - SciCon 2023",
        "link": "https://www.youtube.com/watch?v=WJHk2ywS7To",
        "duration": "31:35",
        "channel_name": "ResearchHub"
    },
    "transcript": {
        "0": "Mhm. Hello everyone, and welcome to the grand final the last stage of SciCon 2023. Last year we kicked off SciCon 2022 with Brian for a fireside chat. This year we're closing SciCon 2023 with Brian with another fireside chat. So first of all, Brian, it's really, you know, great pleasure again to have you here. Thank you so much for coming to SciCon 2023. Yeah. Thanks for hosting. It's been awesome to see the community come together and. Been really a lot of really good progress. So thank you both. Yeah, really, really excited to, to host this chat and I would start from, um, you know, a development from, from last year. So last year we hosted the first edition SciCon 2022, uh, completely, you know, spun up by the, by the community this year. We have the second edition one year later. What changed at Research Hub? ",
        "1": "Yeah, Joyce, do you want to start off or you want me to jump in? I think probably the biggest thing that changed is kind of our community. Like we've, I think, you know, over time just kind of been hammering away at like bringing in like talented people like yourself, Riccardo and Tyler and Jeff and everybody else who helps to make these things kind of happen. So, yeah, to me, the thing that's really exciting that's going on with Research Hub right now is the people involved in the content that they're creating. So. Yeah, I think, you know, just putting our heads down and trying to grow. Yeah. And the pace of shipping has been really great too. The team's been crushing it all based on your feedback from the community. So the citation manager got out there. Um, the number of RC that you get for every upvote is now kind of a floating exchange rate. You may have noticed that we're sort of targeting. Distributing about 5 percent of the RSC per year. And, um, you know, so upvotes, you get a lot more RSC now that that was good. Um, we just put out hubs V2. There was a big fundraise that happened, which was a big milestone for research hub. ",
        "2": "So, um, the number of kind of, you know, weekly active contributors has been going up a year over year. So it's been really good to see the slow, steady progress from this initial seed of a small community. Yeah, what I can tell you is that it is evident that the community is growing, like, from someone that uses the platform every day, you can see that the content is increasing, you see new faces, you see some really interesting, like, even experiments, people that try out different things. So, with the LK99, you know, we started collecting papers, and now we have, you know, the paid peer review initiative. So, really, a lot of stuff going on at the same time, which makes it. really exciting, especially for newcomers that comes into a new platform. Uh, they see as a, you know, Reddit style kind of platform and then they discover this plethora of like many things that you can do on ResearchHub. So really, really exciting. You just mentioned the fundraising. So let me touch on this a bit because we just had last week, uh, a panel and investing in DeSci panel where we had a few guests, which also, you know, was invested in, in, in ResearchHub. ",
        "3": "And so maybe something that I wanted to ask you is, How, um, you know, important it is to, you know, choose the people that back your project. What was the, what was for you to the decisive factor, the most important factor in choosing the people, you know, who decided to back research hub? Yeah, well, I'll start off and Joyce, feel free to jump in. I mean, I know you, you, you met with a lot of these people too. Um, well, I guess the first thing is that, you know, research hub has been self funded so far, and that was a great way to get off the ground, but. You know, it's always useful to get other people around the table who have experienced building applications to make sure that you're not stuck in your own group think, or, you know, you're not diluting yourself. Um, and so it's an interesting group of investors out there that are excited about DeSci. Um, they're interested in the intersection obviously of things happening in crypto, but also. Uh, with scientific research and it's a really cool community of, uh, people in DeSci. ",
        "4": "It's relatively new. There's a lot of cool projects. Um, research hub is certainly not the only one. And we want to work closely with a lot of those out there. So it's a non traditional set of investors. I would say, um, you know, the, the big venture capitalists are still excited about, you know, SAS and AI and like kind of these big topics. Um, but we got to meet some really bright people who, especially in this case, um, at OSS capital, who had. It's been through the open source movement in a number of different companies and seeing how that had built great, a great amount of value for both for customers and shareholders. Um, and so when they saw that research hub was open source and we were doing DeSci, that was like a really cool intersection for them and they stepped up in a big way, I also want to give a big shout out to Adam Draper at boost VC. They were another big investor in this round. And, you know, Adam was actually, I, um, I think he wrote the first. Seed check in Coinbase, um, is back in the day when he and I met in Palo Alto. And, you know, he's always been such a champion of startups, helping them grow and do better. ",
        "5": "And, um, it was cool to have him, you know, 10 years later, we got to work together on another project. So yeah, Joyce, I don't know. What was your experience kind of meeting with the investor landscape out there? Yeah, so we met with a bunch of different investors, and I feel like we found like a really good partner. Um, in JJ from OSS capital, um, open source software capital. I think like being around people who have been there before building open source projects. Um, and as everybody knows, we're trying to make science more like open source software. So there's a lot of lessons that I think, you know, we can learn from the progression of how like the open source software industry has grown over the past like decade or two and apply that you. To science. And so, yeah, we're really lucky to now be sitting at a table with a lot of people who have actually done that before and can help to like guide research hub from their insights. So extremely value aligned investors who kind of have the same vision that we do for the future of scientific research. So we feel very fortunate and grateful to have the partnership of those investors. Yeah, absolutely. ",
        "6": "I feel like that's like any anyone that you know, so, uh, even live or recorded, we have the recording up on YouTube already. Our panel from last week can probably already, you know, see that that alignment was there. We had an amazing conversation. Some of these topics came out, you know, the alignment between you know open science open software all the similarities and differences between these different, you know, principles. So I would say, absolutely, like I felt it when I was moderating the panel. And, um, Talking about, you know, some of these, um, I would say things that go together, um, something that I wanted to ask that I wanted to ask you for, uh, sometime, Brian, I would say like a couple of months that I've started to think about this is that Coinbase has been a early leader in onboarding people to crypto, uh, since the, you know, very beginning. And now with Research Hub, we're trying to onboard scientists. On this new platform, I would say that scientists are not extremely excited about changing their, uh, you know, the day to day operations. And so the more I think about it, the ",
        "7": "more I think that we're also inevitably onboarding them to crypto as well. And so do you think there's anything that we could learn from your time at Coinbase to make this onboarding to DeSci better to facilitate this process? Yeah, well, a couple of comments on that. So one is that I think crypto is really a generational phenomenon. Um, you know, the largest demographic of people using crypto are in the 25 to 35 year old age range. Um, and it's, by the way, it's, it's very diverse in many ways. Um, politically, gender, you know, ethnicity. It's really crypto is for everybody and there are people who are much older who are using it as well. Oftentimes kind of more as like an investment or something like that. They're thinking of it like a brokerage account. But the people actually using crypto for non investment purposes day to day, you know. Payments and capital formation and, you know, decentralized social and all these kinds of cool things, um, you know, decentralized identity, they tend to be in that younger demographic. And so I think for, in terms of ",
        "8": "scientists that are going to be early adopters of research hub, it's going to be probably people who are, you know. Um, a few years out of doing their PhD are probably going to be a larger group. And hopefully if we get enough of those and you know, they'll grow in their career over time. But if we get enough of them, we'll also get the people who are older and are living on the frontier. I don't, it's, I want to make sure we welcome everybody into the community, but that's a little bit of my guess. Another thing that we did really intentionally on Research Hub is we made sure that the site was useful, even if you didn't really know what crypto was and you didn't have a wallet. Um, you know, for instance, a lot of people might come to the site first and they don't even want to create an account. They just want to browse, maybe they're reading comments or peer reviews and just using it kind of like to read what's happening in their field. Um, but over time they might be like, Oh, I kind of want to upvote this thing. Um, you know, we, we prompt them to create an account. Notice we're not prompting them to create a, have to have a crypto wallet. If, if you had to have a crypto wallet to even participate or create an account, I think, you know, you see that in a lot of web three apps where you have to connect your wallet in the top, right? ",
        "9": "Um, we intentionally didn't do that and we made sure that anybody could on board. And frankly, they may not even know really what RSC is underneath for a little while. But if they, if they start to participate more and they start to accumulate RSC at some point, they're going to be like, that's interesting. There's an exchange rate. What is this thing? You know, and some people, you know, they'll kind of grow up the ladder with us. So anyway, I think, uh, it'll be an important asset, uh, for research hub over time to bring in more people and allow them to really participate in the rewards of the community. Um, but it's okay if people don't know what crypto is to start, we got to kind of meet them where they are. Yeah, I've been talking to that answer to like talking about kind of like the early career academics who are most likely to use research hub. There's actually been, I think, like a really good influence from younger people in academic science where. They're kind of questioning some of the like, um, presupposed norms that exist, like peer reviewing for free, um, and doing a postdoc until you're like 35 years old. And really, like, I think, like, ",
        "10": "admirably standing up to make sure that they're compensated for the efforts that they give to the greater kind of like scientific ecosystem. And I think that's kind of similar with like crypto too, where. You know, like, I've had a Bank of America account that has charged me overdraft fees and has been like, pretty not great. And so, like, part of the reason that I got into crypto is because of, like, frustrations with the current, like, financial infrastructure in the United States. And so I think, like, the target market of early career researchers can really jump in and be, like, a great user base for research hub due to their kind of, like, um, like, history of standing up to some of these, like, kind of nonsensical procedures that exist in academia. Yeah, absolutely. And I think something that research does really, really well is interfacing with the scientists like the interface feels really easy to use, like if you're if you browse any other platform like it really seems easy to use. And so, I would say we really had. Uh, limited problems with onboarding people because like everyone that came ",
        "11": "to the platform knew already what to do. And in terms of like accumulating this RSC, something that I think is really, really exciting every time I talk to some of these early career scientists, telling them that way, when they're actually coming to the platform, and they had some, some of their papers. Published already. They could come to the platform, claim their papers and the RSC. There was an RSC bucket waiting for them there. So it's kind of like a reward for discovering this platform and starting to engage with the community. So I feel like that's also something that you have them sitting there. So maybe you spend some time in the platform want to learn more and then that's how you get into into crypto more as you're using the platform. So absolutely. Maybe something that I just, you know, so the tweet that you put out Brian. A few weeks ago about, uh, you know, about research hub about what you, uh, I would say you don't like about how science is done nowadays. So maybe there were several points that you made. So maybe a few that I wanted to touch upon is that you mentioned the need for scientists to focus ",
        "12": "on high risk, high reward, uh, kind of breakthroughs that could uh, Potentially translating to real products. How do you see this shift in research occurring? Is there any potential benefits that you see in this? Um, yeah, well, I do think that unfortunately science today is kind of disconnected from true market forces. And, um, there's kind of this false economy, if you will, uh, based on citations and tenure and, um, things like that, that's driving people's behavior. And you see it show up where a lot of research papers. You know, just to be blunt, it's like, they, they aren't really, they're very incremental. They're not useful. Nobody, almost nobody reads them in the whole world. Right. There's millions of papers published every year. A lot of them are just trying to help somebody get their PhD or, you know, achieve the next checkbox in their career. And it's kind of considered to be like a mark of shame if you work on something for six months or a year and you get a negative result or whatever. And it's like, Oh, so of course ",
        "13": "people, it creates risk aversion. People want to. Choose something that they already know is going to work or, um, you know, to advance their career. So that's really, that's really dangerous. You know, if you look at, um, areas of the economy where we've gotten really rapid innovation, like in software or technology and things like that, it comes from people being okay with a certain percentage of failure because you're able to try a lot of different things. And so you try more ambitious things, knowing that even if only. 10 or 50 percent of those things work, um, it'll make up for the other losses. So that's, that is a very entrepreneurial innovation mindset. I think we need to bring more of that to science. Um, and I think Research Hub can help with that because, you know, if, if you're putting out work and it's not, um, it doesn't get into some journal based on, you know, this anonymous set of three peers who may or may not have their own interests. But you, you get to the top voting in that, in that hub based on a community of experts and it's crowdsourced, right? That, that's really exciting. ",
        "14": "It sort of gets, it gives you more immediate feedback. Um, it's more democratic. You could say, um, the thing that has the most stars on GitHub or the most upvotes on stack overflow, I trust that more than. You know, what it says in some textbook or what one supposed expert says, right? So one other area that I think we need to do to fully connect research to a market economy is that when people do create major breakthroughs that have commercial applications that can really benefit people like CRISPR or something like that. I mean, they should have huge financial upside in that. Um, and unfortunately, you know, you know, university funding, tech transfer offer offices, things like that. They're not really set up that way right now. And so it's kind of a rare thing when one of these breakthroughs does happen. My hope is that Research Hub over time can actually be a place where people publish research. Um, there is a, you know, we should have like a one click check transfer office that's like, here's the common license. ",
        "15": "Just like in open source, we have the MIT license or for creative people, we have the Creative Commons license. There should be like a standard or, you know, in Y Combinator, there's the safe, like the standard terms, right? Um, there should be something like that for people who want to start to publish science on Research Hub and say, if anybody wants to license this. To create some sort of commercial product from it. Here's a standard terms, you know, maybe you share whatever 1 percent of the revenue with me. Um, and then the people who actually are generating these breakthroughs, they, I mean, they should become fabulously wealthy from it and, you know, be able to invest in the next generation of science. So I'm hoping we can do some of that, some things like that over time. And we're not there yet. It'll take a while. Pat, anything else you want to add on that? I think it all boils down to financial incentives. Like right now, the way that you get grant funding is by doing these kind of like small, conservative, incremental studies where you already have like preliminary data that suggests that like the end result will actually work. And this is, you know, just a result of how research grants are currently structured. ",
        "16": "Um, we, we have a, a user who is interested in quantum biology and is seeking funding to study quantum biology. And this is a topic that like, uh, certain niche experts think is really interesting, but it's very hard to convince a panel of 20 experts on or within the NIH to agree with that. And so just the NIH is really unlikely to fund a very like exciting, risky study. And the result of that is we don't get a lot of really like exciting, risky studies. And so, uh, the beautiful thing about crypto and what we're trying to do with research hub is tweak financial incentives in order to maximize the productivity of the capital going into research. And kind of like Brian said, like part of that is like trying risky, exciting things. So we'll be able to like use evidence based. Metrics in order to allocate capital in a way that actually, like, increases the total, like, value of knowledge produced by the community. So, yeah, attacking the financial incentives at the core of the problem, I think, is the really exciting thing that we're doing with research hub. Yeah, 100 percent and, like, we're seeing ",
        "17": "this with, and I'm going to get into that in a moment, but with a peer review, the paid peer review initiative that we just started in our research hub, we basically are kind of validating the idea that, you know, changing the financial incentives could help us even, like, reduce the time that we get from the preprint. To the actual publication, you know, but do you have anything in mind to assess how some research is helping people? Because, like, obviously, 1, um, kind of like, um, effect of trying to prioritize anything that, you know, could potentially translate into products is that, you know, you risk. Having basic research, kind of like falling behind it. It's also really important for science, obviously. So is there any way do you think like, again, this could be like, uh, thinking out loud potential ways to assess what could, you know, what could some ideas, uh, do in terms of like helping people in the future? Yeah, I mean, that's a big question and we certainly are fans of basic research. We want that to continue as well. Um, you know, one thing I would say ",
        "18": "is that I think even, even some basic research has more directly applicable. Um, you know, there's many things that it may enable 50 or a hundred years from now that we can't fully contemplate, but there's also something that might be useful, like in the next five or 10 years, right? Like, I don't know if people consider CRISPR to be basic research, but that kind of had more immediate implications. Or let's take like particle accelerators or something like that, where it's like, I don't know, this is helping us understand the fundamental nature of the universe. What's the commercial application? Well I mean, I just met with like a startup, you know, a few weeks ago, that's actually trying to use particle accelerators to build the next, the next generation of semiconductor fabric tabs to get like lower, lower wavelengths of light. Right. Then it can be done with traditional lithography. So I don't know. I mean, That's an example of a company that would probably want to license some of this tech. Now, I don't want to overstate that case. There certainly could be people that surely want to dream about fundamental issues in the world, ",
        "19": "and, or not issues, but like the nature of the world that we live in. I think they should still, there should still be a market for that. They should still do that. They should still, so the, the upvoting mechanism, um, just, which is just a measure of like, how excited are people in the world about what you've discovered? You know, if you discover gravity or whatever, some fundamental thing that doesn't have a near term commercial application, but people are like, their mind is blown. Um, I think that's great too. And you're still gonna get a lot of upvotes and a lot of RSC for that. So. I think it'll work out. Um, and we, we want to welcome both basic research and like things that are more near term commercializable. But Joyce, how do you, how do you think about it? Well, one like case study that I think about a lot here that I think illustrates the value of basic research is the development of Taxol, which is a chemotherapeutic drug. Uh, this was discovered by a dendrologist, someone who studies trees, because it's basically a compound that acts as an antibacterial within like the tree bark of just some random tree, I think it was in Australia. And so this was like a basic scientist who's just studying trees. ",
        "20": "They find this compound and it turns out that this compounds, like, actually great at, like, killing certain types of cancer cells. And so this compound ends up being monetized by, like, a company where the person who discovered the initial compound. Didn't see any of the financial upside. So I think, like, making sure that the basic research that ends up producing some kind of, like, valuable product is tied to that eventual reward will again, like, create financial incentives for the basic researchers to be, like, kind of focusing on stuff that they think might actually be, like, productizable eventually and create something better in the world. So yeah, I think again, you know, broken record here, but financial incentives where the people who discover the stuff that is valuable get paid for that discovery. So yeah, taxol is a great case study and kind of like how we can financially incentivize basic research in a way that's actually productive for like the economy and world as a whole. I think what you just mentioned is the key. ",
        "21": "Having this Process where you can tie all the pieces together because you don't know, like you're, you're probably doing some basic research. You don't know what's going to happen in like 20 years, but then in 20 years, something happens. And that was because of your research. So you want to have a chain of all the events that concatenated and that made that product actually be able to get into the market. And so if you have that chain, you can then like, you know, have the, all the rewards kind of like trickle down to the scientists that, you know, started the research in the first place. So, as you said. Yeah. It's just having all of these events tied together is probably the key. It's a lot better than having a bunch of citations 20 years later, that's for sure. I mean, it reminds me a little bit of like, um, this might be a weird example, but like Getty Images, where if you're, if you're a photographer and you're just going about your life and you're taking photos of this cool location, this, this interesting person, like And you're just putting out this inventory, this, um, this, yeah, inventory of different material that you've photographed. And then, you know, maybe 20 years later, something happens like, you know, some big world event, a tsunami happens there and they need, they need ",
        "22": "a photo of that person at that time. And boom, you know, your licensing revenue, like just went up by 10 X, but you have to have like a, A portfolio of different things out there. So I'm hoping that there's many scientists out there in the world in the near future, where they're just observing things, discovering things all the time. And they're putting out, Hey, this, this material has this kind of property and this thing, you know, and, and people will start to get hits on it. Um, not because of like, they, they met each other physically at some conference, but just because, you know, research hub has become a shelling point where. This material is there and instant connections can happen between people who've never met each other in real life. Absolutely. And you, you gave me a couple of hints, Brian. So I have to ask you, you told about materials. You talked about excitement, the LK99 saga. That was something that I've never witnessed in my life. All of the, like the online community started to think about, just talk about science. My, my feed was like full of just like floating rocks for two weeks. That was really exciting. And we, I never saw honestly, like. ",
        "23": "Of the, like the public coming together to discuss science so much. There was so much exciting about, you know, about science. What is there something that research can do to foster even more of that online collaboration in the future? Because that was just like, amazing to see, honestly. Yeah, well, Joyce, you should jump in here again, too. But I think, um. That was a great indication of where science is going, which is that it's not about waiting 18 months to get your paper in some journal and like stuffy boardrooms and whatnot. It's like science is going to start to happen faster and faster. And that's, that's the mission of research hub is to accelerate science. We saw this by the way, with, with COVID to operation warp speed, like once there was a imperative. People, you're not going to wait to get some, you know, journal to review it. Like I'm going to publish the thing this week. You're saving lives. Right. And potentially, and people will comment. And so anyway, how do we take the next, that to the next level with research hub? Well, okay. It's not just about social media and sharing links. It's like, how do we actually get a more like a science open science platform to take place? How can we share the real data sets? ",
        "24": "Right? Um, how can we run the code behind that? How can we do peer review, uh, right in that? How can we get funding flowing through the platform for high potential research? And so this is where, you know, I think social media has demonstrated the need for this and a dedicated open science platform can actually add in all the additional functionality to make it even better and 10 X it from there. So I don't know. Those are a few of my thoughts. Yeah, so this, uh, the semiconductor excitement, it reminded me of a couple of years ago, there was another group that had claimed to, like, come up with a room temperature semiconductor or superconductor and, um, the way that it was debunked was someone shared a preprint on bio archive, kind of analyzing their data and criticizing the data. It was actually like a 4 sentence preprint saying, I don't know about these results. And then that preprint kind of, like, exploded from there. Yeah. But the thing that I think is really exciting about the LK99 example is like, it wasn't a scientist on a preprint ",
        "25": "server who was validating the findings. You know, there was like a startup in California, there was a cat girl in Russia, you know, it's like regular people, you know, can participate in kind of the scientific endeavor. And the beautiful thing that's happening now I think is like, we're realizing that. And it's no longer just like the ivory tower who can participate in these types of discussions, you know, real people can participate and find out if like their reality matches what exists in the journals. And I think that's the really exciting thing about LK99 and where research hub can step in to help make it, you know, financially sustainable for just a random person to participate in this process. Yeah, I mean we we didn't get a breakthrough, unfortunately, but what we got is a conviction that science can happen online, just as fast as you can communicate with a tweet and so on, obviously. For all of that we need validation and something that I need to touch on is we also need some sort of reputation to make sure that we can spot whoever you know has ",
        "26": "experience in the field, obviously that does not exclude anyone that wants to come into the field, but we need to recognize. Whoever has some, you know, specific specific credentials because they've studied because they've produced research in that specific field. So how important I know you mentioned 1 of the 10 things that you're most exciting about is on chain reputation. And so we at research job are also really excited about reputation in the context of academia and science. How do you think maybe these two tie together, but also how. Important. Do you think reputation is in general in science? Yeah. So it's, it's actually interesting. Blake and I, or, uh, Joyce and I were just talking about this in the, in the prior meeting, but, um, yeah, so I think it's very important for research hub to incorporate a concept of reputation and really expertise around different topics, not just in general and how, how I meant it about, um, on, on chain with ENS, but actually like around certain subjects. So for instance, you ",
        "27": "know, Joyce got his PhD. In, in one subject, but he's like also studied a certain molecule and he, you know, you can kind of go down as deep as you want. And we, we were, we're kind of playing around with a mock up, um, of a profile page on research hub, where every user can sort of have, like, you can imagine like a miniature bar graph of each, like I'm, you know, someone's like a nine out of 10 on epigenetics, but they're like a four out of 10 on computer science or whatever. And you can kind of develop that based on both their publishing history. Um, but also. Like if they've commented or peer reviewed other papers and gotten up votes on it. Um, those kinds of things lend themselves to like a credibility or expertise score. So that's a pretty exciting thing that we could add in over time and start to make the way that we score things today is like every user's vote counts the same, but I think it should over time probably be like a weighted average type voting based on their level of expertise and their reputation on ResearchHub. And the thing that I find most compelling about our approach at Research Hub is like, Brian and I, like, we don't know the best way to do this, right? ",
        "28": "Like, we're really lucky in that we can, like, take the opinions of our user base and kind of, like, iterate on how, like, real world contributions and contributions on Research Hub translate into a reputation score. So we're really lucky in that, like, we have people in our community right now who are telling us how we should take these, like, Uh, metrics that exist in the world and translate it to a reputation score. And we plan to do that forever in order to like continually iterate and make sure that like the scientific community has a say in how their like research outputs are judged and rewarded. And it needs to be, it needs to be dynamic because metrics changes. I hope that our scientific metrics change and it will change in the future. So metrics change the way we do science change. So this reputation should also change. And you said something really important, Brian. It's important to take into account, you know, all of your certifications, all of your, you know, degrees and so on. But it's also important to take into account the activity that you might have on a platform like research hub. Because I think about citizen scientists. ",
        "29": "They don't have a maybe a prestigious affiliation, but they do engage with science, and they might know a lot about a specific topic so they need to have their own reputation on the platform as well. And so research hub is kind of like giving them the opportunity to build their reputation. Online, as you would do, you know, which is like interacting with other people knowledgeable about, you know, specific field. So that's also, I think, really, really exciting about research hub, you know, the inclusivity of, like, bringing these people on the platform, people that know a lot, and people are just just learning and getting started on their, on their track. Absolutely. Yeah. That, that sums it up. Honestly, I have, uh, I wanted to touch on these points. Um, is there anything else that you'd like to share with our community? Maybe just please help us spread the word, you know, if you're already a research hub, uh, member, please share it on social, go talk to a couple of your friends that can come in and, um, help make these hubs even more vibrant. And if you're passionate about it, you know, apply as an editor, um, ",
        "30": "and help us curate more content. Uh, we'll be uploading kind of as many of the preprints out there that we can. And, um, so we have broad coverage, but we also need to know from your point of view, what are the latest things that you're excited about to, to keep improving the quality of the content, make it, make it deeply scientific and make sure it's, you know, the initial core group that we have today, we have to kind of help you, we need your help to curate the content. So it gets to the next level and the next level and stays high quality. I just got, I just got a last minute question. So if you don't mind, I got to wrap. Yeah. Okay. So just, um, quickly, uh, in next two or three years, where do you want to see research hub? Oh, well, there's lots of good stuff on the horizon. I mean, um, I think it'd be great to. Get capability around like Jupyter notebooks in their data sets, um, funding capabilities, um, having kind of like a research hub pro account, um, where for people who want to, you know, bring ",
        "31": "their entire lab into the lab notebook, um, and have other benefits on the site. Um, so anyway, there's a ton of things we could do, but yeah, it's, it's early days for sure. Okay. Well, thank you very much, Brian. It was really a pleasure to have you. So we'll ask, you know, we'll ask for another Fireside chat again next year for SciCon 2024. But again, really a pleasure. Thank you, Brian. Thank you, Patrick. And see you soon. Thank you, Ricardo. Thank you, Ricardo. Bye. Mhm. "
    }
}