{
    "metadata": {
        "video_id": "8YQJ-i62_H4",
        "title": "How Brian Armstrong built Coinbase | Challengers by Freethink",
        "link": "https://www.youtube.com/watch?v=8YQJ-i62_H4",
        "duration": "9:17",
        "channel_name": "Freethink"
    },
    "transcript": {
        "0": "- A couple of my \nfriends were like, \"I don't know why \nyou're into this. It seems like a scam.\" There was periods \nwhere I felt like,  \"Am I crazy?\" 'Cause I just couldn't \n help myself. - 'Bitcoin is a\ndigital currency. It just sounds so silly,\nbut maybe its not.' - I was an employee at Airbnb, I couldn't stop \nthinking about Bitcoin. I had a lot of self-doubt\nabout it at that time 'cause, again, my friends\nthought it was weird. You almost had to have like\na computer science degree to understand it. So there's these things \nlike private keys, and if you lose them, \nyour money's gone. If you wanna send a payment in crypto- kinda cybersecurity thing- -where someone's \ntrying to hack your stuff. And it was all very\nclunky and hard to use. But the thing that \nI loved about it was that it's accessible \nto everybody in the world. And I eventually said, \n\"You know what? I've got to try building\nsomething in this space.\" - The global financial system banks, and other institutions\nprone to inefficiency and sometimes \neven corruption. Brian Armstrong \nbuilt Coinbase to increase access to \na new world economy— the crypto economy. The company took off. ",
        "1": "- 'Coinbase going public \nthis Wednesday through a direct listing.' - Coinbase is now valued at and has made Brian a\nleading voice in crypto. But what happens when you\ngo from being a disruptor to building an institution? This is a show about founders\nchallenging the status quo. - It turns out to build an entirely new economy for the  world, you can imagine is a\nbig, crazy, ambitious mission. I spent some time \nworking at Airbnb, and one of the most difficult\nthings they had to solve was how do you move\n money around the world, to all these countries? There was often very\nhigh transaction fees. So you'd lose like \n6% in a transaction. And then there \nwas also delays. Sometimes it's like\nseven days to move money. But it doesn't really \nneed to be that way. I mean, think about it,\nif you send an email or a WhatsApp\nmessage or something, it arrives instantly, it'll go everywhere \nin the world, it's free. What we haven't seen \nis a financial system that works like that. - On October 31st, 2008, ",
        "2": "a pseudonymous person \nor group of people named Satoshi \nNakamoto released the Bitcoin white\npaper into the world. It laid the vision for a \nsort of digital money that removed the middleman from financial transactions, and was governed by code. Not people. - When I read that Bitcoin\nwhite paper, I thought,  \"Wow, this could be a more \nfair and free and open  payment system \nfor the world.\" But frankly, it was kind \nof an intimidating thing  that people didn't know \nhow to get access to. - In the early days, Bitcoins were lost and stolen, exchanges were \nshut down. It was a new frontier\nthat was complicated. - And so, I would\nstart to think about how could this protocol \n be easier to use? How could I make something\nthat helped it grow? - So Brian set out to \nmake a simple way to buy, own,\nand sell Bitcoin in hopes of improving \naccess and adoption. - I saw online that there\nwas a Bitcoin meetup. Some people were like\ncomputer science PhDs. Other people were like the true diehard crypto-anarchists. It was like a very odd \ngroup of people. - I first met Brian on the internet, on Reddit. When I saw the \nprototype he had built, ",
        "3": "I assumed it was a \nteam of five people. And then, lo and behold, I\nsit down and meet this guy. and it's just one guy. - You know, Airbnb was doing\nreally well at that time, so it was kind of a \nbig thing to leave. I was kind of like dreading\ncalling my parents, and telling them, \"Yeah, so I quit my job to do a startup,\" and having them, \n\"Oh my gosh, like, what are you going to do about healthcare or whatever.\" - Despite the unknown,\nBrian and Fred partnered up to launch Coinbase \nin June of 2012. It was pretty rough \nin the beginning. - Building a company\nis basically just like moving from one setback to\nthe next, with enthusiasm. Sometimes the website \nwould go offline, and so  I was like on pager duty, \nright? So I'd get woken up like sometimes two or \n three times a night. - We literally worked out\nof a two-story apartment. We had a venture \ncapitalist over for an early \nfundraising meeting. This guy walks out \nof the shower in a towel,  and we sort of went like, \n\"Oh yeah, don't worry about that guy, he's moving \nout next month.\" - It was stressful\nbecause we were starting to store people's money, and\nthis was a very beta product. ",
        "4": "We put a big banner on\nthe app that was like, 'Do not put any money in here\nthat you are unwilling to lose.' I remember calling \nsome of my friends in the cybersecurity world; I was like, \"Okay, how\ncan we build this system? And it needs to have this\nsecurity properties.\" He said, \"I think it will take probably like five to ten people, two years to build it.\" And I was like, \"We have\nmaybe two and a half weeks. And I'm the only one.\" - Between 2014 and 2017, Bitcoin's value was stagnant. But then the price skyrocketed\nnearly 10x in five months. Bringing a flood of users\ninto Coinbase with it, they weren't prepared\nfor, and it didn't stop. Employees worked around the\nclock to meet the demand. By 2020, Coinbase grew\nto 43 million users, and was storing $90 billion\nworth of their assets. - I realized at a certain point\nwe were creating this bridge between two worlds,\nthe crypto economy and there was the \ntraditional economy, which allowed a huge amount\nof fiat money in the world to begin to flow into \nthe crypto economy. - Despite its volatility, \ncrypto's value was growing. ",
        "5": "It was starting to become\nan accepted form of payment. But in 2020, a divide \nwithin Coinbase would test Brian's leadership,\nand present him with one of the hardest \ndecisions of his career. - Before starting \nCoinbase I had never managed \na single person. Now we have\n3,000 employees and we're growing \nvery quickly. There was periods \nwhere I felt like,  \"Wow, I'm in \nway over my head.\" - We were growing \nreally, really fast, and everything \nbroke down. Like it was just\ncommunication, everything. It was just really hard. And you could see, you\ncould see the tension. - In the past, corporations \ntypically stayed quiet on political issues. Today, many argue \nthey shouldn't. That in fact, it's their\nmoral obligation to speak out. In the wake of \nGeorge Floyd protests, a contingent of Coinbase\nemployees argued exactly that, demanding that \nCoinbase make a sustained public \ncommitment on this issue. - And frankly,\nit became a little uncomfortable for me \nas a leader because I was being asked \nabout like these really difficult subjects\nhappening in the world, ",
        "6": "which, you know, I'm\nequally concerned about, but they weren't related to\nwhat we were all here to build. And so the thing that \nculminated was  at a certain point, a large\nnumber of employees got frustrated enough\nwhere they walked out. They were trying to utilize\nthe place that the company had in society to try to tackle\nall these other issues. I realized, you know, I\njust don't agree with that. - The divide \nwithin Coinbase  caused Brian to \nassess his ability  to lead the rapidly \nchanging company. - Either I shouldn't be\nCEO and I should leave, or they probably \nneed to go. - In company building,\nyou have these moments where you can choose\nto kind of hold hack from what you think is the \nright thing for the culture, or you can actually just rip \n the bandaid off and say it. - I finally said, \n\"You know what? I started this company,\nand I think we're on a path to do something really \ngood in the world, and I need to realign the\ncompany and get everybody back rowing in \nthe same direction.\" - 'He made his views pretty\nclear in a blog post this week; Armstrong says \nCoinbase quote,  \"Won't debate causes or political candidates internally,  ",
        "7": "and will not \nengage in things unrelated to their \n core mission.\"' - I was like almost \non the verge of tears giving this presentation\nbecause I knew that it was gonna hurt people\nand all these things. - About 5% of Coinbase's employees left in response,  taking an exit package the company created for them. Brian's decision put him\nand Coinbase at the center of the very \ntype of contentious, unending political debate \nhe was trying to avoid. - You know, I never \nthought that anybody would actually hate \nme for what I'm doing, and like how much people\nare going to have an opinion about everything you do\nand how much it sucks. - Was it scary to wonder like if \nthe solution was you leaving? - Very much so, yeah,\nit was definitely scary. Coinbase went from this \nthing, which people kind of  discounted it, they \nwere like, \"This is a toy, like it doesn't really matter,\" \nto suddenly it's like, now we're sort of \nbuilding an institution. - 'It has just opened \nup for trading, $381 for a 100 billion \ndollar valuation.' ",
        "8": "- Cryptocurrency was created\nto disrupt the formal institutions that \ngovern money, but to reach \nthe mainstream, crypto needs to become \nits own institution. And that has thrust Brian \nand Coinbase into the  unlikely position of advising governments and regulators looking to navigate \nthis new frontier. - What we're really \nseeing with crypto is, it's the birth of \nthis new economy. - Crypto currently accounts for less than 5% of the world's  money, and it's \nnot without its risks. But with widespread adoption, it could increase  access to things like \nventure capital for startups, especially in the developing world, become a hedge against inflation and make \nthe world financial system more efficient \nand equitable. Many think the impact\nof this technology could be as significant as\nthe invention of the internet. - I want to live \nin a world where there's a global\npayment system, where everybody can access\nsomething that's more fair. It's really about \neconomic freedom and just freedom \nin general. What's great about Coinbase\nhaving some success now is that we have more and\nmore resources to allocate ",
        "9": "to help 'Team Human' advance a little bit, and try to do something\nimportant in the world. "
    }
}