{
    "metadata": {
        "video_id": "HQaegigv6jU",
        "title": "The Coinbase Mission, Vision & Strategy",
        "link": "https://www.youtube.com/watch?v=HQaegigv6jU",
        "duration": "17:00",
        "channel_name": "Coinbase"
    },
    "transcript": {
        "0": "(audience clapping) - Good evening, everyone. My name is Brian Armstrong, I'm the Co-Founder and CEO of Coinbase, and I wanna tell you a little bit about what we're all about as a company. Where we're going in the next 10 years and how we're gonna actually get there. So we call that our mission,\nvision and strategy. And I'm gonna start off by\njust telling you a story. So when I was in college, I started a company with my roommate. It was a tutoring company,\nwe got a bank account set up, we started to have some\nmoney flowing through it, and one day I got a call from the bank, and it started asking me\nall these scary questions. Are you an aggregator of funds? Are you a high risk merchant? Do you have business policy\nand procedure in place? And do you have this license? And I was kinda taken aback, I mean I almost felt\nlike I was being treated like a criminal or something. I felt like I was trying to do\nsomething good for the world, and suddenly I was facing\nthis inquisition of questions. Fast forward a few years later, I was a software engineer at Airbnb, we were moving money to 190\ncountries all over the world, and this is a photo of Cuba, of Havana. ",
        "1": "One day somebody came and they\ntapped me on the shoulder, and they said, we need to turn\noff all the listings of Cuba. And I was kind of upset about\nthat because these were people who had opened their homes to strangers from all over the world. And there was this rule, this\nregulation, that US companies, we couldn't do business with them, and we had to turn them all off\nand affect their livelihood. So throughout my life, you know, this was just\ntwo small examples, but there were many\nliteral examples like this. Whether it was something got\nmessed up on my credit score, or I was trying to, you know,\nI had a bank overdraft fee, or I was trying to send money somewhere and my credit card got declined. I always had this visceral sense that there was something really broken and kind of inefficient\nabout the financial system. And it seems just kind of\nlike it wasn't keeping up with the rest of the world\nin terms of improving. It seemed like it was\nholding back innovation and people were trying to\ndo good things in the world. And so in 2010, I was home with\nmy family for Thanksgiving, I was having kind of an introvert moment where I just went off to my room ",
        "2": "to get away from everybody in my family for a little bit of alone time. And I started reading on the internet, I came across this paper, the Bitcoin whitepaper\nby Satoshi Nakamoto. And this spark kind of\nwent off in my head, I was like, wow, this\nseems really important. Like I didn't even really\nfully understand it the first time I read it. But it was talking about how the world could have something kind\nof like the internet, that was decentralized and global, but instead of for moving\ninformation around, it was for moving value\naround and money around. And I got really excited\nbecause I felt like this might be part of the solution to make a financial system that was more fair and more\nefficient and open to everybody. And so I kind of couldn't stop thinking about Bitcoin for about a year and I went to all these\nmeetups in San Francisco, and I finally started coding a prototype on nights and weekends, which eventually ended\nup becoming Coinbase. This was a slide from our seed deck, our seed roundup pitch deck. And tonight, you know, ",
        "3": "this is sort of the\norigin story of Coinbase, I wanna tell you, just give you an update\nabout our thinking, this is actually one of the first time we've shared this with\nan external audience. We're gonna talk about just what we wanna create in the\nworld with this company, how we're actually gonna get there, what are all the steps\nthrough these three sections. Okay, so I wanna\nintroduce you to this term economic freedom. Economic freedom is something that a bunch of organizations out there, they try to measure about all\nthe countries in the world. And they kind of rank\nthem and they score them. And economic freedom measures\na whole bunch of things. One of them is property rights, which is this idea that\nif you own something, can it be taken away from\nyou without your permission? It also looks at how\neasy it is to send money and goods and services internationally. It checks, you know, if\nyou wanna start a business, is there a lot of\nbureaucracy, a paperwork, or do you have to bribe\nsomebody to get a license or something like that or can\nyou just do it in a few days? It also looks at the\ninflation rate in countries. ",
        "4": "Some of you might have seen\ncountries like Venezuela going through hyper inflation\nand people's wealth, especially the poorest people, tends to be eroded by inflation. It checks, if you wanna start a business or work at a business, how\nable to do that are you? And it even looks at\nthings like corruption, you know, are people having to pay bribes to get things done? And so economic freedom\nis this really broad term. People tend to think of it\nas it's sort of a measure of can you make money or what's\nthe growth rate of the economy? And that's part of it\nbut it actually affects all sorts of things in these countries. And it's positively\ncorrelated with some things that you maybe wouldn't think of, like the income of the poorest people, or how well the environment is treated. Even self reported happiness, right? And it's negatively\ncorrelated with these things that we don't want less of\nlike corruption and even war. So you can see economic\nfreedom in these countries. You know, again, here's Cuba. This was 60 years ago, and\nhere it is in modern day. And it looks relatively the same. ",
        "5": "But by contrast, if you look\nat a country like Singapore, one of the highest\neconomic freedom countries, 60 years ago it was this swamp land, and now it's this bustling metropolis. And you can even see economic\nfreedom from out of space. So this is North and South Korea. You know, these two places\nhave roughly the same natural resources and\ngeography and everything, but it's just their difference\nin economic policies have created these dramatically\ndifferent outcomes. And so economic freedom is getting better in the world, very slowly. So over the last 25 years or so, it's gone up about three\npercentage points by this metric. But the vision for Coinbase\nis that we can actually bend this curve and materially\nchange the economic freedom of the entire world by\nwhat we're gonna build. And that's what we're\ngonna talk about next. So that's really the vision for Coinbase, is creating more economic\nfreedom for every person in business in the world\nover the next 10 years. All right, so what are we gonna do to actually make that happen? ",
        "6": "Well what we're gonna do\nis create what we call the open financial system. Which just means that we're\ngonna use cryptocurrency and the smartphone\nrevolution, things like that, to actually inject economic freedom into these countries all over the world. And it might not be\nimmediately obvious to people, I know it wasn't for me. Why does cryptocurrency actually enable more economic freedom in the world? And if you go back to those things I mentioned in the beginning, some of the things that\neconomic freedom measures, you know, if you look at property rights, well cryptocurrency\nactually is a great way to give people wealth that\ncan't be taken away from them. There's user controlled wallets, even these things called brain wallets, and even if you use the\nhosted wallets on Coinbase, oftentimes people still have\nmuch better property rights than they do in their home countries. In terms of free trade, well cryptocurrency is inherently global, it works everywhere in the world. In terms of easier ways\nto start a business, cryptocurrency is democratizing the way that companies raise money and you can accept payments\nglobally from day one. ",
        "7": "Cryptocurrency is now even\nhelping fight inflation. So Stablecoins are being sent\ninto places like Venezuela. And people are able to start the companies that they wanna start and work\nat them with Smart contracts. Even corruption is being\naffected by cryptocurrency because there's also organizations where you wanna have\nthe entire thing be done out in the open, on public ledger. So that anybody can audit it, see where every payment is going. So cryptocurrency is a huge\nenabler of economic freedom and it's also this other\ntrend that's happening, which is the growth of smartphones. So increasingly, even the\npoorest people in the world have access to the\ninternet and smartphones and they can now have\na bank in their pocket. That's really the opportunity. That's the secret that\nCoinbase is founded on, the belief that right now\nat this moment in history, because cryptocurrency got invented and everybody in the world can\nhave access to a smartphone, we can inject economic freedom really into all these countries around the world. ",
        "8": "So that's what we're actually building, to make this vision a reality. We're gonna help create that open financial system for the world. And I just wanna go\nthrough the strategy now. Let's break that down, that's a pretty high level goal. There's really a few ways that\nwe're gonna make that happen. So if you wanna create a new economy, an alternative economy that is more fair, is more free, is more efficient,\nit's open to everybody, the first thing you\nneed to do is just help millions and millions\nof people in the world get access to cryptocurrency\nand just store it securely. And then we need to start to be able to enable people to use it and also to earn it. Because not everybody\nhas disposable income to actually invest in cryptocurrency. They might need to earn it by doing a job or completing a task. And lastly, we need a thousand\ncompanies to get built, that start to accept\ncryptocurrency and use it, for a true economy to be built. Because an economy is made\nup of thousands and millions of participants, not just\none company like Coinbase. ",
        "9": "And so this ties into the\nthree pillars of our strategy, which we call Enable Crypto Investing, Connect to Cryptoeconomy, and\nthen Grow the Cryptoeconomy. So I'm gonna touch on each\nof these just briefly. All right, so Enable Crypto Investing. Still today, the primary way that people get into cryptocurrency, and many of you nodding, this\nis probably true for you, is someone told you about it and you decide to buy a\nlittle bit as an investment. And so most of the money in the world is tied up in fiat currencies and one of our major roles at Coinbase is we're providing this very\nreliable trusted safe bridge between this original financial\nsystem and the cryptoeconomy so that a lot of the wealth\nthat's tied up in the world can move into cryptocurrency. So that means we're a brokerage, we're an exchange, we're a custodian; those are three of the business' products that we've built that\nhave done really well. Those are kind of like the\nfoundation for this economy, ",
        "10": "necessary infrastructure, if you will. And to make those\nsuccessful over the coming three, five and 10 years,\nwe have a lot of work to do. I mean we need to keep\nadding more and more assets to the platforms that our\ncustomers wanna trade, there's gonna be millions\nof these tokens out there, as companies start to issue them to raise money and all kinds of things. We need to keep launching our products in more and more countries. So we're in about 100 countries today but not with full functionality; and every country in the world needs reliable bridge\nbetween fiat and crypto. We also just need to keep making cryptocurrency apps easier to use. It's still way too complicated\nif we're gonna get to be a billion people using cryptocurrency. These little concepts\nlike, you know, private key or you're sending to an address. We need to keep making\nthese easier and easier. So this is the first step,\nenabling crypto investing. You know, investing is\nreally a solo activity. People buy and they come back\nand they check their balance a couple of times a month or they might trade a little bit more. But an economy is not\njust about one person ",
        "11": "or each of these people in a silo. You need to start to\nconnect them together. And that's what we mean\nby this second phase. It's actually taking a variety\nof products and services that Coinbase offers and\nbeginning to connect them into that primary account, where so many people today are\nholding their cryptocurrency. So we call this kind of an economic graph, sort of like a social graph, but instead of there being people, who are sending messages and\nlikes and things like that, there's people in companies\nand the edges between them are you know, things like Send\nand Receive, Buy and Sell. And we're adding new\neconomic actions all the time like Borrow and Lend, or Spend and Pay. So we've launched some products that helped this start to happen. One of them is called Coinbase Earn, it allows people to\nactually earn cryptocurrency by completing small tasks. Maybe in the future, even getting a job that\npays in cryptocurrency. And we also launched\nsomething called Staking which is a way for people to earn more cryptocurrency on their assets. With Coinbase Commerce, we've started to enable\nspending of crypto, ",
        "12": "whether it's at a point of\nsale here or it's online. We even launched a Coinbase\ndebit card in the UK. So we're using that to kind of help people spend the crypto in their primary account. And you know, in Coinbase Pro, we've enabled people to\nstart to borrow and lend, or we will in the near future, which is another important\naction in any economy, you want people to be able to\nborrow and invest that way. So connecting a cryptoeconomy is really about taking\nour suite of products, commerce and earn and things like that, and beginning to connect them\ninto that primary account where 30 million people have signed up to hold their cryptocurrency with us. Okay, so the last pillar in this strategy is about growing the\ncryptoeconomy in total. And this idea is really that\nCoinbase can't do it alone. There needs to be thousands\nof companies out there and it's almost like when the\ninternet first got started, you know, there was some\ntraditional companies that tried to make their\nway into the internet, with varying degrees of success. But there was also this\nwhole new crop of companies ",
        "13": "that were internet\nnative, like the dot coms, or is what they used to be called. Now it's almost every\ncompany in Silicon Valley is built on the internet. And the same thing is already\nhappening with cryptocurrency. We're seeing a whole new wave of startups that are built that are crypto-native. You know, they raised money with crypto, they're accepting crypto as maybe even the only form of payment that they accept. And so part of growing a cryptoeconomy is investing, like I said. With Coinbase Ventures, we've now invested in about\n50 or 60 of these companies. But we actually are gonna enable an entirely new ways of fundraising. There's things like security\ntokens are being created, and initial exchange offerings, which is a way for new companies to raise money in cryptocurrency. We're also surfacing these\n3rd party apps and companies. We're beginning to surface\nthem into our products. So here's a screenshot of Coinbase Wallet, and you can browse to the DApp screen. A DApp is a decentralized app. And one of the most popular apps that is ",
        "14": "this app called Compound. So we're beginning to\ngive people the ability to access any sort of application or company out there in the cryptoeconomy. Especially ones that we didn't create. And lastly, we're gonna\nbuild this infrastructure, decentralized infrastructure,\nin a few ways. One is, this is a screenshot here, sort of a mockup of what decentralized identity might look like. Which is a really interesting topic. It's a way for people to\ncontrol their own data, an identity in the cryptoeconomy. And we may even start to make available some of our internal APIs. Almost like AWS for crypto,\nto the external world, to help those companies, those startups, build on the infrastructure that we use to build our own products internally. So these are the three\npillars in our strategy. You can see that each of our products actually fits into one\nof these pillars today. We're doing a lot of things. And even there in the bottom\nright, GiveCrypto.org, is a nonprofit that we created which is helping grow the cryptoeconomy. ",
        "15": "You know there's going\nto be a lot of companies in the cryptoeconomy and\nI just wanna touch on what I think we can do different and really contribute to this. So the first thing is that Coinbase has built a brand around trust. We've had 30 million people signed up that trust us to store\ntheir cryptocurrency. We're the largest custodian out there. And by really focusing on\ncompliance from an early day, that enabled us to get\nthese bank partnerships and the bridge into the\ntraditional financial system. And we focused a lot on cybersecurity too. You've probably heard about\nall the challenges out there with crypto companies facing\ncybersecurity incidence. I think we've become the\nbest in the world at that, and so people really trust us. The second one is about a real focus on usability and quality. And so as I mentioned earlier, cryptocurrency can be pretty intimidating and pretty difficult to use. And our goal is to get, you know, the next 100 million or more people to start to use cryptocurrency, it's gotta be way simpler. And so I think we could go\neven much further than that, but we've probably built the\nbest brand for that today. ",
        "16": "And lastly, people come to Coinbase because there's a whole bunch of products that they might wanna use and they actually all\nwork together pretty well. And so we start to\nleverage our distribution between our products in a way that I think is really powerful. So this is our vision,\nour mission, our strategy, it's what we're all about as a company, what we're trying to create in a world, and how we're gonna get there. And I guess I just wanna\nwrap up by saying that we are just at the very\nbeginning of this journey. So yes, we've got 30\nmillion people who signed up and have gotten a little bit\nof cryptocurrency with us, that's amazing. But our vision is to have a billion people in say five to 10 years accessing\nan open financial system through our products every day. And when we've done that, we will have materially changed the economic freedom of the world and we'll have bent the\nshape of that curve. So that's the vision that\nwe're trying to create and hopefully you all found it helpful. Thank you. (audience clapping) "
    }
}