{
    "metadata": {
        "video_id": "52DlSLx0_lY",
        "title": "Vitalik Buterin, Co-Creator of Ethereum, and Zooko Wilcox, Founder and CEO, Electric Coin Co.",
        "link": "https://www.youtube.com/watch?v=52DlSLx0_lY",
        "duration": "1:22:06",
        "channel_name": "PGP* (Pretty Good Policy) for Crypto Podcast"
    },
    "transcript": {
        "0": "Welcome to the PGP for Crypto podcast,\nwhere we have in-depth discussions on cryptocurrency policy and regulation. I'm Paul Brigner, head of US\nPolicy and Strategic Advocacy at the Electric Coin Co. As always, this podcast is for\neducational purposes only and is not legal or financial advice. However, we are here to deepen our\nunderstanding of complex policy and regulatory issues, and work towards\nthe development of pretty good policy for the cryptocurrency world. I would first like to introduce\nmy co-host, Josh Swihart. Up until quite recently, Josh\nwas Senior Vice President at Electric Coin Co., overseeing a\nvariety of functions, including ECC's policy and regulatory work. Josh spent five and a half years\nat ECC after a distinguished career as a tech founder and executive. I'm thrilled to have Josh participate\nin this extremely special episode of the PGP podcast, because we\nare privileged to have two special ",
        "1": "guests that need no introduction. Vitalik Buterin, co-creator\nof Ethereum, and Zooko Wilcox, founder of Electric Coin Co. and one of the creators of\nthe Zcash cryptocurrency. Vitalik and Zooko, as we commence\nthis discussion, I would like to extend my heartfelt appreciation\nfor your substantial contributions to the cryptocurrency industry. Your pioneering spirits and\nforward-thinking approaches have not only shaped our industry, but are also\naltering the global financial landscape. You stand as genuine heroes in my\nperspective, and I believe heroes like you deserve to always be\nhonored and respected for your work. Thank you both for joining us today. Our discussion is going to be about a very\nrecent development that has garnered quite a bit of attention in the cryptocurrency\nindustry, especially among those who care about privacy and preventing\nthe illicit use of cryptocurrencies. I am referring to the very recent\nannouncement of Privacy Pools, as ",
        "2": "well as the associated academic\npaper that was co-authored by Vitalik, Ameen Soleimani, and others. I would like to pass the mic to Josh to\nhelp tee up the discussion, but I want to note that for this discussion, we\nare assuming that all of our listeners are generally aware of industry and\ngovernment concerns about illicit use of cryptocurrency and specifically\nthe US Treasury office of foreign asset control, Tornado Cash sanctions,\nthe arrests and charges against the developers of Tornado Cash and the\nCoinCenter litigation against OFAC. Josh, let me pass to you to help\nkick off this fascinating discussion. Thanks, paul. It's an honor to be on the podcast and\nthank you for inviting me to participate. and it's an honor to be as well\nwith, you, Zooko and Vitalik. I've learned so much from both of you over\nthe years, I remember the first time I ",
        "3": "met Vitalik who was actually at Zcon Zero. And, I asked Vitalik to do\nan interview and to give his thoughts on privacy at that time. That was about five and a half,\nsix years ago, something like that. and when I asked him about privacy,\nand why it was important, I'm gonna read what he quoted, what he said,\nbecause I think it's beautiful. He said, it gives people the freedom\nto optimize for their own happiness instead of having to care about how\nthey're, how they look to everyone else. And I remember something, Zooko, my\nlike first experience with you, you were interviewing me in Boulder,\nColorado to come work at ECC. And you asked me about like what\nkinds of things were most important to me, and what I cared most about. And I said something about consent,\nor choice or something like that. And you smiled. and I knew that it deeply\nresonated with you, that response. ",
        "4": "I didn't say privacy and I\nthink that was part of it. And I've always known you to be\nthe champion of human freedom. And that, and with an understanding\nof privacy is really just kind of a means to an end. And so when we jump into this topic\nof Privacy Pools, I think the, kind of the default nature of our thoughts\ngo to privacy in particular, and that's a really important topic. But I think the broader, maybe\nmore consequential topic related to that is related to, human freedom. and I really think that's what\nthe intent was and is with Privacy Pools and it is with, Zcash. And so we want to explore that theme. And the technology we want to explore\nhow we're how the design decisions and the technology we build, how that\nempowers us to, maximize human, freedom, ",
        "5": "within a well-functioning society. So with that, let's jump\nin the conversation. As Paul mentioned on, September 6th,\nyou, Vitalik,  Ameen Soleimani, Jacob Illum of Chainalysis and some other\nacademics released a paper, and the paper was called \"Blockchain Privacy\nand Regulatory Compliance Towards a Practical Equilibrium,\" and it jumps\nin and it talks about how that might be achieved through a technical solution. So maybe, can you begin by\ntaking us through a summary of what the paper is about? and what prompted you to write it? Sure. so the basic idea in the Privacy Pools\npaper is that it is a way that allows, users when, they send a, privacy\npreserving transaction, and I'm being deliberately generic about whether we're\ntalking about a mixer that exists in ",
        "6": "an otherwise transparent system or in\na, system where that's the only kind of transaction that you can do, to specify\nin a set of possible inputs that their transaction could have come from without\nrevealing any more information, So, the natural motivating use case here is if,\nlet's say, for example, there is a big DeFi, hack, and, there's someone hacked,\n50 million dollars out of a DeFi project, and, in the old days before Tornado Cash\ngot sanctioned, these, the proceeds from these hacks would frequently basically\ngo straight into tornado cash and, they'd end up being a pretty large share\nof all of the users of the protocol. But, with Privacy Pools, all of the users\nof the protocol who are not hackers could basically say, well, I'm actually from\none of the subset of, depositors that is ",
        "7": "not one of the publicly known hackers. And, they could just make that as an extra\nzero-knowledge proof, so, they would, Well, probably not them personally, but\nsome other, actor, could be a community, list, could be, a company, could be\nsomething else, would, generate a list of, basically, the transactions that are\nnot connected to DeFi hackers, the users would zero knowledge prove that they're\none of those, and so their anonymity set would, still be pretty massive, because,\nit might be, instead of a hundred billion dollars of activity, fifty billion dollars\nof activity, but for most people that's still basically, practically as good. But, hackers would not be\nable to do this, right? And so, the, basically it would separate\nout the two types of users you would have legitimate users that would be able to\nmake one of these proofs, and hackers that would effectively be able to mix\namong each other, and so users that are ",
        "8": "not hackers, when they go, Deposit to\nexchanges, for example, or potentially, yeah like, use their funds and other\nkinds of large value transactions or do whatever else, they would not\nbe treated transition- suspiciously, because there would be this pretty\nunambiguous evidence that wherever the hackers are going with this, money that\nthey're dumping into, Tornado Cash, that particular user is not one of them. So., that's, a- based on what\nPrivacy Pools does, and it's also deliberately vague about how these\nsubsets get constructed, right? So one of the possible examples\nis you're proving that you are like, anyone who is not one of\nthe publicly known DeFi hackers. You could have a much more restrictive\nversion that basically says, well, to join the set you have to\nzero-knowledge prove that you are... A unique human that passes an anti-civil\ntest and you're putting up to, let's ",
        "9": "say, $10,000 a month into one of these\nsystems, right, and then that would satisfy the goal of having privacy for\nlower value amounts, but, something else for higher value amounts. It could be a group of high trust people\nthat's, making a pool for themselves. Like, the technical design it kind of\nleaves open the the ideology of how you're actually constructing these sets. but... The goal is to basically open up this,\ndesign space that's less than, sort of maximum privacy of, putting everyone into,\nliterally, the same pool and revealing absolutely nothing about the providence\nof, funds, but still, providing meaningful privacy, not having centralized backdoors,\nright this isn't one of those things where there's an FBI that can see your\ntransactions, or even, some a backdoor chip on your phone that does AI analysis\nand reports if it thinks you're being ",
        "10": "evil or any of that, right, this is no\nbackdoors, no, secret, decryption keys, this is basically just you proving some,\nbut still very far from total information about where your funds came from. And the motivating use case, as I think I\nmentioned, is basically to create privacy systems that still, at the same time,\nto create privacy systems where assets coming out of these systems, still Get\naccepted by the, wider economy because, the people receiving them can have at\nleast some degree of confidence about what kinds of sources the money is coming from. effectively boycotting assets that come\nout of specific transactions is something that continues to become possible. ",
        "11": "But, at the same time, privacy becomes\nreal, and we really don't surrender on, this, very important, red line for\nall of us, that privacy needs to be something that continues to be normal\nfor all of us as we, rapidly digitize our way into, the cashless society and,\nall of this stuff in the 21st century. That's a great summary and so, and\nit's like a noble cause, right? To your point, in terms of what we're\ntrying to accomplish, and, you go like you kind of sparking a little bit of some\nof this conversation back and forth with the two of you, you had, you had put out\na thread, I think initially posted, I've got a, really hot, some expletive take\non on this, but you wanted to cool down and take some time and, did a couple\ndays later and laid out a tweet thread with a few criticisms of, the paper. ",
        "12": "And I think in response to that, Ameen\nresponded as well and saying it's basically and some of whether to you\nor to others said, if you don't, if you don't like it, then they don't use it.,\nso maybe take us through as a freedom maximalist take us through your thoughts\non you know, maybe the challenges of  and why you came out so strongly Okay. Vitalik just said. It was to open up the design space,\nsomething worse to the effect to explore the design space of what is possible\nnow that we have zero-knowledge proofs and shielded pools put together. And that part I like, what I really\ndon't like about the paper and the, way it has been presented on the internet\nand used by others on the internet is, ",
        "13": "as a contribution to the conversation\nabout policy and cryptocurrencies, it was a big conversation that Paul\nBrigner here, I guess, is close to the center of in Washington, D.C., and as\na contribution to that conversation, I really don't like it because it\nassumes without evidence that the U.S. government has the right and the\nauthority to compel guilty until proven innocent behavior, like\nto compel proofs of innocence. And that's scary to me because I don't\nthink that's true of the America that I live in, and I don't want it to be true\nof the America that I live in, but I think there are some people, notably a\nfew factions within the US government, who either think that's true or wish\npaper gives them ammunition because ",
        "14": "from their perspective, technology is,\nI think, a bit of an arcane mystery and Vitalik is the highest wizard in\nthe land and so, I'm really concerned about just the implication that we\ncryptocurrency people are okay with the principle of guilty until proven innocent. that's why I was angry. That was the object. That was why it was a fiery, Exploitive\ntake, also as like a product. I don't know if it's a product, but. I'll use the word product to\nmean a thing that people could use, could adopt and rely on. I don't think it's, I,\nthink it's premature. I really don't think it can deliver those\nthings that it promises in the abstract. at least not without a lot of, a lot more\nexperimentation, iteration and learning. But as a technology idea, I really do like\nit for the reason you gave, that it shows ",
        "15": "how it's become possible to do different\nand much more nuanced things with regard to privacy versus disclosure than before. Does that answer your question, Josh? Yeah, it answers the question. Like, Vitalik, curious what you think. Yeah, I mean, I think, it's the guilty\nuntil proven innocent thing I think is a fair criticism, and I think, Part of,\none of the things that I might be willing to admit is like proof of innocence\nthe term, which is a term that was not used in that paper, but definitely\nwas used by its, various advocates in other contexts is probably a bad meme. And it definitely makes sense to not\nuse that meme, but even  stepping aside from that I think, like to me the other\nbig thing to keep in mind here is that there are multiple kinds of actors\nthat privacy systems are trying to get ",
        "16": "accepted by in different ways, right? And I think it is a bit of a misconception\nthat either a privacy system works or it gets OFAC'd, And, those are\nbasically the two, outcomes, right? And, because there are a lot\nof intermediate outcomes. Wait it works and, or it gets\nOFAC'd, what do you mean? Right, so the misconception is that\nthere's basically two possible states. A privacy system works or a\nprivacy system gets OFAC'd. What does it mean, works? Works in the sense that it's just\npractically usable by people. So, I don't understand the or in the meme. Sorry. Right, So, okay, so sorry. So what I'm saying is that like I\nsometimes get the feeling, right, that there is this misconception that you-\nthe goal is, like the two goals are maximizing privacy and at the same time,\nspecifically minimizing the probability ",
        "17": "that your entire system gets banned by\nOFAC and possibly, the developers get legally attacked and things like this. OK. I think there's also intermediate\nfates that are valuable to avoid. And the biggest intermediate fate\nthat's valuable to avoid is basically people getting annoyed at exchanges. Like, this has happened to\npeople I know, for example, that they sent ETH to exchanges. That ETH came from Tornado Cash. These were non-US people. And so, it was completely\nlegal what they did. And, there's no... This is not a, criminal law or a civil law\nsituation from their perspective at all. But at the same time, the exchange\ntreats them suspiciously, right? The exchange, Basically, freezes\nthe funds until they provide extra source of funds documentation. The exchange might put up other kinds\nof lags if they, it Hasn't happened yet, but if they, do it too much,\nit might even close their account. ",
        "18": "And the exchange itself is, also doing\nits own, really complicated balancing of, on the one hand, their values,\nwhich a lot of the time are, some, at least somewhat aligned with the crypto\nethos, on the other hand, wanting to keep people as customers, and then on\nthe third hand, obviously not wanting to get shut down or themselves, like,\nmassively annoyed by governments, right? And so, it's not the words guilt and\ninnocence, to me, refer like, are in this, kind of criminal law, or possibly\nyou could extend it to kind of like, civil law, or otherwise this kind of\nbinary frame of like, basically, yeah like, either you get whacked really\nhard or you're, fine, which is how criminal law works, and, I mean, it's\nalso even, I think, a fair approximation of how things like being cancelled on\nsocial media even work, right, and, ",
        "19": "like we do use words like guilt and\ninnocence to talk about those, but if we start talking about these like, more\nmedium-level fates, then it's, a... like, I don't think we've ever had a\npresumption of being treated with zero suspicion, unless there's ironclad\nevidence, and that seems that doesn't really seem like a, principle that\nthese kinds of things work at, right? It's, uh... I don't follow this part either. Okay. Yeah, Right. We're not used to being\ntreated with zero suspicion? Right, I mean I am. People get treated with various,\nlevels of suspicion, depending on, different, aspects of themselves. Really you've never been asked extra\nquestions at the border by a TSA person? I mean. Ummmm, probably, yeah. ",
        "20": "Right, right. So I'm, I'm white. This is true, but like, I'm, I mean,\nI'm, I know what you mean, right. And like, I'm white too, and I, but\nyou know, sometimes, I get annoyed by, for like 20 minutes by the US Customs,\nand like 80 minutes in Israel, and I know people who get worse fates, right? But like these things I mean,\nthere's different stories that you can kind of tell about this, right? Like, one story that you can\ntell is basically this is maximum unfair, and, people should be\ntreated, Completely, yet equally, unless there's very hard evidence. And then, another story that you\ncan tell is that, well, actually, you can increase how fairly\npeople are treated, by decreasing people's motivation to treat people\ndifferently based on bad information, by providing good information. Right? And, I think, in some ways this is... ",
        "21": "The promise of, the internet\nin a lot of ways, right? Like you don't really see\nyour, Uber driver's race before you get matched with them. But, the system does rely on ratings\nand to me, this is a gain for fairness. It's a, gain for people's freedom\nand a gain for economic efficiency. but, and so I think- Uber driver ratings. Exactly I agree. I think those are good for those reasons, But they're not mandated by government. Indeed. they're not mandated by government. Right. And once, I think the challenging\nthing about this, crypto like policy space is that the line between what\nis government and the line between what is private actors is like\nbasically completely blurred, right? Because the way that all of these\nregulatory trends are going is that like the government is wants to ban things, but\non the other hand, the government is lazy. And the problem is that the government\nhas figured out this, amazing trick for ",
        "22": "being lazy and banning things at the same\ntime, which is spending five hours writing a law that says private actors are forced\nto, I mean, I could be the ones that satisfy some threshold of responsibility,\nbut at the same -and then if they don't do that, they get whacked, right? And so the, responsibility\nbasically gets externalized on them. So, it's... so within a philosophically, you can\nalways try to disentangle, but within a live system, obviously like, even, for\nexample when Twitter kicked off like, Donald Trump, back in the those old\ndays what percent of that was Twitter people's opinions on what is morally\nright, and what percent of that was Twitter people's opinions on minimizing\ntheir risk of being somehow whacked by the Democratic Party once they could get\ninto office 11 days later, and that's not really possible to disentangle, right? So, I ",
        "23": "well,I don't know. I mean,that's... Well, so I wonder with that, point,\ndoes this have the potential to make that problem worse or to bring that? Because then you're associated,\nyou're choosing who to associate with, but there's an arbiter. There's somebody that makes the\ndecision that these are the good people and these are the bad people. If you associate with these people,\nthen your coins are tainted. Right. But But if you associate this with is... these others and there's different,\nso who gets to decide in this model? What's good and what's bad and\nwho we should associate with and who we should associate with. Right, I think this is fair, and I think\nthe key thing with privacy, right, is that like, the most important thing is\nnot having an anonymity set of like, 10,000 versus 5,000, the important\nthing is having an anonymity set of like, X, thousand versus one, right? And one of the advantages of Privacy\nPools Especially as compared to other ",
        "24": "alternatives for example, just like\nsystem-wide white listing, right, is that it does have this level of robustness\nto disagreement in, who should be associated with and who shouldn't, right? if there is something that is just\ncontroversial to associate with, then, People from, one of the American colored\ntribes might, decide to totally boycott it, but people from the other American\ncolored tribe would, decide that it's, totally cool, and, even if they have some\nproblems, they might associate it with it just as an act of civil disobedience,\nSo, it's if two thirds of, the ecosystem does not like you, you still have an\nanonymity set of size one third, Whereas, in a yes system where you kind of do\nmore of a yes or no thing at the gate, then, there is a yes or no function,\nand there's some people that get in to get the full treatment, but then there's\nother people that get in and, basically ",
        "25": "just, I'm gonna like, end up having no\nan anemone and no privacy whatsoever. So, i, Yeah, I guess I don't\nsee a nirvana here, right? Like, I, yeah, I don't\nthink that, some kind of... completely perfect outcome is\nachievable, but I think this kind of more flexible design is like, it's,\ncool it does a better job of helping more people avoid outcomes that are bad. How did you guys think about,\nkind of the downstream effects? Because I'm sure you kind of gamed\nthat out in terms of, let's say you're participating in a pool\npeople that you're comfortable with, you're in that, third or two thirds. and you go to Zooko and, you don't\nreally care in that transaction, what Zooko's affiliation is, but you\nwant to buy a bike from Zooko, and ",
        "26": "so you give them some cryptocurrency\nexchange for a bike and suddenly Zooko has an association with those... where the funds originated. Is there concern about, or how\ndo you think about that risk? So one important thing,\nright, is that I think it's... important to think about this\nassociation is not a user level, it's coin level, right? So, if, let's say, Zooko gets coins from\nme, and the US government, decides that I'm Persona non grata, and let's say I\nget his bike, he gets 70 of my coins. I mean, first of all Zooko always has the\nfreedom to do anything that he wants with, kind of N minus 70 of his coins, all of\nthe coins that he would get otherwise. And those coins would still have\nno, connection in the graph to anything that I gave him, right? I mean this is, that It's kind of\nstandard philosophy of, I'm you know ",
        "27": "like, a UTXO model, which, I think,\nironically it's despite a theory. I'm kind of rebellious against UTXO is at\nthe beginning, I think, I'm in like, once privacy enters the picture, you do sort\nof go somewhat back in that direction. Was replacing UTXOs\nwith balances your idea? It was, and I mean, there were definitely\nspecific bad outcomes of you of UTXOs that really, motivated that choice. Like, I wrote this, Bitcoin wallet, and\nI remember having to write this, pretty crazy code to deal with the case where you\nset the transaction, you need to pay fees, but then in order to pay the fees, you\nadd one more UTXO, but then that increases the size of the transaction, and then you\nhave to pay more fees and add more UTXOs. And like, in the worst\ncase, it's a while loop. And like, I kind of got traumatized\nby some of those experiences, that I'm like, screw it transactions are like... That's the kind of thing we're\nworking on nowadays at ECC. We're making UTXO-based\nZcash wallets, and so... ",
        "28": "I know exactly where you're\ncoming  from on that. Anyway, I distracted you. I was just curious about\nthis history question. Was it Vitalik's idea to\nreplace UTXOs with balances? One of those big, impactful changes. It's fun to see all the downstream... Influences on all the other\npeople that came after. But anyway, you were saying, in the\nprivacy context, UTXOs have some advantages, and you're giving the\nexample of some of your money being tainted, but it doesn't rub off\non the other bills in your wallet. Right. I'm confused about something about\nPrivacy Pools, It's related to Josh's question and your answer. Like, the way I saw it presented, so first\nof all, it was presented as a solution to OFAC and that's what pisses me off. Are we allowed to say piss on this show? Paul? You can say anything  you want, yes. And so that's, why I'm upset about it\nis because of the policy discussion context and the developers being\nunder criminal charges and all that. ",
        "29": "But the other thing was it was presented,\nunless I misunderstood, which is possible. it was presented in the context of a\nmixer, which lives in a transparent world. And then a bunch of money comes in\nfrom transparent world, and goes into the mixer and then goes back\nout to transparent world again. And, but when you introduced it, when at\nthe beginning of this discussion, you said you're deliberately being general as to\nwhat sort of privacy world it lives in. So one thing I don't understand\nis if I can give you a proof. In general, not just in the mixer\nworld, because mixers are passe. like even Tornado Cash had already\nreplaced mixers with a Zcash style shielded pool, in alpha stage, as your\npaper mentions, before it got shut down, effectively, whatever, before its users\nall fled in all directions, to be more precise, anyway, so mixers are really\nlike, probably not relevant going forward, ",
        "30": "so in the, more of the like Zcash style\nshielded pool world, you might say, okay, I want to, enter into this contract. We're going to be part of a DAO or\na club or something with this guy. but I want to proof that his contribution\nto our DAO doesn't come from a hack. And I have a list of the addresses\nof all the biggest known hackers. So I want to prove that the source\nof this transaction is not, from any of the addresses on this list. So then I say to you, okay, well,\nsend me this proof before you can donate and join our doubt. So, by the way, this is, a context\nwhich doesn't make me angry. I'm totally in favor of consensual. Like Josh said at the beginning,\nI'm a lot more about consent than about privacy per se. So this, is a scenario that you\nbrought up in your examples that I am okay with, philosophically. ",
        "31": "But then you can imagine you say that\nto that guy, you gotta prove that you're not donating to our club from\nany of these known hacker addresses. And he says, Oh, okay, just a minute. And then he comes back and he\nsays, okay, here's a proof that I'm donating from a different address. It's not any of those known addresses. And then you say, wait a minute,\nare you actually a hacker? And did you just make a new address\nand then move the donation over? And now you're donating\nfrom the new address. And now I want to prove that you're not\ntwo hops away from any hacker addresses. And he says, oh, okay, Just a minute. Then he comes back again. So that's the first\nthing I'm confused about. And I have some vague intuitions. This is where I said Privacy Pools\nis sort of advertised as I see it. I think it is likely to be\nreally appealing to OFAC. I don't actually know because it actually,\nTornado Cash had a disclosure tool that was a lot more disclosure than Privacy\nPools offers, you could reveal your entire, your entire life history, or\nyour entire financial history if you ",
        "32": "wanted to, OFAC if they asked, and they\nconsidered that totally inadequate and included the inadequacy of that in their\ncriminal indictment against the author. so I don't think Privacy Pools\nis likely to appeal to them, but I don't know, but my point... I'm sorry.I'm tangenting. What were you gonna say? No, No, it's okay. I think the tangents are,\nI think all valuable. So, I think I did address, both\nof those in, different, sections of the privacy rules paper. So maybe to address them\na bit in reverse order. Right. So the point of, total disclosure\nbeing inadequate, I think the problem there is that approach gets\npresented as oh you can give people disclosure in order to give OFAC more\ninformation about yourself, right? But the goal was to decrease\nthe anonymity sets of criminals. And criminals are not going\nto use the tool themselves. And the fact that the tool is so\npunitive in terms of your priv- like, ",
        "33": "the, Tornado cash, disclosure tool is\nso punitive in terms of your privacy, it self-limits how many people are ever\ngoing to, voluntarily use it, right? And so criminals are still going to get\nanonymity sets that are like, 90 percent as large as they otherwise would be. Now, the point of do you remember in\nmy, in the Privacy Pools I can try to even, go to the specific section, it is\nI think it's like five points something, but, let me, Get to this right now. I was too angry when I read\nthat section, to pay attention. So I'm glad you're teaching me. No problem. It is, okay, it is section 3B. There is this nice little square. You have Alice, Bob, Carl, David,\nand Eve, and their five deposits. And the point is that it isolates\nEve, despite Eve providing zero information, right? Because Alice, Bob, Carl, and David all\nmanaged to dissociate themselves, right? So, basically, if you want to reduce\nthe anonymity sets of criminals, ",
        "34": "you're not going to do that by\nhaving the criminals themselves provide things, because they're not. You're going to do that\nby creating a tool. Which is much milder on the costs\nthat it imposes on legitimate users and arguably even reduces those costs\nto below zero in order to maximize the number of people who are actually\nwilling to publish information that dissociating from Eve, right? So, I think that's the difference, right? The Tornado Cache\nanonymity tool did not do. A good job of, encouraging a substantial\nnumber of people to use it, and so if you look at on that chart, even\nthough it might have made a couple of people's rows, kind of isolate them to\none person, it would probably not have, made any column isolate any people,\nso that's the, I think, the difference between those two, and then in terms\nof this question of, well, what if the hacker sends to one and then sends\nto another, there's two responses. ",
        "35": "There is a, a lazy but limiting\nresponse, and there is a, kind of better and closer to, theoretically\noptimal but more complicated response. And I think I had both\nof them in there, right? So the lazy response basically is... If you want your transactions to be\nprivate, then the money needs to have not been spent for two weeks, right? And so if there is like, some kind\nof event that the system wants to claim, or some, I mean association set\nprovider wants to claim is a hack, they basically have two weeks to do it, right? And the idea would be that as a user\nlike, if you get 70 from, me for a bike, then the dollars you would spend first\nare not those 70, you would spend all of your other dollars first, right? And that's like, it kind\nof, solves that problem. But what it, basically, because what\nwould happen is, I mean, look, the ",
        "36": "original hacker, they would get flagged\nwithin two weeks, and then if they try to do a two-hop thing, then whatever\nthe intermediate hop, kind of object is, it would not be able to exclude\nthe hacker from its association set, and so that object would also not\nget added to association sets, right? And so, it would kind Sorry, I missed... I'm confused. Right, okay, so the threat\nmodel basically is... right, so have a hacker. And so let's say... Sorry. Okay, So we have a hacker, right? and let's call the UTXO object, whatever\nwe call it, of the hack X, right? And let's say X is publicly known, right? Then the hacker does a two-hop, right? So they send to Y, then they send to Z. Y is also controlled by the\nhacker z is controlled by the DAO. So the goal, of the hacker is to basically\nuse Y as a way to kind of like wash off the X and create something that looks\nlike it's not connected to X, right? So Right. ",
        "37": "The easy solution, as I said, is to\nbasically require a two-week delay, before anything gets added to an association set. Hold on, so, if I'm considering letting\nyou join my DAO, ,and it's been more than two weeks since the last major hack. Then... Okay, but then, if it's been more\nthan two weeks since the last major hack, then X would be part of an... Okay, so there's two scenarios, right? Scenario one is the attacker\nwaited more than two weeks before moving the coins from X to Y. Okay. If that's true, then X would have\nbeen not added to association sets, and therefore Y would not\nbe able to prove that Y is not X. And so you would not be able to... even Y would not be able\nto prove a good history. The second possibility is if the attacker\nmoved the funds from X to Y waiting less than two weeks, and maybe the\nattacker just does it instantly, right. Let's say the attacker you know steals\nthe money and then the stolen funds are X, ",
        "38": "and then the attacker does like one hop,\nor possibly just like 50 hops, instantly. if they do that, then X would\nnot be addable to association sets, and then neither would Y\nor Y-prime or Y-prime-prime or any of the children from there. Right? Okay. Can you. Explain to me what are association sets? Okay. Association sets just are the, term\nfor like the set that you use to, that you are proving that you're a part of. So, you're... So, there's two modes. Prove you're not on a blacklist, and\nprove you're part of a association set. Right. But we know that, like\nproving that like... every stat has a complement, right? And like, every blacklist has a\ncomplement which has a white list. And so, they're really,\nmathematically, they're both the same. So... So you're proposing... I want to join your DAO and now you\nasked me to prove that my donation ",
        "39": "to your DAO is coming from a set of\nknown not to be bad addresses that existed more than two weeks ago. Right, that formed from a set that\nis constructed by basically, yes. Right in order to be part of the\nset, yeah, you have to you could, what, you have to be known not to\nbe bad, and that UTXO needs to have existed for more than two weeks. But we don't have a list of all extant\naddresses that existed two weeks ago. We only have a list of\nknown bad addresses. So how do we... Right. Well, ah, but so what we do is right. So in the, I guess like\nfull privacy model, right? Like every coin has what I call\na coin ID and a nullifier, right? And, the coin IDs are public and\nthe nullifiers get published when ",
        "40": "the, coin is spent and the two have\nlike a secret link to each other. And so, we do have coin IDs, right? And the coin ID of a thing is\nknown when it gets created. Oh, I was thinking about addresses. You invented addresses instead\nof, or accounts instead of UTXOs. I invented the word nullifier\ninstead of the word that used to be used for that before. So if we're talking about coin IDs, then\nyou have a set of all possible things that Right. are not included in the blacklist. Exactly like the set of all coin\nideas is basically the set of all coins that have ever been like of\nall transaction receiving event... like coin receiving events\nthat have ever happens, right? So that's the universal\nset you can start with. Okay. So I can say you can only join,\nmy DAO if you can prove that the coins you use to donate to our club. ",
        "41": "Right. Existed more than two weeks ago and\nweren't part of the bad set at that time. Right. That's the, so that's what I call the\nkind of easier, but kind of more, but more limiting solution because obviously\nit creates capital inefficiency. right? The, kind of closer to theoretical\noptimal, optimal solution is basically that like, If I like, give, you 70\ncoins for a bike, then, and I want to give those coins immediately after\nreceiving them, then, I would just give you the proof of, which specific\nobject that transfer comes from. And that gives you enough information\nto be able to actually either make the proof yourself, once two weeks\npass, or pass that information ",
        "42": "forward to someone else if you\npersonally also want to, immediately use those coins to go buy a coffee. Okay, thanks for explaining to me. How do we get onto that topic? Josh asked you a question about something? Yeah, well, by the way, not to totally\nderail, but you leaned back so I couldn't help notice your t-shirt. Yeah. let's see it. No, no, this is I mean, I think it's\na, it's a lovely debate and I think it's nice to just remember that we all\nlove each other, ultimately love each other and love the same cause, so... Yeah, I really agree with the, even though\nI have a very strong negative reaction because I perceive It as potentially\nmisleading policy and government and regulatory and law enforcement people\ninto thinking that technology can give them everything they want and nothing\nthat they don't want, which I don't ",
        "43": "think is actually true, even though,\nlike I said, I like the pushing forward the boundaries of possibility here\nby combining zero knowledge proofs with, shielded pools, especially UTXO\nstyle shielded pools are my favorite. Right, right. But so I'm afraid it may mislead\nthem, but I'm no policy expert. I just have a very strong, emotional\nreaction to, the threat to my beloved America turning into a\nguilty until proven innocent society. Of course. But I really agree with it. the desire that, like of\nfreedom of association. Like I pretty assiduously practice\ndissociating with anybody who's shady or who's credibly done bad things. I pretty much lock them out\nof my perception and they never exist to me after that. Yeah. So I like that part. I'm interested in finding out what happens\nwith the application of the idea of ",
        "44": "zero-knowledge proofs in a private world. I really, I totally hate the\npitch that it's a solution to. your technology getting OFAC'd. It's not a solution in my view and it's\nunnecessary because good, technologies without such compromises don't get\nOFAC'd and because OFAC doesn't have the authority in the United States to ban\nUnited States people from using protocols based on whether foreign enemies also\nuse those protocols, so I think it's A wrong response to that issue in my view\nBut that's back to the policy side. I find your ideas about the technology\nside very interesting actually. Zooko, I want to... actually just staying on the\npolicy side, I had an interesting question I wanted to ask you. Right, so, there were some Twitter threads\ninvolving yourself and Ameen where kind ",
        "45": "of got into some of these arguments. And, I think, one of the arguments\nthat gets raised is basically that what's going on here is basically that\nregulators are increasingly, kind of, What they're doing is they're basically\njudging systems as a whole, right? If they can't poke into a system, they\njudge they judge the system as a whole, and if the system as a whole does enough\nthings that they don't like or cause it, cause people to complain, then they go\nand put the hammer on the system, right? And that obviously happened to, Tornado\nCash itself, and the question is why hasn't that happened to Zcash yet, right? Because, from a, technological\nperspective, it feels like these are just both, systems that give people privacy. And, realistically, Zcash is even\nbetter at avoiding leaking information than Tornado Cash ever was, right? And Yeah. there's this, question of well, I mean,\nobviously Zcash, I think it hasn't fully ",
        "46": "escaped consequences, right, in the sense\nthat, it hasn't been banned, but it does fight this heroic war of getting kind of\non and off bans from exchanges in various countries, and as you often mention, often\ngetting unbanned after that happens, and so, I'm curious what your story is for\nwhy Zcash itself has been, relatively speaking, treated so well so far. Um, the, there's like a... there's an important principle\nin my mind and then there's the, \"how did the dice fall this time?\" Which is actually probably a very\nimportant factor that we can't overlook The very important factor\nis that the government of North Korea never stole anybody's ZEC as\nfar as I know, not very much anyway. They stole people's ETH, so they\nwanted to hide their ETH, and ",
        "47": "you can't do that with Zcash. Well, but in the long run... Which a bunch of people\nare working to change. They're trying to add, generic\nshielded assets on top of Zcash so that you can shield your ETH on top\nof Zcash, which could change that. But... Right, I mean, we ourselves have\nbeen, talking about, trying to make ETH to Zcash bridges, right? Like, eventually someone's gonna make one. Yeah. But there's what I believe is a\nreally important principle, not only for cryptocurrency, but for America. Like, I really love America. I'm big on America. I'm very bullish on America. And it's the best country and the most\npowerful country and the richest country. I don't care what they say about\nChina, that's all baloney propaganda. and the reason is because of the\nrule of law and limited government. And the Treasury Department simply\ndoesn't have the option, however much they would like, to dictate which\nprotocols Americans are allowed to use. That's it. ",
        "48": "Therefore, I think it's a grave mistake\nto say, okay, we'll change our protocols so that you will allow us to use the\nprotocols now that we've changed them. I think that's a grave mistake\nbecause it makes them think they had that authority, which they didn't. Yeah, I guess, do, you agree that,\neventually a day will come when infrastructure is good enough that\nit allows like, Ethereum and Bitcoin and Tron people to use Zcash to\nanonymize their coins, and some baddies will, and, OFAC will get angry, and\nwhether or not they will succeed or fail in the courts, they will try. That's a good question. I don't know about infrastructure. That's like Privacy Pools, the\nfuture improvements to Zcash are currently in the future. And so I really like to\nlearn from past experience. So Bitcoin, Ethereum, Monero,\nTornado Cash, and Zcash. Those are probably the five\nmost important experiments. And it takes decades for people to\ningest these things and start adapting ",
        "49": "to them we can see, the US government is\nin the throes of attempting to adapt to the existence of Bitcoin and Ethereum. it'll probably take another five years\nfor them to complete that convulsion. What was my point? Oh, when the day will come. Yeah, I mean, yeah, I,\ndon't know what will happen. It's always, it's... already possible for bad actors\nto buy Zcash if they're willing to be exposed to the price of ZEC. And empirically, they either they don't,\nor they do and we haven't heard about it. Or they didn't steal anyone's ZEC. I mean, this is how this started. There's a billion dollars worth\nof people's Tron and ETH, and various other tokens got stolen. Right. And the, attackers didn't want\nto change out of the coins that they had already stolen. Anyway, I'm not trying\nto dodge your question. Your question was, could\nZcash be used by bad people? ",
        "50": "Who, I and the US Treasury agree are\nterrible people that I would like to keep them as far away from us as possible. Yeah, they certainly could.,\nSpecifically, the specific technology of your question, I don't know\nabout, but in principle, for sure. Yeah. Something like that could happen. Oh, it already has. You might not know the history. Zcash was barely a baby. It was like one year old when this\nRussian anti-USA spy group used Zcash for what were they doing? They had stolen a bunch of hacking\ntools from the NSA, which was a huge black eye on the NSA Which at that\ntime had the reputation as being like head and shoulders above all the\nother nations military hacking groups. Yeah. These Russians had, presumably Russian\nmilitary hacking group, I guess, had stolen a bunch of hacking tools from NSA. and then they set about trying to make\nthe whole situation as embarrassing as possible to NSA and get as much attention\nas possible with a bunch of antics. ",
        "51": "And one of their antics was, they\nsaid, we will send you a copy of the NSA's hacking tools if you\npay us $10,000 worth of Zcash. Anyway, the point of that story is, yes,\nbad people who I dislike and wish to stay far away from have you Zcash in the\npast, no doubt others will in the future. I, think there's an important my job is\nmaking the Zcash wallet, which uses UTXOs and not getting stuck in that wild loop,\nwhich I love, it's my favorite job ever. Paul here's job is to get the\nintelligentsia of Washington DC to upgrade their level of knowledge. And, it's, from watching Paul work\nthat I think there's some really valuable principles here which have\ndegraded in the American, political ",
        "52": "and policy conversation because of\nthe war on drugs, originally, and because Bitcoin and Ethereum were\ntotally transparent, second of all. So there's these people have gotten\nused to, or they've learned, and they've learned enough to be dangerous, and\nthey haven't learned the rest yet. Or they've gotten addicted to that\nlevel of invasive and pervasive control. And so, I'm really happy that Zcash,\nand hopefully other things in the near future, because there's like\n20, new things coming out right now. I'm hoping that It serves as a good\ndata point to learn from, which is a actual factual existing data point. And I'm very set, like\nit makes me feel good. And I, sleep well at night that\nthe lessons, if you wanna draw ",
        "53": "lessons from Zcash, you can hate\nit or you can love it or whatever. But, like you mentioned, it's supported in\nall the regulated exchanges like Coinbase. There's no detectable levels of\nevil terrorists using it even though it has far more users than Tornado\nCash ever had, as far as I can tell. Right. And I think this is really useful for\nteaching policy makers things because I'm very wary of hypotheticals and vaporware\nas teaching people the wrong things. Right? And I, think it's very useful to be able\nto say to people like, look, this exists. It has existed for a long time. It's got lots of users who are using it\nfor all these totally normal purposes. Anyway, I don't know how I got onto that But, Zooko, to that point you spent,\nand we spent at ECC considerable amount of time energy meeting\nwith regulators around the world. ",
        "54": "And we had these issues where, after\nthe CoinCheck hack in 2018, Zcash was effectively banned, de facto banned. In Japan, yeah. Because it was an easy button. In Japan, yep. So Even though no Zcash was involved. No Zcash was stolen by\nthe CoinCheck hackers, Right. and no Zcash was used by the\nCoinCheck hackers in their subsequent operations, but nonetheless, the\nresponse was let's ban Zcash so that we can be seen to do something. Something must be done. This is something. Yeah It was anything that was\nprivacy protecting, right? Yeah. And I think in the case the case  of\nJapan, for example, the regulators have gotten a lot more intelligent about this\nstuff over the years and a lot smarter. And we've spent a lot of time,\nand I know others have spent a lot of time providing that education. And the narratives have even\nkind of shifted a little bit. So it's not even just privacy as a\nconcern, but privacy plus self-custody, or the ability to have self-custody,\nBecause if I have self-custody and I could obfuscate kind of information, then I\ncan evade capital controls and I may, be able to fund money into different places. ",
        "55": "So the dynamics have shifted. But I think, in those early years,\nand we got called in, we got called in there, we got called into the US\ngovernment and various departments and asked about how this stuff\nworks, and kind of an understanding. And we were also,  um, It's, we've\nbeen, it's been hinted at that we take we figure out other kinds of solutions\nthat might be, um, amenable to the government where they would effectively\nhave a back door and be able to access information on a public chain. You're saying people accuse us of creating\nchain backdoor for the government. No, no, The government has\nrequested that that be included. Oh! That's come up multiple\ntimes at various... I would qualify that by saying a few\nspecific, like two or however many specific actors within the government\nhave dropped that hint, right? Yes. But in an official capacity. Yeah,a few specific departments\nwithin the government... ",
        "56": "Departments yes, that's right. Have officially dropped that hint. But it's like a non-starter for like\nto you're talking about Paul's work, on the Hill with folks working on policy. like it's a non-starter for a huge\nchunk of you know, of our, political folks in DC who are working on policies\nwho want access to things like a digital cash, they want access to... they don't, and they kick against\nanything that would allow, themselves or regulators in the US, this country that\nwe love, to have that, kind of access. So it's not it's not a it's\nnot a, one dimensional, this is what the government thinks. It's a very nuanced kind of conversation. Yeah, so, What you're saying is\nthat there are other, can I clarify? Because I just make sure I\nunderstand what you're saying, Josh. You're saying there's other actors\nlike, senators or congressmen or other ",
        "57": "departments or someone who basically\nhave opposite strategy or opposite values or opposite desired policy here. Is that what you're saying? Yep. Or Did I totally misunderstand again? Nope, that's totally what I'm saying. Much more succinct. That reminds me of something\nthat I don't know if... Vitalik probably doesn't know this story. A zillion years ago, you had to get\na BitLicense if you wanted your any New York exchanges or exchanges that\nhad New York customers or whatever. Yeah. And so we flew to New York several\ntimes and gave like lectures and tutorials to the New York\ndepartment of financial services, because they're the people who add. Coins to the BitLicense whitelist. And we explained all about\nlike cryptography encryption and all this stuff. Right. And then they called us back for another\nmeeting and we were a little confused because there were no further questions. Like we'd already explained everything. So we were like, why are we going back? Okay, let's go back. So we all flew to New York again. And this time they had like the\nwhole department lined up on their ",
        "58": "side of the giant long table. And to open the meeting, the. head of the department gestured to\nhis colleagues and said, we all agree that we don't want the pocketbooks\nof our friends and families being exposed to everyone on the internet. And I was like, Oh, that's why they\ncalled us back to say that they've decided that they too value consumer\nprotection and the protection of society and that's why they're approving Zcash\nto be one of their whitelisted coins. So, the point of this story is, I think\nthere's a few mistakes that's easy to make, especially because of the intense\nthe heartbreak and the, high stakes for the Tornado Cash developers and for\nyour and my friend Virgil and so forth. I think there's some easy mistakes to make\nthat, just like, I think regulators are, ",
        "59": "easily confused by all the things they\ndon't know, and easily played by someone who tells them, I'll sell you a, new\ntechnology that does everything you want. I think likewise, we cryptocurrency people\nare easily sort of, overgeneralized by all the things we don't know and say, Oh,\nthe government is definitely going to ban privacy because it can't tolerate privacy. Well, in fact, that's a very complicated\nnuanced thing in my experience. So I want to come back to the, paper real\nquick and the response that you had Zooko. So your point number two was that,\nin your thread, was that this isn't going to work for normal users. It's actually not going\nto provide privacy. Do you want to talk a little bit\nabout why you think that's the case? I have to admit I was too angry\nto read the paper carefully. I swear I looked at every page, but\napparently I missed 90 percent of ",
        "60": "the content based on what Vitalik\nhas just taught me in this podcast. The thing I was thinking when I said that\nwas in the context of the mixer design, which I think we all agree is kind of\npasse anyway, so the fact that it doesn't really work there doesn't really matter,\nor maybe it does work there, but it doesn't work anywhere else, or whatever. Based on what I now know, I'm\nstill processing what Vitalik taught me about how the coin ID\nset can serve as the universal set. Before, when I came into this\nconversation, I was thinking in terms of Ethereum addresses. Where you can have, there are an\ninfinite number of Ethereum addresses and you can't know them all and\nyou can't know that a bunch of them just got created one second ago. It's interesting to me that this coin\nID set can be known at a given time. Which is ironic since that's what I work\non all day long at ECC on our wallet. ",
        "61": "But, I would ex..., how do I put this? I have a lot of uncertainty about the\nuser experience and the downstream effects and the system-wide effects. I know that Vitalik's arguments both\nhere verbally and in the paper argue that it's not too costly and in fact could\neven be beneficial for the participants. So That's a good argument. I guess another part that I also don't\nunderstand yet is what Josh brought up is, quick, what's a country that\nhas pride in independence and yet is not an enemy of the United States? ",
        "62": "Singapore, maybe? Where Vitalik is right now, if\nyou're the government of Singapore India. Or India that's a great one. Yeah. if you're a, citizen of India one of\nJosh's favorite countries, are you my guess is you consider it unpatriotic to\nsubscribe to the FBI's blacklist, right? Don't you need to subscribe\nto your country's blacklist? So my question is, yeah, Josh's\nquestion was who makes the blacklist? But my related question is, is there. I don't know. Right. I mean, I think one of the failure\nmodes of something like Privacy Pools is obviously just network effects\nsolidifying too much around one single black list provider, which\nwould inevitably have its own biases. ",
        "63": "The hope, of course, is that the system\ncould be robust to, different people having different black lists, and... Yeah. So I have a great deal of UX and sort\nof emergent order questions about this. This is where I was saying I think\nit's quite premature to pitch it to policymakers as a solution. I think it's a neat science idea\nthat we could test out, and in about five years, we'll know, we'll\nhave started learning from it. I was going to say, related to\nthat Zooko, it's like the, paper talks about like exchanges using\ntools like Chainalysis, right? So. If you have a user that's KYC to a\nnew exchange, so they know who that is, and they make transactions in\nand out of that exchange, they get flagged with certain risk profiles. Right? Okay. So like based upon the, transaction graph,\num, and the kinds of behavior the exchange ",
        "64": "may ask you for a source of funds. They, um, they may want\nto get very specific. So, um some of our favorite exchanges\nhere in the US ask for very, very detailed information about your financials and\nyour financial history in certain cases. Including off-chain information, right? Including off-chain information, yep. This is potentially relevant\nto our science ideas. I mean, not cryptocurrency\ninformation, right? They're like, where did you\nget the wealth which you later converted into this cryptocurrency? Right. So how does that, how does that\ntranslate to an individual? So I understand as a company, you have\ncompliance, You got to, you got to fit within a certain regulatory regime. But how do i, it seems like a tremendous\namount of mental friction, um, to kind of figure out what my personal\nrisk profile is based upon private transaction histories and where this\nstuff may have been and where it's, going. So I may have, like you have a Chainalysis\nin the middle who can say, okay, this one ",
        "65": "is, um, should be flagged as highly risky,\nand this one is less risky, and this one is less risky, um, based upon a series\nof behaviors, but um, but how do I, how do I think about that as an individual? what do you think that looks like\nin terms of a UX in the future? Yeah, so there's two types of UX, right? There's the UX of choosing\nassociation sets, and then there's the UX of, accepting coins, right? So, when you're choosing association\nsets, I think, I mean, we can agree that this is something that should\njust be automated, right, and like, you subscribe to a provider in the\nsame way that you subscribe to a token list when you're exchanging Uniswap. Can I pause you there? Sure. I think it's a good idea. I think that the token lists\nare a good model, which is an empirical thing that we've already\nlearned from for a few years now. What does it mean? Okay, I know what it means if\nyou're subscribing to OFAC, right? ",
        "66": "You're saying we have a policy that you\nhave to prove that you're not related in a certain way, to the OFAC SDN list\nfor you to deposit to our exchange. Right. And I can imagine other people or\norganizations having the same policy. What does it mean, What does it\nmean, to have a token list which is a user association set list? I guess it means with good,\nwith, sufficient likelihood, these are all the coins... So, I can give you an\nexplicit construction right? So, let's say, even let's, forget about\nthe, chain analysis and we can try a nice fluffy community example, right? Like, so, there already is\nsomething, like that MetaMask, I think, ran for a long time. ",
        "67": "I'm not sure if they still run. I think they might be in the\nprocess of changing into a different format or something. Where they just maintain\na list of addresses. you know after all, Ethereum in its\ncurrent form does, use addresses. Or, it might even be a list of\ntransaction hashes or one of the two that are connected to scams\nor frauds in some way, right? So, MetaMask does this. Etherscan also does this, right? So when, my Twitter got hacked a few\ndays ago, the money got sent to an address, and that address already\nliterally within hours just got flagged as, by Etherscan as fake_phishing\nand then some a number, right? And so, you could make an association\nset you could literally run a script to auto-generate it, which just is every\naddress except addresses that have a fake phishing label by Etherscan or that have\nthat same label according to MetaMask's list of suspicious addresses and You\ncould also make it so that this script runs with let's say a one week delay, ",
        "68": "Right? By the way, MetaMask just\nlaunched snaps finally Yep. Which means semi-trustless plugins\ninto MetaMask which you can do lots of stuff without everything else\nin the wallet also being vulnerable to it, which is super awesome. Thanks to the object capability access\ncontrol theory from Marcus Miller and Agoric and, Dan Finley from Metamask\nposted saying, if you're only going to do one thing with the brand new snaps\narchitecture, it would be pick your favorite, most trusted provider of\nthis sort of like threat intelligence plugin, which will automatically\nwarn you if you're ever interacting with anything on their blacklists. So I think that's a great example. Okay. Yeah. so, right, so back, it's just\npopping the conversation stack a bit, back to the UX question, right? So,  the first, the first, side of UX\nis like how users choose where they're ",
        "69": "getting their association sets, right? And it's pretty easy to just like\nhave some intermediary, like could be a MetaMask or Infura or whoever,\njust run a script that says add everything after seven days, unless\nit gets flagged as like fake_fishing, something by EtherScan, right? So, that's like, that's just one example\nof a construction that can be done. And, I mean, like users would have a\nlist similar to a list from, the list that Uniswap token list that Uniswap has,\nthat they just go and pick it, right? So I feel like that\nside is somewhat easier. The set that is somewhat harder\nis like, you get coins, and are you happy with those coins? And, in, that case, it's, I mean Isn't the interface\nthat MetaMask warns you. Right. I guess you receive the coins and\nthen MetaMask warns you that you just got tainted coins, and unfortunately\ncannot warn you in advance, right? ",
        "70": "Right, exactly. I mean, obviously, if we did fancy\nstuff and we had, two-way communication flows where it's like, step one sender\ndoes a thing, step two receiver does a thing, step three sender does a thing,\nthen, you could fix that problem, but yeah Right now, yeah, by default, it would be\nretroactive, and, if it's, retroactive, then, I mean, I think it's easier for\nthe user because then they know that the coins that they got are tainted, and, I\nmean like, they could go to the person that they just got the coins from and\nbasically say what the hell, man, I mean if they want, and that's their choice. Or, the other thing that they potentially\ncould do was they could, like like, just kind of bite the bullet, possibly\ndeposit those coins into an exchange, and you know If the exchange doesn't,\ndoesn't actually bother them, then like they're basically fine again. Interesting. ",
        "71": "The, uh- I think the, okay, I think the\nreal list the outcome that I'm hoping for, right, is like, basically, for\nsmall value things, people don't care, but for large value things, people\ncare, people end up asking for more things that require more effort, right? Like, to me, this is the principle,\nthis is, you know Julian Assange's favorite principle, right? Like, privacy for the weak,\ntransparency for the powerful, right? Like, I think, if you want to ask What\nis a form of privacy that would be, yeah, I mean like, really ideal for everyone\nthen letting normal people do the things that they do with a few hundred or even\na few like, a few hundred thousands of dollars and have that be, basically\nuntraceable, but at the same time, when some crazy hundred billion dollar event\nhappens be able to apply a lot more scrutiny to that that feels to me like\nit would be close to an ideal, right? And that feels to me like something that\ndoes happen already in some contexts, ",
        "72": "but in a lot of other contexts we don't\nreally have the tools to do that well. And I think part of the goal\nwould be trying to create more of the tools to do that well. And so, the goal there would be that\nlike, if you're getting $70 from a bike, then like, honestly, I think\nas a society, we should be willing to just say, If you get $70 for a bike\nfrom a hacker, then like, whatever. The hacker was able to cash out those $70\nthat they're able to get a bike, right? Like, nobody's worried about North\nKorea getting bikes, they're worried about North Korea getting nukes. So, that's, but, obviously, these are\nmy hopes, and, the, equilibrium on all of these systems, Including, of\ncourse, the, equilibrium of, basically saying, you're either using a privacy\nsystem, or you're using a backdoor system, could go in all kinds of\ndirections, that I totally acknowledge that this is really unpredictable. ",
        "73": "Okay, so while I've got you here,\nI'm still confused about something. Is one... okay. UX equilibrium that all coins, you\ncan't safely spend any coin within seven days because you need to give\ntime for a potential recipient to know that if you were a hacker,\nyou would have been blacklisted. So now all coins have to sit still\nfor seven days in between every hop. Right. This is, I mean, this is one, sort\nof kind of solution, but like, remember this is, kind of the basic,\nthis is like the technologically easy but limiting solution, right? The Okay. But then the other one is\nthat you prove transitive. You can generate a zero-knowledge\nproof of the transitive history. Yeah. And you prove something like going back\nthrough all history, seven days worth of history, I prove that the provenance\nof these coins that where they were ",
        "74": "seven days ago was not part of the hack. Right. And then like you the said... And the flip side of that is that,\nyeah, you have to like actually provide the provenance up to the\nseven day boundary to the recipient. in order to, enable them\nto generate that proof. Yes. Can't we make a zero-knowledge proof? No, we can make a zero-knowledge proof. I can prove to you it didn't\ncome in the last seven days from anything and then you can make a\nzero-knowledge proof to the next guy. Okay, so that is possible if\nwe agree on association sets. Yes. Okay. Thanks. Okay. Guys. Wow. I know we have to wrap up soon. I know, that Vitalik has a meeting he Oh yeah. has to go to in just a few minutes. My goal coming into this conversation was\nto keep my mouth shut and just listen. So goal accomplished. and I am thrilled that you\nall had this conversation. I think the policy arena and everyone\nhere in the policy world is just ",
        "75": "going to really benefit from this. But I am going to say that I think\nthey're going to have to watch it probably about three or four times\nand read the paper three or four times, because a lot of what was Yeah. said here today is pretty\ntough to comprehend. And that leads me to say one thing\nand that, part of the reason that I personally am drawn to working\nin cryptocurrency is just to make things work the way they should. And a lot of what was discussed\ntoday was, well is it just a conclusion that you will be. OFAC'd eventually, is this\nsomething that's coming? Well, I think that's just\nnot the result that should be happening in the first place. I think a lot of what was talked\nabout with guilty until proven innocent is really clear there. And that is part of a financial\nsurveillance ecosystem that has been created since 1970, but really\nstarted to kick off since the 90s. And for everyone who watches this podcast,\nI would strongly recommend that you tune ",
        "76": "in to the most recent Bankless episode\nwith Michael Mosier and Seth Hertlein. It was outstanding to talk about how\nthings have changed so much over time. And I think it would help you maybe\nput some of this into context about what should be as compared to what is. And then ask the question, do\nwe want to take what is a new ecosystem for our financial world,\na new technology, and then make it fit into what's happening today. I, personally don't, I\ncan say that for sure. And another thing that really I\nhave to mention is that concerns me is I think one of the things we\nhave witnessed in the policy world is the power of network effects. And they're truly, they've\nproven to be almost overwhelming. And, we see that in big tech. And I fear, I deeply fear that any\nkind of, an association list or ",
        "77": "blacklist or whatever is going to\nbe subject to that unless, as was mentioned, and that, we would end up\nwith a, basically a fractured world. We would end up with cryptocurrencies\nthat are aligned with geopolitical boundaries, and then we don't really\nhave a global cryptocurrency anymore. So I'm just, I'm terrified of\nthat, but I, am not saying. It's necessarily a bad idea. I've got more to learn and I'm\ngonna watch this podcast myself at least three more times. Yeah, no thanks. thanks so much for that,\nto that conclusion. Paul. I think if I had to make my\nown conclusion, I'd say yeah. I mean, remember that, both myself and\nAmeen you know, like you know, do not have the, privilege of hailing from such\namazing lands that have wonderful things like the First and Fourth Amendment. You know I hail from Russia, and he hails\nfrom Iran, and, these like, are both ",
        "78": "countries that mistreat their own, people,\nand like, in the first case, they're definitely being very brutal toward\nforeigners like, even more so, right? And I remember a few months ago, I was\nasked the question what is your biggest fear for how censorship-resistant\nfreedom-preserving technology could become a net negative for the world? And that's something that's,\nhard for me to believe, right? And that's I definitely, yeah, I mean\nemotionally I kind of resist that possibility, but I asked myself, I'm\ngonna look, if I was told by the magic genie that is what would happen How\nwould I expect that would have happened? And my answer basically is, that my worst\nfear for this technology is that it ends up only being half censorship resistant\nin the sense that states that are like actually very authoritarian and dark are\nsuccessfully able to prevent people from ",
        "79": "using it internally, but at the same\ntime they use it to take advantage of the free world's openness and basically\nare able to keep sucking resources from and benefiting from the free world while\nat the same time undermining it and destroying and invading parts of it. And so this is definitely, privacy\nand freedom are very, concrete and personal issues for myself and Ameen\nboth, and, he's talked a lot about, wanting to protect Iranians, and at\nthe same time, obviously, not wanting to empower the governments to do all\nkinds of crazy things, and, obviously want to protect ordinary Russian people\nfrom the government but at the same time like, not enable the various, Kremlin\nrelated organizations to be able to ",
        "80": "like, have billions of, billions of\neconomic connections with the, free world that just keep enabling their\nlike, internal and external brutality. So, the ideal of transparency, privacy\nfor the weak and transparency for the powerful, or at least creating\ntools that give people the, Ability to, essentially, coordinate and, even\nboycott some powerful actors, but while at the same time maintaining a very\nhard line that, we're not doing back doors, we're not giving up privacy, and\nthat we are keeping, making sure that as we digitize these values that we've\nhad for thousands of years, our values that we continue to have is, something\nthat I think is, really like, a dear to all of us, and you know I absolutely do\nnot endorse regulators, I mean coming to a conclusion a week from now that\nPrivacy Pools is the future, right? ",
        "81": "I think, these are ideas that need to be\ntested within the Ethereum ecosystem, and that will be tested within the Ethereum\necosystem over the next couple of years. And, I fully expect Zcash to kind\nof be allergic to these things. And I think we'll see like, how\nthe experiments that play out over the next couple of years and will\ngain a lot of information that's another thing that I hope to see. That is a fantastic way\nto wrap this up, Vitalik. Thank you so much! Yeah, thank you so much, Vitalik. Zooko, Josh, Vitalik, I sincerely\nappreciate all of your time. This has been fantastic. I think this is going to be a critical... podcast for everyone who cares\nabout privacy to listen to. And hopefully they will all walk away\nhaving learned a lot and we will all work together to develop pretty good\npolicy for the cryptocurrency world. Thanks for joining. ",
        "82": "Thank you. Vulcan Peace. "
    }
}