{
    "metadata": {
        "video_id": "0dJ5U4YexRI",
        "title": "Are Sam Bankman-Fried’s parents now in legal jeopardy?  |  Dan Abrams Live",
        "link": "https://www.youtube.com/watch?v=0dJ5U4YexRI",
        "duration": "5:31",
        "channel_name": "NewsNation"
    },
    "transcript": {
        "0": "TONIGHT, THE FOUNDER OF EXCHANGE FTX. SAM BANKMAN-FRIED REMAINS IN A JAIL CELL IN BEHIND THE BAHAMAS AS HE WAITS FOR EXTRADITION TO UNITED STATES AND THE POSSIBILITY OF SPENDING DECADES BEHIND BARS. BUT WHAT ABOUT HIS PARENTS? I'M SURPRISED. SO FEW ARE ASKING WHETHER EITHER OF THEM COULD BE IN LEGAL JEOPARDY. FRIED'S IT IS A TAX LAW PROFESSOR AT STANFORD. SO HE'S ANNOUNCED HE WON'T BE TEACHING AT THE UNIVERSITY NEXT YEAR. FATHER BANKMAN WORK FOR FTX FOR ALMOST A YEAR. DEEPLY INVOLVED IN THE BUSINESS. IN ITS EARLY DAYS, HE HELPED THE COMPANY RECRUIT ITS FIRST LAWYERS LAST YEAR. HE JOINED THE FTX STAFF AND MEETINGS ON CAPITOL HILL. TAX MATTERS. AND ALSO A LARGE FOCUS ON FTX'S CHARITABLE OPERATIONS. HIS MOM, BARBARA FRIED, RETIRED FROM TEACHING AT STANFORD WAS A HEAD OF A ",
        "1": "CALLED MIND THE GAP WHICH HE HELPED START TO SUPPORT DEMOCRATIC CAMPAIGNS AND CAUSES HER SON WAS AMONG THE DONORS FOR THE NETWORK. MEANWHILE, BANKMAN-FRIED AND HIS PARENTS TOGETHER BOUGHT REAL ESTATE IN THE BAHAMAS. WORTH 121 MILLION DOLLARS NOW BANKMAN-FRIED IS MAINTAINED IN AN INTERVIEW THE NEW YORK WEREN'T INVOLVED IN ANY OF THE RELEVANT PARTS OF THE BUSINESS SUCH AS THE BALANCE IS A RISK MANAGEMENT. BOTH PARENTS HAVE REMAINED IN THE BAHAMAS AND IT HAS BEEN REPORTED. THEY'VE LEGAL BILLS, WE'LL LIKELY WIPED THEM OUT. BUT PUTTING ASIDE THEIR SON'S LEGAL BILLS, WHAT ABOUT THEM PARTICULAR THE ANY CRIMES? JOINING ME NOW IS NICK ACKER, FORMER ASSISTANT U.S. ATTORNEY FOR THE SOUTHERN DISTRICT OF NEW YORK AND WALL STREET JOURNAL REPORTER JUSTIN BAER, WHO'S MOST RECENT ARTICLE ON THIS IS TITLED SAM BANKMAN-FRIED'S PARENTS WERE THERE FOR FTX'S RISE AND NOW IT'S FALL. THANK YOU BOTH FOR COMING ON THE SHOW. APPRECIATE IT. ARE JUST YEAR. LET ME ",
        "2": "START WITH IS THERE ANY TALK OF AN INVESTIGATION OF THE PARENTS, PARTICULARLY THE DAD? WELL, I THINK WE HAVE THE MAKE CAMEO NOT IN INDICTMENTS THIS WEEK, BUT IN A RELATED LAWSUIT BY THE CFTC. SO IN THIS ONE POINT WE READ THE REGULATOR NOTING A NUMBER OF DIFFERENT PARTIES, INCLUDING THE PARENTS AND WHAT THEY MAY BEEN ABLE HAVE FTX BISER VARIOUS PERSONAL EXPENSES OF WHICH YOU MENTION REAL ESTATE. THAT'S ON THE LIST. A PRIVATE JET USE. A FEW OTHER THINGS, AS AS IS OFTEN THE CASE, IT'S A LITTLE UNCLEAR WHICH PARTY WAS RECEIVED. WHAT? BUT WE DO THIS THIS WEEK. AND THIS WAS KIND I GUESS THE QUESTION JUST A PRACTICAL MATTER, HOW INVOLVED. WHERE THE PARENTS WITH THIS ",
        "3": "SURE, I THINK WE WE WE KNOW SOME THINGS ABOUT BOTH OF YOU KNOW, IT IS MOTHER. I'M BARBARA FRIED WAS NOT REALLY INVOLVED IN THE BUSINESS THE LAST MONTH OR SO. SHE'S SHE'S BEEN IN THE BAHAMAS, ADVISING PERSON. BUT WITH BEFORE THAT HER HUSBAND. I'M JOE BANK BEEN WAS ACTUALLY IN A PAID EMPLOYEE THAT HE ACTS FOR FOR NEARLY A YEAR. HE WAS IN INVOLVED A NUMBER OF DIFFERENT FORCE THAN IS I, YOU WAS CHARACTERIZED THE BIGGEST PART. PROBABLY THE NONPROFIT EFFORTS BUT ALSO TOOK AN INTEREST WAS INVOLVED IN THE LOBBYING, SOME LOBBYING. THEY DID. WASHINGTON JOINED SON IN MEETINGS ON THE HILL. YOU KNOW, BEYOND THAT, IT'S IT'S IT'S UNCLEAR RIGHT WHAT WE DON'T KNOW HE KNEW. AND WHEN HE KNEW ABOUT THE SORT OF CENTRAL ALLEGATION OF OF THE WHOLE CASE, WHICH IS IS THE ",
        "4": "HOW IT LANDED, HOW THAT MONEY LANDED IN THIS RELATED TRAINING. THIS IS YEAH, BUT THERE ARE OTHER CHARGES WRITING N THE CAMPAIGN NICK AKERMAN. YOU KNOW, WE'VE SEEN OTHER BIG BUSINESSES THAT HAVE FAILED BASED ON FRAUD AND IT TENDS TO BE THE CASE THAT NUMEROUS EXECUTIVES AND UP CASES. IT DOESN'T JUST TYPICALLY END UP WITH THE CEO CHARGED AND NO ONE ELSE. NO, YOU'RE ABSOLUTELY THE COUNTS IN THIS INDICTMENT ALLEGING CONSPIRACY. A CONSPIRACY IS BASICALLY AN AGREEMENT TO COMMIT A CRIME. YOU HAVE SAM BANKMAN-FRIED HAD TO AGREE WHEN SOMEBODY ELSE. AND SO THE QUESTION WHO ARE THOSE SOMEBODY ELSE'S? I MEAN, THE INDICTMENT IS VERY CLEAR THAT THERE CHARGING ARE OTHER PEOPLE ARE THE SAME THAT THERE ARE OTHER PEOPLE INVOLVED KNOWN AND UNKNOWN TO THE GRAND JURY. IT TO ME, IT'S PRETTY ",
        "5": "CLEAR THAT WHAT'S GOING ON HERE IS THAT THIS WASN'T INDICTMENT PUT TOGETHER COULD IMMEDIATELY ARREST AND EXTRADITE. I'M SAM AND THEN GO AFTER THE OTHER PEOPLE IN PUT TOGETHER ALL THE EVIDENCE. "
    }
}