{
    "metadata": {
        "video_id": "BMGr4yyE1uc",
        "title": "Bankman-Fried on Crypto Downturn & Acquisition Landscape",
        "link": "https://www.youtube.com/watch?v=BMGr4yyE1uc",
        "duration": "31:50",
        "channel_name": "Bloomberg Television"
    },
    "transcript": {
        "0": "Last time we talked was in April and we made a little news.\nI was asking you to explain your old farming and you did it in this way that sort of discarded a box that Perkins came out of.\nAnd people put money into the box and there is a sort of self-sustaining flywheel where people put more money into the\nbox the tokens are worth more. And they went up and I used the Ponzi word in reaction to that. And you didn't exactly endorse\nthat. But definitely the crypto market went down. Sure. And I just wanted to revisit that a little bit. Like you know at the\ntime I think we were abstracting away from the usefulness of crypto projects. We just sort of talking about economics. But\ngiven that the token market kind of collapse look what lessons Shery Ahn draw about the usefulness. Like how much of crypto at\nthat time was kind of people investing because one went up rather than because of the usefulness of projects. Yeah. Is that\ncertainly something. Some of it for the whole space and more ",
        "1": "strongly than that. It was some of it for many species right. I\nmean NASDAQ down what like 40 percent or something like that since the peak. And and to some of this is is herd behavior.\nSome of it is herd behavior triggered by monetary policy. Right. To the extent that you know the world believed that there is\ngonna be easy money forever. And you know all numbers would keep going up except for the value of the dollar. You know people\nkept investing and then there a strong signal change. And all of a sudden people felt like\nnumbers can go down because maybe money was going to flow out of this system instead of into it. And and you know every\neverything came down in price. And as in some of this is not a crypto specific phenomenon. Some of this is like what investing\nlooks like at sort of peak mania. But you know I think putting that aside you know I think that Bitcoin's price roughly\nreflects that dynamic of like inflows outflows into the monetary ",
        "2": "ecosystem. I think that like certainly the asset price decline\nwas a strong sign that in crypto and frankly in a lot of fintech like there like things were way too late on use cases and that\nthere a lot handwaving going on both on news cases and on sort of financial modeling. That was I suspect. But I think beyond\nthose two you can look you can look at things that didn't just fall 60 percent in this crash but fell ninety nine percent in\nthe fall. And that's when I think you start to look at things that were sort of worse than just like. Yeah. There is a change\nin monetary policy a change in investor sentiment. Like those are the types of things where there was probably artificial\nmechanisms sort of that were you know freeing these flywheel wheels driving up with nothing fundamental backing it. And then\nthe flywheel starts to falter and the whole thing crashes back down. Obviously Luna is like you know the prototypical example\nof that Celcius probably putting it in a similar bucket. And I ",
        "3": "think you know that that sort of has a layer of which adds a lot\nof the long tail space of crypto and some selection of what we're considered sort of you know more respected second tier\nplaces that that we're probably worse than then just like you know monetary policy change that people say a lot about bubbles\nis that there's a sort of misallocation of capital. And like look. Does that make sense in this space to talk about that. And\nlike is capital being like sort of better allocate enough to the winter. Yeah I think it is. I think it is. And I think it does\nmake sense to talk about that. And I think that like you where have the surgery ratings been so to speak whereas the or the\nrelative free ratings been. I think one thing when you look at the companies in crypto and frankly across this space I think\nprofitability was sort of a dirty word for a number of years and it has returned to investor parlance. Right. Like last year if\nyou saw a typical funding round from theses like was that ",
        "4": "valuation related to the profit of the company. Probably not\nlike revenue with sort of like like they're sort of without saying so explicitly. Everyone just suddenly slipped from like\nyou know even our profit or something to just purely revenue as like the driver of value and like no thought towards like how\nprofit would eventually catch up to that. And I think that there's been a substantial rerating towards looking for at least\nlikely or at least plausible pathways towards profitability being a core component of an investment thesis in a company\nwhich feels a little strange to say. But but I think was something that was kind of missing. And then when you look at\ntokens I think that like there's this sort of question of like if it ever woke up one day and this thing was missing was gone\nwould anyone miss it. Right. Like. Like wouldn't it be like oh shit like someone has to go to start the new this thing now that\nthat that old copy was gone. I think that that's been like a ",
        "5": "fairly strong predictor of which things have survived versus\nwhich things have not. And I think that like you know obviously.\nLike sable points I've survived. Exchanges have survived. I block chains that have some property that is sort of like\nplausibly superior to other block chains have survived on including just being like a more consensus on you know a\nmechanism was like more built in consensus from lots of players and things where like if they went away you would forget they\never existed have generally sort of gone away and people started to forget that they existed.\nTell us what you're where you're sort of interests or knowledge. This is like in your day job. I think of you as like running an\narbitrage fund and running an exchange that kind of like quips fees from people trading stuff like how important to you to you\nand your job is that things be robust or useful. How much of it ",
        "6": "is like if a number is moving around that ISE to make a profit\non it locally speaking. It's mostly driven by the latter. Like if you want to say like what's going to determine how much\nrevenue we make next month like realistically speaking like whatever that's gonna be a function of volatility and volume and\nmonetary flows and things like that. And that's the same thing. If you look at you know NASDAQ right. Like what what what's\ngoing to term NASDAQ Q3 earnings this year. People aren't sort of looking at like fundamental like you know long term business\nmodels of things. People are saying like well what's market value can be like. I think when you look at a longer term view\nthough I think it is quite important. When is it G3 trading. This is something that like some of the more senior people there\nwould say sometimes things have not long but not really nothing. Disagree being it didn't really sink into me which is they say\noutlook. Sometimes volatile days can be good for profit but in the long run view like we like it when markets are healthy and\nefficient and going up and stable because that is in the long ",
        "7": "run what just creates more activity. Right. And like even if you\nignore any altruistic things you're right. Just like that. That's what long run. And I think there's a similar thing here.\nWe're like how healthy the ecosystem is in the long run is going to be a very strong predictor of how much we can grow.\nSo on that note I want to talk about you know one big symptom of the crypto winter is like there's been a blow up of a number of\nplatforms that I would sort of loosely call crypto shadow banks where there's young taking on short term demand money from\ncustomers and lending it in weird opaque ways. And you have. Touched in some form. Probably all of those.\nYou've been a lender a borrower a rescuer. So the natural side way is like.\nHow much of the rescuing activity is about that very long run view of like it is healthier for the cocoa ecosystem that you\nare levered to for depositors not to be constantly blown up. ",
        "8": "That's a real part of it. Like. And maybe to make this like more\nconcrete like the explicit sort of like working principle we hide in number of these was like it's okay to do a deal that is\nmoderately bad in bailing out a place like the bar was not. This is a good return on investment. The bar is like this is not that\nbad of a return on investment or like we are incinerating a relatively small ish amount of money in doing this.\nAnd just to tease that you're incinerating a small amount of money because look in the long run you get a large amount of\nmoney from the crypto ecosystem being healthy. I was gonna say healthy but I almost said popular work.\nWell I think it's I think if you want to look at it from just a strictly business case. Right. And obviously if you were ever\nfiscal duty to your shareholders to do things that make sense for RTX you you could say look it's it's a being healthy. That\nwould cause it to be popular. Right. Ultimately the popularity ",
        "9": "that would matter. But like that there's a flow through from\nhealthcare which is there is the operative thing. I think there's also just a thing of like we need to be a good\nconstructive factor in this space if we're not. It's just like that on many levels and ways that we can be.\nI I think we'll sort of like be a diffused good debt like whatever. We don't need to know beforehand exactly how that pays\noff. So when I look at the things that you did some of them are you sort of like.\nI'm going to shorthand you bought block five. You did not buy voiced by Voyager and you incinerated 75 million\ndollars on Voyager and then said that's enough. Thank you. And then you I think loosely speaking incinerated had no dollars\non Celsius because you're like that's definitely enough. Thank you.\nTalk about Lake. Talks are generally about how you make those decisions like\nwhat. Like. Yeah like when someone's bad like what's bad about them when someone's leg blown up but good enough to go to the\nelephant like what were they doing. Right. You know give me a ",
        "10": "sense of what's going on there. Totally. And take a step back.\nLike when we have to make the first decision we don't yet know sometimes which is things like if you like call me up tomorrow\nnight and you're like some very weird things happened. And like I'm going to die if you don't wire me two thousand dollars.\nRight. Like I'd be like OK fine let's deal with that. Making sure you don't die. And then we can talk about what exactly\nhappened to get us there on and like that for Celsius. Right. And then maybe I'll I'll I'll tell a little bit about like that\nfirst conversation at rivals that I had with Sarah. I'll give a moral conversation. This is how I would like the first\nconversations going. It reflected some but not all of our first conversations which is we get on the phone and the other\nprocess. Hey thanks for taking call. We're sort of in trouble. It's one thing. U.S. series exactly where we are. Here's where\nour balance sheet is today. Here's our assets. Here's our ",
        "11": "liabilities. Here's the uncertainty in it. Roughly speaking.\nBallpark. Here's where it's coming from. Pause for a second. You know and I want you to continue to be around a little bit more\nlike look like when they say here are assets or liabilities like which number is bigger. Right. Yes.\nWell I hear you. But even though they use numbers that are the first rate the\nfirst test is not even which is bigger. The first test is do I walk away from that first call feeling moderately confident that\nI know what the numbers are. Whether or not they're good. Do I even know them. Right. And like that was like sort of like the\ntest for us to like consider doing like just some emergency thing while we hear and other things. One of the criteria was\nthat we know what the numbers are. Whether or not they're good. And some failed that test of like not just the numbers were bad\nbut like we literally came away confused and like wait a second. And that's what this whole evaluation. That's that's like we\nthink either they're not being transparent with us or they don't ",
        "12": "know their own business. But one way or another they like cannot\ntell us the number in this account. And like what were you Marc Thiessen. We don't even know how many shares of that illiquid\nthing they have. Right leg. It's just like there's nothing there. And at first no one knew how to march three hours capital\ndebt the day after this happened. Right. That was one of the big guns like the number you put on. Exactly right. We would've\naccepted. And this amount of debt with three arrows as part of this. Right. So step one is like literally do we know what is\ngoing on. And then then step two is like fright. We recap the obvious things. We compare the two sides of this ledger. Right.\nAnd like in the cases where it was most obvious to do something is when they are about equal. Right. What what went the assets\nand the liabilities are like roughly the same number. And you could imagine someone saying look here's the outstanding\nuncertainty we have. It is plus or minus 20 million depending on those uncertainties. Right. That's the place where it's sort of\nlike most obvious that we should act because if we don't they ",
        "13": "might be slightly underwater. And there are serious questions\nabout like do they have to take drastic corporate action. But for like a relatively small you know sort of like potential\nincineration of money we can like resolve that problem and make them able to like continue operating and like carry on and not\nlike cause contagion or customers losing assets or anything like that. So that certainly is the best case. Well OK the best case\nis ISE tons of extra capital. But then why are they calling us. So OK. Of the of the calls you might get the best case is when\nthey have about zero. Left. Right. And you know they're like look we need a buffer here so we can\ndefinitely pay salaries without dipping into customer funds like you know like that. That makes sense. Right. And in those cases\nlike what we would tend to do is like OK because otherwise they won't depending on the company. Right. Otherwise they maybe they\ndeclare bankruptcy or maybe they would dip into customer whatever. There's a lot of unpleasant choices there. Right. And\nso in that case what we say is like OK first things first let's ",
        "14": "just give you a line for something 50 million whatever.\nSomething that is definitely bigger and the like plausible downside here. So you definitely have a surplus and we can\njunior to customer assets as amount of money where if we totally misunderstood this like it's OK it's all sides like whatever\nshit happens and then we can talk about what's next. Junior to customer assets is the purely the good citizen for the eco\nsystem because it seems like a good idea. Not do that. Like one option is to not do that. Yeah. So the way I see it is like\nthere are cases where it makes sense to do it not junior to it. But it doesn't actually solve the fundamental problem here.\nRight. And so it's I think basic answers like. Yes like I know. I feel kind of like we're giving you the senior line. Maybe it's\nuseful for you but this isn't like I don't feel like that solve the problem. Morally speaking it's all their problem. Right. I\nthink basically I like that. That seems like she went away. ",
        "15": "Structure it. What can you tell you what the problem is. Because\nlike I mean I get to sort of broader as the term gets rather much is learned run on a bank or. Yes. Balance sheet and so on\nto totally free. And that's a good point which that there surf liquidity versus net asset value or whatever. You know having\none thing. But and and the junior versus senior thing is primarily a high net asset value type thing of like at the end\nof the day will customers get their money back eventually. Where's the senior line can be useful and it can be into the\nsenior line something to actually consider if what was going on was a mismatch in durations. So one hypothesis about\nselflessness which did not turn out to be true but which was speculated about was that they were completely totally fine\nexcept that they'd taken a lot of customer theorem and staked it on EU and that it was going to be about a year before they could\nrealize that EU and the customers might try and withdraw before then. Right. And in that world than actually senior line of\ntheory and floated to them equals that balance would be all they needed. Right. And so if it's just a liquidity crunch then\nabsolutely like senior lines totally fine. If it's a net asset ",
        "16": "value crunch then it's a lot less clear that a senior you know\nthat senior debt is is super helpful there. And by the way like the different platforms two completely different approaches to\nhow much they give a shit about the net asset value version of this. Right. Some of them gave me shit. Some of them did not.\nAnd in what. What do you mean. Well so like everyone had to care about liquidity right. If customers try to withdraw and you\ncan't tell the withdrawal your business ends. So like that does clear to people. I'm being a little bit like a some people did.\nPeople didn't seem worried that. Yeah or whatever. There's definitional things going on here\nright. You can mark things to whatever you can serve. But but like there were a lot of cases where it was I think like we felt\nlike they had been maybe less than than maximally responsible in terms of their actual underlying financial health.\nYet one thing that I think is striking about these situations is ",
        "17": "that like their healthy situation was like 20 to 1 leverage\nright. Where like the liabilities are. Demand deposits from retail customers. Yep. And the assets are unsecured loans too.\nYep. I went to hedge funds and look up investments in volatile ISE. Huh. Like what happened. Like how did how do you like.\nYeah. How does that. Right. OK so let me describe two different things. One could have done thing one lend a billion dollars to\nthree hours capital and take one point three billion dollars of random crap as collateral. A second thing we couldn't one could\nhave done is the first half of that sentence. Right. Right. Without the second half. Right. And I think that there's a very\nbig difference between those two. Right. Fundamentally there's risk in both. But with the first one optimistically the risk\nthat you're looking at is like maybe something illiquidity market move quick something something. And there's like a 10\npercent haircut on that if you get unlucky. It's sort of like ",
        "18": "maybe maybe they're so illiquid. That's much more than that. But\nlike the second one is like something something hundred percent haircut like it ends. And so I think that like like unsecured\nwas like a relevant piece of what you said. And the interesting thing is that like.\nBut that was a very big determinant of whether a platform blew up. If they had dealt with three errors. Was there collateral\nposted in return. The interesting thing is that like\nsome platforms did some platform incident that completely changed the situation. But from an outside perspective what was\nthe incentive mechanism on them to bother asking for the collateral like. Obviously\nat this point a lot people wish they did. But like so much this is about the details details and me sort of a big\ndetail. But but like it very very good with little or. But but it's not like you open up the app and this is obvious right.\nDon't like. It's not like it. It's sort of like an obvious functional part of the product. Some of these were coin flips\nabout whether they bothered asking harder for collateral or not. ",
        "19": "And like it's incredibly important decision but it's one which\nlike there is no punishment for at all what you did until everything blew apart. And there is no end. Like if you think\nabout like what could regulation have done here. Right. I think one thing that regulation would really want to do is like ask is\nthere collateral right like that. That seems like a really important.\nPerspective that there should have been some amount of oversight or transparency or like you know enforce good risk management\non. But there just wasn't. And again from an outward facing perspective no one has any idea whether or not you actually got\nthat collateral. Like what does those needs so much unsecured lending. I mean\nlook broadly speaking there are a hedge fund right. There are financing positions. Why aren't they pledging the positions that\nthey're financing. I. Well at the end of the day the sort of ultimately did in that their positions are all gone now.\nNow that's a good place for them to Celsius but. Right. Right. ",
        "20": "Well OK. Maybe they place them to Celsius. And also too many\nother people at once. Sure it does. But the little unsecured loan is very very right. But maybe maybe another way of saying\nthis is like how did they lose so much money is like lately. Fundamentally it's not that like through his positions where\nilliquid I think they're just like lost money. Like at the end of the day their net asset value is very negative. And if you\nget into that position like nothing like people lost somehow. Right. And I think B.S. answer is like I don't know what they\nwere like. Probably I don't know exactly how they're doing. But like that certainly hints as I'm not being like a series like\nlow risk arbitrage firm and more of a like had giant positions on and sometimes they did well and other times they didn't take\nfirm. And I think that they're like debt was probably rated treating them as more of an arbitrage firm and their trading was\nprobably much more punting than market making. So that John also borrows from these platforms like the borrowed\nmoney goes ",
        "21": "to tell you about sort of what's.\nIs that sort of like ordinary correspondents and visions that arbitrators are your secured. It's all so again. There's there's\nsome variety here. Generally there are at least decently secured. Often there over secured on. And I think basically like\npart of the underlying thing here is it's it's hard to get capital into the crypto ecosystem like there's giant bottlenecks\nregulatory among other things as are the spigots that you do see are like people like develop some for a spigot to connect non\ncrypto money with crypto money and then sort of like grow the hell out of it like try and get as much as they can through that\nspigot because the other spigots aren't working. And this has been one of the ways that capital got into the crypto ecosystem\nin the first place. Obviously it's been a huge outflow of that capital. Not surprisingly over last couple months. Tom Keene say\nthis looks like the retail deposits on these on these shadow ",
        "22": "banks which are which are like a girl. Yeah.\nBut there's others. So there's institutional money in there as well. It's all retail\nand institutional money is functionally like we're going to give money to a platform which is going to lend it out as sort of\nsenior claims on crypto hedge funds. That's basically right. Yeah. So you're getting all these calls about rescuing. What are they\ncalling you look like. Why aren't you making the calls. What's the difference between where you run us. Sort of right. Yeah.\nWhat what's what are you doing on collateral on so well. But seriously like that is sort of this actually interestingly ties\ninto ISE FTSE application just to some extent. You know we look at what is at RTX. Let's ignore the spot trading for a second\nand just look at the derivatives piece of this right. Where ",
        "23": "although spot margin whatever it looks a lot like derivatives\nand some lenses on the way that a risk engine works effectively is you know your cousin Jill wants to you probably if it doesn't\nhelp but pretend you did to them. Yeah. Cool. You can substitute the name in your shirt for good. Right. So you know Jill as a\nfamily office that wants whatever to put on it a hundred thousand dollar Bitcoin futures position. Right. Step one. OK.\nSomeone is near your customer process. Blah blah blah. They have an account. Now step one out of the like trading piece\nof this is not them sending in order. Step one is them depositing collateral to the clearinghouse. So you deposit\nthirty thousand dollars of collateral to the clearinghouse. Same house recognizes this is great. You've got margin puts on a\nhundred thousand dollar position from the clearinghouses perspective. There's no money outside of that thirty thousand\nlike. It's not saying if Joe loses on this that's fine. We'll ",
        "24": "call her up and assume she'll will not take that phone call and\nthat the risk engine has to manage that such that that's OK. It has to manage this such that you know Bitcoin starts going down\nthat amount of collateral meaning starts to decrease. Eventually it a margin call. Ask you that before that number goes negative.\nWhat gives you that. Well there's still positive amounts of remaining equity value in the account with the goal of never\nhaving any account go negative even given no recourse. Given that like you can never call someone up on a different model\nthat you have is step one. Joe puts on a position. Step two. Bitcoin goes down. Step three. You call up Jill and\nyou say please deposit fifteen thousand dollars because that's the amount that your position is underwater right now. Model 2\nthe risk is that she doesn't pick up the phone. Right. Maybe she doesn't have any money. Maybe she'd prefer to have the\nmoney than to give it to you. Many people would prefer that for one reason or another. Right. If she doesn't pick up the phone\nyou've got a hole in the system. You've got a fifteen thousand ",
        "25": "dollar hole in the system.\nAnd I you know that's got to be either you're paying out of pocket or socialized or something. The way that we try and\nstructure it is that there is no they don't pick up risk because we've required collateral deposited. But both of near beforehand\nas what that means is yet yet there's a big market move. And in fact some of the names that you've heard about had accounts on\nit. Yes. But like that collateral there. And like if they refuse to\nanswer margin call like eventually we deleverage their position while they still hide non negative account equity value left.\nAnd so there's no overall contagion or hit to this system. Would you say that like there was stressing or testing of your\nkind of like liquidation models during the almost like month or two. And where did you learn. Yeah. So I mean Bitcoin fell from\nlike 30 K to 20 K at around 11 p.m. on a Sunday I think roughly which is it's not the most liquid time in the world.\nAnd and so we got to see empirically like OK you know we had by ",
        "26": "ver how many billions of open interest like some of that was\nlove for long. Like what happens when there's a 30 percent market move you know trigger it over a two day period roughly.\nAnd I you know we I will say that I had a business trip that week a falling out like Sunday or Monday. And like we sort of\ngot to the places like this is dumb. I should fly back to the office like the market literally just dropped 30 percent since I\nlike took off. Like I need to be at work not like dicking around here like trying to talk with outside parties. And I of like\ncall people who like you looked at black call people. And one the most surprising things to me was that like they're actually\nlike nothing was on fire in terms like our systems like. Like ultimately I did not fly back and it was forager dumb.\nIf you look at the liquidated button faster than those who think there's risk there's nothing for me to do. Right. ISE like hey\nguys can I help. And they're like what would you do. Right. And ",
        "27": "like everything this helps. Like I don't know. Don't buy bitcoin\nlike you. I felt it would have. Well we had we did have real conversations\nat some point about like at what point. So RTX keeps its treasury in dollars. Like we didn't have conversations at some\npoint about like at some point we just buy bitcoins. Right. Like. There was a price we not hit that price but we had a price\nin mind of like at this price. We will start to buy Bitcoin and that would have been our FTSE. Yeah it would've been. Yeah. I\ndon't like actually Alfred Almeida anymore data. And so it's you know they were sort of doing a variety of trades. The details of\nwhich I don't know. But like at some point RTX could could purchase crypto and so on. On balance sheet it's like not\nexactly a hedge for a business but you know I mean right at some. Right. Yeah. And it's in the same vein as sort of\neverything else. Yeah. Right. Where it's like you know. ",
        "28": "The nice way to put it would be being sort of pro social to the\nencrypted yet a system where like you are bailing out. Your positive facing platform right. You're buying Bitcoin. Yeah. I\nenter if some of this keeps the question like which needs a bailout more bitcoin or depositor facing platforms. And your\nanswer is depositor facing platforms. But you could imagine a slightly different world where the answer is bitcoin right.\nWhere like there's more cell pressure on the asset and you're under floodlights platforms in which like that would have\nshifted that calculus up a little bit there. But yeah it's basically nothing was on fire. It's sort of like works somewhat\nsmoothly and underclothes. But firms the. In the long run sort of supportive of crypto generally refuse\nfor bailing them out. Or like her. You're getting people back home. Yeah. Ding people back in making sure that there aren't\ncustomer losses making sure there's some contagion that spreads through the ecosystem of like debt on debt on debt. Sort of like\nyou know collapsing. And I mean separately I think they're like hard risk management questions that a lot of these platforms\nwould need to ask themselves. Even in the case where they're ",
        "29": "fully made it through this event. But like that sort of that\nstep two and step one is like stabilize. And step two is like think about what the weather this business model and the symbol\nthat it's you know if it made sense in the first place. Yeah I'm curious just like why people for running 20 to 1 leverage with\nthis model. Worked and why people let them. Yeah well suits on the lot them again it's unclear. You could tell us a customer\nwhat the leverage. Right. Right. Which is a problem in of itself. But there it seems are institutional players facing\nplaces like Celsius. Yep. Advisor. And yep the fact that no one was like 20 or 1. Well so the institutional players don't\nnecessarily see their whole book bright like like they don't necessarily know if most of their loans were over collateralized\nor not at all collateralized. And the platforms themselves were the only ones who saw their\nwhole books and actually knew what there was. And unlike you ",
        "30": "know we sort of got to look at all all those books after the\nfact when we're driving in bailout mode. But but I'd not know prior to that exactly what the each these places books were\nactually in to begin with. And they'll all give you pitches which are probably a little overoptimistic on average about what\ntheir real risk looks like. So really with a minute left I want to just quickly ask about 30\nof altruism. But one model for your kind of utilitarian calculus is that you get a lot of people want to gamble. Cryptos is both\na good sector for gambling and a very efficient way to extract fees from gamblers. You run a crypto exchange and you are sort\nof in the business of funneling money from people who are going to use a Paul Allen doubling to like animal charities and\npandemic preparedness. And Joe Biden is that too cynical of you or is that not cynical at all or. I think it is too cynical. I\nthink there is also something that more appreciation for over ",
        "31": "time. I think I sort of like had much more unformed plots of\nthis earlier in my life. But I think I've increasingly come of the view that like it is I at the very least I want to be doing\nsomething that positive like with the making money part like like a I want to be a good actor there. And I think that like\npart of that is just like is unsustainable. If you're not and has a huge number of bad flow through effects\nand and it's destabilising for a society to to some extent. And so I think like you know I like am to some extent in the\nbusiness of like you know make money and then giving it away like that. That is absolutely right in the business of. But I do\nwant to make sure that like that first that even if I think a lot of values for in the second step that that first step is not\ndestructive. "
    }
}