{
    "metadata": {
        "video_id": "a0ew7nxKf8Y",
        "title": "Complexity is Sam Bankman-Fried's friend here, says Puck's Teddy Schleifer",
        "link": "https://www.youtube.com/watch?v=a0ew7nxKf8Y",
        "duration": "8:18",
        "channel_name": "CNBC Television"
    },
    "transcript": {
        "0": "MARKET SITE IN TIMES SQUARE. THE S&P FUTURES REPUBLARE UP 11  POINTS.  >>> AND THE TRIAL OF SAM  BANKMAN-FRIED IS KICKING OFF  THIS WEEK WITH OPENING ARGUMENTS WITH TESTIMONY FROM THE SOFTWARE ENGINEERS. TEDDY IS A FOUNDING PARTNER AT  PUCK WHO HAS A GREAT NEWSLETTER  AND COVERING THIS RELIGIOUSLY,  TEDDY. THE EARLY TAKE AS YOU HAVE BEEN  WATCHING THIS THIS WEEK. >> IT IS SURREAL. JUST TO SEE SOMEBODY WHO, YOU  KNOW, A YEAR AGO, ANDREW, YOU  AND I WERE INTERESTED IN HOW  HIGH THIS PLANE WAS GOING TO FLY TO SEE SAM BANKMAN-FRIED WHO IS  MY AGE OR TWO ROWS AHEAD OF ME  BEING ACCUSED OF FINANCIAL FRAUD WITH HIS PARENTS. HE WAS AN AISLE DOWN FROM ME AND I'M SHOCKED AT WHAT HAPPENED. ",
        "1": "THE SPEED IS MY EARLY TAKE OF  HOW FAST THINGS CAN GO UP AND GO DOWN. >> TEDDY, HAVING BEEN IN THE  ROOM AND HAVING SEEN SOME OF THE OPENING STATEMENTS AND THE LIKE  AND YOU HAVE A GOOD SENSE OF THE KIND OF TESTIMONY WE WILL SEE IN THE NEXT COUPLE WEEKS AND THERE  IS A FEW WITH THE CONVENTIONAL  WISDOM WHICH IS THIS IS AN OPEN  AND SHUT CASE AND HE WILL GO  AWAY FOR A LONG TIME. THERE ARE A COUPLE OF FOLKS  WHICH HAVE AN UNCONVENTIONAL  TAKE WHICH SAY OVER THE NEXT  COUPLE WEEKS, A JURY WILL BE  CONVINCED OTHERWISE. DO YOU SEE THAT WHEN YOU HEAR  PEOPLE SAY THAT AND SAY NOW  THAT'S CRAZY? DO YOU SAY I CAN SEE HOW THAT  CAN HAPPEN? HOW DO YOU SEE THIS EVOLVING? >> I THINK A GOOD WAY TO THINK  ABOUT IT IS WHAT IS THE STORY WE WILL TELL IF SAM BANKMAN-FRIED  GETS ACQUITTED? HOW DID IT HAPPEN? I THINK IT HAPPENED BECAUSE  THERE ARE 12 JURORS REACHING  ",
        "2": "UNANIMITY ON ANY OF THE CHARGES  IS GOING TO BE DIFFICULT. THERE ARE 12 PEOPLE. THEY ARE SITTING IN JURY  SELECTION AND A WIDE SECTION OF  NEW YORK. CONVINCING 1 OF 12 PEOPLE THAT  WHAT SAM BANKMAN-FRIED DID WAS  QUOTE/UNQUOTE REASONABLE. IT WAS REASONABLE TO EXPECT  CRYPTOCURRENCY TO CRASH. THAT CAROLINE ELLISON WOULD HAVE MORE OF A HEDGE. SAM DID NOT CONVINCE 12 PEOPLE,  BUT ONE JUROR. HE HAS THAT CHARM, SADLY, THAT  HOOKED A LOT OF PEOPLE. WHAT'S ONE MORE? >> WHAT IS YOUR SENSE THAT HE  WILL TESTIFY? >> I THINK HE WILL NOT BE ABLE  TO RESIST IT KNOWING HIM. I THINK THERE IS A LITTLE BIT OF NOTHING LEFT TO LOSE AND THAT  MENTALITY CAN BE DANGEROUS,  ",
        "3": "OBVIOUSLY. >> THERE WAS A GOOD PIECE  YESTERDAY IN \"THE WALL STREET  JOURNAL\" AND I IMAGINE THIS WILL COME INTO THE CASE WITH A PERSON WHO HAD SEEN IN THE CODE THAT  ALAMEDA WAS CODED, EFFECTIVELY,  THAT THEY DID NOT NEED TO KEEP  COLLATERAL OR TYPICALLY FOR  EVERY OCTACCOUNT ON THE SYSTEM,  THEY LIQUIDATE AT A CERTAIN  NUMBER. ALAMEDA WAS CODED OUT SO IT  WOULD NOT TAKE PLACE. HE BROUGHT THAT TO THE ATTENTION OF SAM'S LIEUTENANT WHO MAY  TESTIFY, WE WILL SEE, AND ALL OF A SUDDEN HE TOOK OUT THE CODE OR DID SOMETHING TO MAKE IT LOOK  LIKE HE WAS DOING SOMETHING  ABOUT THIS. HOW DO YOU SEE THAT? IS THAT THE MOST CENTRAL PIECE  OF THE CASE, DO YOU THINK? >> I THINK IT IS EXTRAORDINARILY DAMAGING BECAUSE SAM A'S DEFENS  ",
        "4": "IS I'M OVEREXTENDED GUY AND  BUILDING THE PLANE WHILE FLYING  IT TO USE THAT CLICHE. IN THAT SITUATION, PROSECUTORS  WILL USE THAT EVIDENCE AND SAY  THIS WAS INTENTIONAL. THIS WAS A FRAUD BECAUSE THERE  WAS FORESIGHT. THIS WAS IN THE CODE TO HAVE THE BACK DOOR TO ALLOW ALAMEDA TO DO WHATEVER IT WANTS. THIS WAS ALL AN SAM  BANKMAN-FRIED MISTAKE. EVERY PIECE OF CODE THAT  CONTRADICTS THAT TO SHOW THERE  WAS FORETHOUGHT PUT INTO THE  MECHANICS HERE IS  EXTRAORDINARILY DAMAGING. I THOUGHT THAT STORY UNDERCUT  THE DEFENSE'S CASE.  >> TEDDY, IF YOU BOIL THIS DOWN  TO THE SIMPLE OUTLINE OF THINGS  WHICH IS WHAT I WOULD DO IF I  WERE IN A SITUATION TRYING TO  PROSECUTE IT, THERE WAS MASSIVE  MONEY MISSING. FUNDS USED LIKE A PIGGYBANK TO  ",
        "5": "DO WHAT HE WANTED WITH. I DON'T KNOW HOW YOU ARGUE  AROUND THAT WHEN YOU WERE TAKING CUSTOMER FUNDS TO BUY YOUR  PARENTS EXPENSIVE PLACES AND  USING THEM TO GIVE MONEY TO ALL  KINDS OF POLITICAL CANDIDATES. JUST WE HAVE SPOKEN WITH OTHER  PEOPLE IN THE INDUSTRY AND THEY  COULD NOT FIGURE OUT WHERE THE  MONEY WAS COMING FROM. JUST BOIL IT DOWN TO A BUNCH OF  MONEY HERE AND I USED IT HOWEVER I WANTED. >> SURE. PROSECUTORS ARE GOING TO TRY TO  STRIP AWAY THE COMPLEXITY HERE. IT WAS INTERESTING IN OPENING  ARGUMENTS. PROSECUTORS DID NOT WANT TO  EXPLAIN WHAT CRYPTO WAS. IT WAS INTERESTING. THEY HAD A DASHBOARD UP ON THE  CAMERA IN THE COURTROOM. SHOWING HERE IS WHAT A WALLET  LOOKS LIKE. WHEN YOU LOG IN, $50,000, YOU  EXPECT TO GET $50,000. COMPLEXITY IS SAM  BANKMAN-FRIED'S FRIEND HERE. YOU ARE RIGHT. PROSECUTORS WILL MAKE IT ABOUT  SOMEONE STOLE YOUR LUNCH MONEY. HE BOUGHT HIMSELF A BAHAMAS  ",
        "6": "PENTHOUSE. THAT IS NOT RIGHT. THAT IS THEIR BONES LEVEL READ  OF THE CASE.  >> TEDDY, I WANT TO TRY TWO  DEFENSES OUT ON YOU TO SEE HOW  THEY PLAY. >> SURE. >> ON THE CODING, MEANING WHAT  HAS BEEN CALLED THE BACK DOOR. OTHERS CALL IT CODING FOR EACH  CLIENT AND SAYING HERE ARE THE  RULES FOR THIS CLIENT VERSUS  THIS CLIENT. ALAMEDA HAVING A DIFFERENT ROLE. THE ARGUMENT WILL BE MADE THAT  ALAMEDA, AS YOU KNOW, ORIGINALLY TOOK IN FUNDS ON BEHALF OF FTX. FTX CUSTOMERS WERE FUNNELING  FUNDS THROUGH ALAMEDA. BECAUSE OF THAT, THIS WEIRD  GENESIS OF THE COMPANY,  ESPECIALLY EARLY ON, THAT THEY  CODED IT OUT BECAUSE THEY WERE  MOVING MONEY IN A WAY THAT THEY  WOULDN'T WITH ANY OTHER CLIENT  ON THE PLATFORM TO BEGIN WITH. IS THAT HOLD WATER WITH YOU? >> SURE. THAT IS NOT REALLY EMPHASIZED,  ",
        "7": "I'LL SAY BY DEFENSE LAWYERS IN  THEIR MOTIONS. YOU KNOW, THEY CLEARLY WANT TO  BLAME THE LAWYERS AS MUCH AS  POSSIBLE. THAT IS THE CORE OF THE  STRATEGY. THAT IS A BETTER DEFENSE THAN  WHAT WE HAVE SEEN SO FAR. >> IN MY OWN REPORTING, I THINK  YOU ARE RIGHT. THAT IS PART OF IT. I'M NOT SAYING IT IS A VIABLE  ONE. I'M CURIOUS. MY OTHER IS INTERESTING TO ME  AND I DON'T THINK IT CHANGES THE OUTCOME, BUT YOU MAY THINK  DIFFERENTLY. IT NOW INCREASINGLY APPEARS THAT ACTUALLY ALL THE MONEY, THE FTX  MONEY, WILL COME BACK. NOT TO SAY IT WAS THE ORIGINAL  MONEY, BUT THE TOTAL MONEY LOST  WILL NOT ULTIMATELY BE LOST IN  PART BECAUSE INVESTMENTS LIKE  THE ONE THEY MADE IN ANTHROPIC  WILL BE SO SUCCESSFUL THAT WHEN  PEOPLE LOOK AT THE TOTAL  NUMBERS -- TO ME, THAT DOESN'T  CHANGE THE ARGUMENT OF THEFT. ",
        "8": "I DON'T KNOW IF YOU THINK THAT  CHANGES AN ARGUMENT FOR A JUROR. >> SURE. IF SOMEONE STOLE YOUR LUNCH  MONEY, BUT GAVE IT BACK TWO  YEARS LATER FROM SPECULATIVE  INVESTMENT THEY MADE WITH SOME  OTHER COMPANY. >> THEY STOLE SOME "
    }
}