{
    "metadata": {
        "video_id": "HOMA3RxhAPw",
        "title": "FTX CEO Sam Bankman-Fried: Bloomberg Crypto 09/27/2022",
        "link": "https://www.youtube.com/watch?v=HOMA3RxhAPw",
        "duration": "25:04",
        "channel_name": "Bloomberg Television"
    },
    "transcript": {
        "0": ">> WE ARE LIVE FROM THE\nBLOOMBERG WORLD HEADQUARTERS. I'M MATT MILLER. >> WE'RE TALKING ABOUT THE\nPEOPLE SHAPING THE WORLD OF DECENTRALIZED FINANCE. MATT: COMING UP, A CRYPTO BILLIONAIRE\nJOINS US TO TALK STRATEGY AT SUCCESSION AS HIS DEPUTY STEPS\nDOWN. KAILEY: AND THE CRYPTO INDUSTRY AND THE\nSHAKEUP, CHAIR POWELL CALLING FOR BETTER REGULATION. MATT:\nVOLATILITY CONTINUING TO GRIP GLOBAL MARKETS. WE WILL TALK TO THEM ABOUT\nSTRATEGY. KAILEY: ",
        "1": "YOU SAID IT IT IS TIME TO\nBOUNCE BACK. I WANT TO CHECK ON THE MARKETS,\nBITCOIN DOWN ABOUT .1% ON THE DAY AFTER BEING WELL ABOVE\n$20,000. IT IS NOW BACK DOWN ABOVE\n19,000. IT'S ABOUT .3%, DOWN ABOUT 6.2%.\nTHERE WILL BE A BATTLE. WE SEE BROADER EQUITIES ROLLING\nOVER. IN THE CRYPTO EXCHANGE, DOWN.\nMATT: CRYPTO IS ON THE RADAR OF ALL\nOF WALL STREET LEADERS, THE THREAT OF SERIOUS COMPETITION.\nEVEN AS WE MUDDLE THROUGH THE CRYPTO WINTER, SOME CRYPTO\nFIRMS ARE GETTING INTO TRADITIONAL FINANCE. ",
        "2": "KAILEY: START -- THE INDUSTRY IS\nSTARTING TO ANNOUNCE MORE BUSINESS VENTURES.\nTAKE THE NASDAQ CEO, THE FIRST MAJOR PUSH IN CRYPTO. KKR TEAMED UP WITH LABS AND\nSECURE SYSTEMS TO PROVIDE ACCESS TO ONE OTHER SIDE. IT WAS ONLY ONE OF THE MANY\nSUCH VENTURES FOR THAT EXCHANGE. CRYPTO PROGRAMS ARE ALSO\nWARMING UP TO TRADITIONAL FINANCE IN A BIGGER WAY.\nTHIS IS ONE EXAMPLE. THEY HAD BEEN BUSY BUYING UP\nASSETS AND STRUGGLING CRYPTOCURRENCIES -- CRYPTO\nCOMPANIES, BUT THE FIRM HAS RECENTLY BEEN MAKING WAGERS IN\nAREAS THAT ALSO GIVE IT MORE ACCESS TO TRADITIONAL FINANCE.\nANTHONY TOLD US HIS SKY BRIDGE ",
        "3": "WOULD BE ABLE TO HELP EXPOSE\nSTX TOMORROW -- TWO. KIDS WERE PICKING ON BOTH\nDIGITAL ASSETS AND FOREIGN EXCHANGE.\nCLEARLY THEY ARE THINKING ABOUT WAYS THAT TWO WORLDS CONVERGE.\nTHE FTX PRESIDENT HAS BEEN A BIG PART OF THAT BRIDGE WITH TRIED BY -- TRY FIVE -- TRAD FI.\nHE IS STAYING IN THE INDUSTRY WITH FOOD COLA FOR MOVING\nTECHNOLOGICAL BARRIERS, THE MATURATION OF GLOBAL CRYPTO\nMARKETS BOTH CENTRALIZED AND DECENTRALIZED. KAILEY: SONALI BASAK, THANK YOU FOR THE\nGREAT BREAKDOWN. LET'S GET TO THE MAN HIMSELF,\nFOUNDER AND CEO OF FTX JOINING US FROM THE BAHAMAS FOR AN\nINTERVIEW. ",
        "4": "SAM, THANK YOU FOR JOINING US,\nGREAT TO HAVE YOU. LET'S GET STARTED ON THE NEWS\nOF THE DAY AND THE DEPARTURE OF HARRISON.\nHOW LONG HAS THIS BEEN IN THE WORKS AND WHERE DOES IT LEAVE\nFTX U.S.? SAM: YEAH, SOMETHING HAS BEEN IN THE\nWORKS FOR A LITTLE WHILE. AND EXCITED ABOUT OUR NEW LEADERSHIP AND IT IS IMPORTANT\nTHAT -- AND I'M EXCITED ABOUT OUR\nUPGRADING OUR MIAMI HEADQUARTERS. MATT: DO YOU THINK YOUR EVALUATION,\nTHEY SAID YOU ARE LOOKING TO RAISE ANOTHER BILLION DOLLARS.\nORLANDO BRAVO SAID HE IS WILLING TO INVEST FURTHER. DOES THIS AFFECT STILL LEVEL\nINVESTORS ARE WILLING TO PUT MONEY IN? SAM:\nIN WHICH DIRECTION? MATT: DOWN. ",
        "5": "AFTER THE CRASH OF BITCOIN AND\nTHAN THIS, IT MAY MAKE INVESTORS SKITTISH. SAM: HONESTLY THAT IS UP TO THEM TO\nDECIDE, I WOULD BE SURPRISED IF THAT IS WHAT THEY THINK. KAILEY:\nIF WE CAN TALK ABOUT SUCCESSION MORE BROADLY, HARRISON IS NOT\nTHE ONLY NOTEWORTHY ONE WE HAVE SEEN AT CRYPTO FIRMS. THE\nSOFTBANK CEO, OBVIOUSLY A BANKRUPTCY ISSUE THERE.\nBUT JESSE AT CRACKING. THERE HAS BEEN A STRING OF\nDEPARTURES. ARE YOU THINKING OF HOW LONG\nYOU PLAN TO STAY AT THE HELM AND WHO WILL TAKE YOUR PLACE\nWHEN THE DAY COMES? SAM: I'M GOING TO BE HERE FOR THE\nLONG-TERM. THAT IS NOT ON MY HORIZON.\nI WOULD NOT BE SPENDING ALL OF MY ENERGY LOOKING AT THE\nSUCCESSION IF IT IS NOT COMING INTO EFFECT. MATT:\nWHAT ABOUT THE VALUATION OF ",
        "6": "THE COMMITTEE?\nSINCE JANUARY, YOU HAVE GROWN. YOU HAVE A BIGGER FOOTPRINT.\nARGUABLY THE MOST IMPORTANT PERSON AND COMPANY IN CRYPTO\nRIGHT NOW. ON THE OTHER HAND, THE\nUNDERLYING ASSETS HAVE COME DOWN IN VALUE.\nIN JANUARY WE WERE ALREADY LOOKING AT 45,000, 35,000.\nBUT NOW WE ARE LOOKING AT 20 AND SOMETIMES LEARNING WHAT 17\nHANDLES. SAM: IT IS A GOOD QUESTION.\nI AGREE WITH YOUR TAKE THAT WE HAVE SEEN A LOT OF GREAT NEWS\n-- GREATNESS WITH THE COMPANY AND WHAT WE CAN DO.\nUSING THE GLOBAL RISK ASSETS ALOFT THE DOLLAR -- I DON'T\nKNOW. ULTIMATELY YOU COULD IMAGINE --\nOBVIOUSLY I WILL DO WHAT THE MARKET SAYS. KAILEY:\nAND AS HE ALLUDED TO, THE MARKET HAS BEEN DIFFICULT.\nHOW MUCH HARDER HAS THAT MADE ",
        "7": "YOUR FUNDRAISING EFFORTS? SAM:\nIT IS ONLY THE CASE THAT VENTURE CAPITAL IS WAITING MORE\nPASSIVE RIGHT NOW. YOU GO BACK A YEAR AGO AND\nTHERE WAS MORE MONEY LOOKING TO BE DEPLOYED BY VENTURE\nCAPITALISTS. IT WAS A BIT OF A FREE-FOR-ALL. AND THERE WAS A LOT OF\nDETERMINATION TO GET THEM TO INVEST IN.\nYOU LOOK AT THE ENVIRONMENT TODAY. THERE IS NOT A LOT REALLY\nANYWHERE IN THE FINANCIAL SYSTEM.\nNOT SO MUCH BECAUSE OF THIS ITSELF BUT BECAUSE THE LAW OF\nUNCERTAINTY, WHICH DIRECTION YOU'RE GOING TO BE GOING IN AND\nWHERE THEY ARE GOING TO HEAD WITH POLICY.\nTHE FED CAN'T TAKE OUT SPENDING BILLS.\nTHAT CERTAINLY HAS SLOWED DOWN GENERAL INVESTMENT MARKETS\nQUITE A BIT. MATT: ",
        "8": "YOU TOLD OUR DAVID RUBENSTEIN\nTHAT YOU HAVE MIXED RESULTS IN TERMS OF THE ACQUISITION YOU\nHAVE DONE. PEOPLE SAW U.S. THROWING A LIFELINE TO THE\nINDUSTRIES ARE NOW YOU ARE NOT NECESSARILY TRYING TO MAKE HUGE\nPROFITS. YOU SAID YOUR MANDATE WAS TO\nYOUR TEAM. HOW DO YOU THINK YOU HAVE FARED\nNOW, AND ESPECIALLY CONSIDERING THE SITUATION WITH VOYAGER,\nPICKING UP THOSE ASSETS, CAN YOU DO THE TALLY ON THE BACK OF\nYOUR NECK, HOW HAVE YOU FAIRED? SAM: IT IS A GOOD QUESTION. THAT IS BEEN OUR THINK MY TO DO\nOK DEALS, TO DO DEALS WE FEEL OK WITH. AND TO INDICATE THAT THE\nCUSTOMERS, -- RATHER THAN LEAVING THEM IN LIMBO FOR A\nWHILE. WE ARE DOING IT AND MORE ",
        "9": "IMPORTANTLY I THINK WE\nHOPEFULLY WILL BE GIVING RESOLUTIONS AND THAT IS THE\nBIGGEST PIECE OF IT. RATHER THAN SEEING THIS\nPRIMARILY AS AN OPPORTUNITY. KAILEY:\nNOW THAT YOU HAVE THE OPTION FOR THE VOYAGER ASSET, THERE\nARE MORE TENTACLES BEING THREADED THROUGH THE\nCRYPTOSYSTEM AS A WHOLE. ARE YOU WORRIED THIS IS GOING\nTO INTENSIFY THE CRITICISM THAT NOW YOU HAVE TOO MUCH INFLUENCE\nOVER THIS INDUSTRY? SAM: I MEAN I WOULD LOVE IT.\nIF SOMEONE ELSE WANTS TO DO IT, BE MY GUEST. BUT IT HAS NOT\nULTIMATELY ENDED IN THE WAY THAT I THINK WE LIKE.\nMY GOAL IS NOT TO BE MONOPOLIZING. MY GOAL IS TO MAKE SURE\nCUSTOMERS ARE PROTECTED AND TO MAKE SURE THEY ARE LEAVING THAT\nIN PLACE TO COMPLEMENT THAT. ",
        "10": "I ALSO THINK IT IS NOT\nREPRESENT THESE FUNDAMENTALS, THEIR GROWTH AND THE TYPE OF\nTHINGS THAT WE DO AS A BUSINESS. THIS IS VERY MUCH IN LINE WITH\nPRODUCTS THAT WE OFFER. I ALSO THINK IT IS NOT A HUGE\nSHIFT. ESPECIALLY GIVEN THE STATE OF\nVOYAGER RIGHT NOW. MATT: THOSE PRODUCTS ARE GOING TO\nCHANGE AND AT LEAST NOW YOU ARE INVESTED IN SKYBRIDGE.\nSONALI WAS JUST GIVING US AN EXCELLENT BREAKDOWN OF THE\nDIFFERENTIATION BETWEEN TRAD FI AND DEFI.\nTHOSE SEEM TO BE COMING BACK AS WELL.\nIS THAT WHAT YOU WANT TO DO WITH SKYBRIDGE?\nTHEY HAVE A BIG PORTFOLIO OF TRADITIONAL FINANCE PRODUCTS,\nFUNDRAISING, IS THAT WHITE GOING? -- WHY YOU GO IN? SAM:\nDOESN'T HAVE A LOT TO DO WITH ",
        "11": "IT. WHERE'S -- WE ARE EXCITED TO\nWORK WITH THOSE. THERE'S A LOT TO OFFER PERSONAL\nFINANCE WHEN WE LOOK AT THESE SETTLEMENT ISSUES THAT WE HAVE\nSEEN IN THE SYSTEM. I THINK COMBINING TOGETHER A LOT OF THE TECHNOLOGY AGAINST\nCRYPTO , WE CAN SEE A PROMISING FUTURE. KAILEY: THAT TALKS ABOUT BUYING INTO\nTHINGS, I WONDER IF THERE IS ANYTHING ELSE YOU ARE LOOKING\nTO BUY INTO AND HOW MUCH POWDER YOU HAVE LEFT TO DO ANY DEAL\nGIVING ALL THE DEALS YOU HAVE BEEN WORKING. SAM:\nYEAH, WE TRY TO BE JUDICIOUS WITH THE DEALS WE ARE DOING.\nOBVIOUSLY THAT IS NOT GOING TO BE PERFECT AND WE HAVE\nOBVIOUSLY MADE SUCCESSES THROUGH THAT.\nBUT WE HAVE NOT USED THE MAJORITY OF THE CASH THAT WE\nHAVE ON OUR BALANCE SHEET. THAT IS NOT NECESSARILY TO SAY\nTHERE ARE OTHER THINGS THERE. ",
        "12": "WE WANT TO BE IN A POSITION\nWHERE WE ARE LOOKING FORWARD AT WHAT WE CAN BE DOING, WHERE WE\nCAN BE MOST HELPFUL. I THINK HOW I WOULD DESCRIBE IT RIGHT NOW IS -- I DON'T KNOW AT\nWHAT POINT NECESSARILY IT WILL BE. BUT WE ARE POKING AROUND.\nMATT: IT REMINDS ME OF ONE OF THE\nOTHER THINGS THEY SAID. HE THINKS A LOT OF PEOPLE IN\nTHE INDUSTRY ARE DISTURBING IN TERMS OF LACK OF TRANSPARENCY.\nYOU ARE NOT ONE OF THOSE PEOPLE. HE IS WILLING TO INVEST IN YOU\nAGAIN. I MUCH CASH IS ON YOUR BALANCE\nSHEET? HOW MUCH ARE YOU BURNING THROUGH? SAM:\nIT IS A GOOD QUESTION. PEOPLE EXPECT THAT WE WILL DO\nTHAT THIS YEAR AS WELL. ",
        "13": "ALL THINGS CONSIDERED, A COUPLE\nBILLION DOLLARS LAST YEAR. WE HAVE DONE A NUMBER OF\nACQUISITIONS AND GENERATED FREE CASH FLOW JUST WITH REVENUE.\nWHEN YOU KIND OF TRY AND COMBINE ALL THOSE TOGETHER AT THE END OF THE DAY, YOU ARE\nLEFT WITH UPWARDS OF A BILLION DOLLARS.\nTHERE ARE ISSUES HERE IT WAS HER OVERSELLING OUR REGULATORY\nASSETS. IT'S NOT EXACTLY WHAT DURATION\nNUMBER TO TALK ABOUT IS. BUT IDEALLY WE WILL STILL HAVE\nTHEM. KAILEY: YOU SAID REGULATORY.\nI DO WANT TO TALK ABOUT REGULATION NOW. IN THE LAST 24 OR 48 HOURS OR\nSO, INCLUDING NEW YORK ATTORNEY GENERAL, THEY ARE ACCUSING SO\n-- ACCUSING A COMPANY OF -- AND ",
        "14": "TIED TO DO UPON THEIR SEEKING\n-- AND TIED TO SOME OF THEIR SEEKING TO ARREST. WE ALSO HAVE\nPAST CONFUSION IN THE U.K. AND WE HEAR FROM THE CHAIRMAN\nOF THE FEDERAL RESERVE EARLIER TODAY TALKING ABOUT THE NEED\nFOR MORE CRYPTO OVERSIGHT. TAKE A LISTEN TO WHAT HE SAID. >> THERE IS A REAL NEED FOR\nMORE FRONT RATE REGULATION SO THAT AS DEFI EXPENSE INSERTS A\nTOUCH MORE RETAIL CUSTOMERS, SO THAT APPROPRIATE REGULATION IS\nIN PLACE. KAILEY: SOME MORE REGULATION IS NEEDED\nBUT YOU KNOW THAT. THAT IS SOMETHING YOU HAVE BEEN\nWORKING ON FOR SOME TIME. DO YOU FEEL WE ARE GETTING\nCLOSER TO SOME REAL FRAMEWORK OR AN ORGANIZED JURISDICTION WHAT THE CFTC AND SEC CONTROL\n-- FTC CONTROL SEPARATELY? SAM: I DO THINK WE HAVE MADE\nPROGRESS. YOU LOOK AT WHERE WE WERE A\nYEAR AGO WITH VERY LITTLE GOING ",
        "15": "ON ON THE REGULATORY SIDE, YOU\nLOOK TODAY WHERE THERE ARE PROPOSALS IN CONGRESS TO\nPROVIDE THESE ASSETS OR THE SEC HAD THE CFTC ARE WORKING ON\nTHIS. WE HAD LIFE INSURANCE AND WITH\nTHE FTC, IT IS A WORLD OF DIFFERENCE.\nI THINK THAT IS EXCITING. I AGREE THERE NEEDS TO BE CLEAR\nFEDERAL OVERSIGHT THERE TO REALLY PROTECT CONSUMERS AND AT\nTHE SAME TIME, VARIABLE TO PROVIDE CLARITY FOR THE\nINDUSTRY TO OPERATE IN THE COUNTRY. MATT: YOU HAVE BEEN VERY ACTIVE IN\nWASHINGTON, FAMOUSLY DOING LOBBYING FOR THE INDUSTRY.\nWHAT ABOUT OVERSEAS? THE FTA PUBLISHED A WARNING,\nTARGETING CONSUMERS THERE. ",
        "16": "OTHER FIRMS, ONE HAS GOTTEN IN\nTROUBLE FOR COMING THIS DIRECTION.\nIS IT HARD TO DO BUSINESS GLOBALLY?\nYOU'VE ALREADY BEEN TO THE BAHAMAS. SAM:\nYEAH, THERE ARE A LOT OF JURISDICTIONS AND WE TRY TO\nREMAIN -- MAINTAIN RELATIONSHIPS EVERYWHERE.\nTHE U.K., WE HAVE GOOD RELATIONSHIPS.\nWE BELIEVE THAT WE ARE OPERATING RESPONSIBLY THERE AND\nWE ARE GOING BACK AND FORTH ON DETAILS.\nBUT IT IS A BIG PRODUCTION. TO BE DOING ALL OF THIS IN A\nNUMBER OF JURISDICTIONS. WE WOULD LOVE TO SEE A WORLD\nHYPOTHETICALLY WHERE THERE ARE MORE BETWEEN JURISDICTIONS,\nSOMETHING THAT LOOKS MORE LIKE A GLOBAL JOINT REGULATORY\nREGIME INSTEAD OF A COUNTRY BY COUNTRY ONE.\nI JUST THINK WE NEED TIME BEFORE WE GET THERE AND WE KEEP\nPLUGGING ALONG ON ALL FRONTS IN THE MEANTIME. KAILEY:\nYOU SAID YOU ARE LOOKING AT ",
        "17": "LICENSING IN THE U.K..\nHOW MUCH ARE YOU PLANNING TO INVEST IN YOUR BUSINESS THERE?\nSAM: NOT TO REVEAL EXACTLY WHAT WE\nARE DOING BUT IN GENERAL WE ARE LOOKING AT COMPREHENSIVE\nLICENSURE. WE ARE LOOKING AT SOMETHING --\nSO WE WOULD BE ABLE TO BE REALLY COMPETITIVE. MATT: I WOULD LIKE TO BE IN THE\nBAHAMAS ALSO. I GET WHY YOU ARE THERE\nREGULATORY EARLY AND THE WEATHER IS NICE AND PLACES\nSHELL. -- PLACE IS CHILL. WHAT YOU SAID IN YOUR TWEET\nTODAY THAT HE IS GOING TO BE AT YOUR MIAMI HQ AND THAT GOT A\nLOT OF RESPONSES FROM CRYPTO TWITTER. WHY DON'T YOU MOVE YOUR\nHEADQUARTERS INTO THE U.S. AND MIAMI?\nIT'S LIKE THE CAPITAL OF BITCOIN HERE. SAM:\nIT IS A GOOD QUESTION HERE. ",
        "18": "WOULD YOU HAVE SOME HERE.\nWE HAVE TO HAVE DIFFERENT OPERATIONS IN DIFFERENT\nJURISDICTIONS. WE ARE GOING TO HAVE TO HAVE\nSOME IN JAPAN, SO PART OF THE ANSWER, THE BORING PART OF THE\nANSWER IS THAT WE ARE GOING TO HAVE TO HAVE PLACES ALL OF THE\nPLACE AND OFFICES ALL OVER THE PLACE AND OVER -- IN ORDER TO\nBE A GLOBAL BUSINESS. WHAT KIND OF THINGS WE CAN AND\nCAN OFFER TO OUR U.S. ENTITY, ON THAT FRONT I THINK\nWE ARE ACTIVELY TRYING TO LOOK AT THIS.\nTHE BIGGEST THINGS WE ARE LOOKING AT ARE BASICALLY WHAT\nIS A SPOT REGIME. WE LOVED HAVING A FEDERALLY\nRACHEL--UTTERLY REGULATED -- FEDERALLY REGULATED SPOT REGIME.\nTHERE ARE A FEW OTHER PIECES IN ",
        "19": "GENERAL. FOR US, HAVING A CLEAR LICENSURE FROM A MARKET BASIS\nIS WHAT WE HAVE BEEN FOCUSING ON. KAILEY:\nTHERE ARE SO MUCH TO TALK ABOUT, I WISH WE HAD ALL DAY\nBUT WE ONLY HAVE ABOUT A MINUTE LEFT.\nON A HIGH LEVEL PRICING NOTE, BITCOIN HAS BENTLEY WISHING IN\nTHE $20,000 RANGE FOR MONTHS NOW.\nDO YOU THINK THE BOTTOM IS IN AND WHERE DO YOU THINK IT CAN\nGET BY THE END OF THE YEAR? SAM: YEAH, IT IS A GOOD QUESTION. I THINK IT IS THE DOLLAR WHO\nMOVED EVERYTHING AGAINST CRYPTO. THAT IS THE BORING PART OF THE\nANSWER. BUT MAYBE A MORE INTERESTING,\nHOPEFULLY MORE INTERESTING ONE, ",
        "20": "I WOULD SAY IS THAT I THINK\nGETTING REGULATORY CLARITY AND FEDERAL OVERSIGHT IN THE UNITED\nSTATES WOULD BE HUGE FOR THE SHOW OF OPTIONS IN CRYPTO. THAT IS PROBABLY THE BIGGEST\nTHING I HOPE WAS ON THE HORIZON. AND MORE FOCUS ON THESE CASES,\nTHAT HAS ALWAYS BEEN HUGE. IT IS SOMETHING THEY ALWAYS\nSHOULD BE FOCUSING ON MORE THAN IT IS. THAT IS THE OTHER PIECE OF THIS\nTHAT I AM EXCITED TO SEE PLAY OUT. MATT:\nWE APPRECIATE IT, WE KNOW YOU ARE SUPER BUSY. SAM BECKMAN FREED -- BANK MEN\n-- BANKMAN-FRIED. KAILEY:\nWE WILL GO AHEAD WITH KATIE STOCKTON. MATT:\nACCESS ALL OF THE LATEST DATA AND NEWS ON CRYPTO ON THE\nBLOOMBERG TERMINAL. THIS IS BLOOMBERG. ",
        "21": "KAILEY:\nTHIS IS BLOOMBERG CRYPTO, I'M KAILEY LEINZ WITH MATT MILLER.\nBITCOIN CLIMBS FOR A SECOND DAY, WITHSTANDING A STRONGER\nDOLLAR. IT IS STARTING TO GIVE UP SOME\nGAINS. IT HAS WORLD OVER. LET'S LOOK AT WHERE WE WE MAY\nBE HEADING. JOINING US IS KATIE STOCKTON,\nFOUNDER AND MANAGING PARTNER OF FAIRLY STRATEGY. KATIE:\nWE HAVE SHORT-TERM OVERSOLD UPTURNS.\nWE HAVE A LEVEL OF RESPONSE THIS MORNING THAT WE, IN TERMS\nOF SHORT-TERM READINGS THAT BECAME VERY PREVALENT LAST\nWEEK, AND FOR BITCOIN IN PARTICULAR IT WAS STABILIZATION.\nAND IT SHORT-TERM DOWNSIDE ",
        "22": "MOMENTUM, FAR FROM THE POSITIVE\nMOMENTUM AT THIS TIME. BUT WE ARE TALKING ABOUT\nSEVERAL DAYS, MAYBE, NOT SEVERAL WEEKS.\nTHAT WOULD PROBABLY BE WELCOME RELIEF NOT JUST FOR BITCOIN BUT\nRISK ASSETS MORE BROADLY. IT IS STILL VERY HIGH BETWEEN\nCORN AND THE NASDAQ 100 INDEX. WE CONTINUE TO WATCH BOTH\nTOGETHER. MATT: I'M LOOKING AT EITHER CHART AS\nWELL. BOTH HAVE ROLLED OVER HARD IN\nTHE LAST 20 OR 30 MINUTES. DO YOU KNOW WHY WE ARE SEEING\nTHAT? I'M LOOKING AT EITHER, 13.21\nAND IT WAS BOUNCING UP ON 1400. KATIE:\nTHIS SAME THING WAS HAPPENING IN THE MARKET TODAY AND IF\nTHERE ARE ANY NUMBERS MORE BRIEFLY WITH MACRO OR EVEN IF\nIT IS NOT TECHNICAL, BUT IN TERMS OF THIS ACTION IT FEELS\nLIKE NOISE TO ME. ",
        "23": "WE DID NOTICE THE S&P 500 WAS\nWIDELY WATCHED, 36.36. THAT CONTRIBUTED.\nI THINK WE HAVE TO BE MINDFUL OF THE SUPPORT IN GENERAL. THERE IS LONG-TERM SUPPORT\nBETWEEN THEM, THIS IS OBVIOUSLY IN PLAY.\nAND JUST TAKING OUT DEFENSIVELY THAT WE HAVE A SIGNIFICANT\nBREAKDOWN, IT EVENS OUT FOR 14,000 FOR BITCOIN.\nWE MOVED TO A SHORT-TERM NEUTRAL BIAS WITHIN THE CONTEXT\nTHAT THERE IS INTERMEDIATE AND LONGER-TERM BIAS.\nTHEY ARE POINTING NEUTRAL TO LOWER, SO AT THIS TIME THEY\nHAVE NOT SEEN ANY MEANINGFUL IMPROVEMENT.\nWE MIGHT GET A LITTLE IMPROVEMENT BUT RESISTANCE IS\nLOOMING CLOSE BY AROUND 20,000 ",
        "24": "AND THAT IS BASED ON ONE OF OUR\nMODELS CALLED THE CLOUD MODEL. IT IS GREAT FOR ANALYZING IT.\nKAILEY: WE ONLY HAVE ABOUT 30 SECONDS\nLEFT. WHAT CORRELATION ARE YOU WATCHING, CRYPTO AND EQUITIES,\nBONDS, THE DOLLAR? KATIE: IT IS REALLY ANYTHING WITH A\nGROOVY ELEMENT -- G ROWTHY ELEMENT.\nTHERE ARE A LOT OF MINOR TREND SIGNALS THAT SUGGESTS WE WILL\nGET SOME CONSOLIDATION IN THESE METRICS LIKE TREASURY YIELDS.\nTHAT IS WHAT WE ARE LOOKING FOR NEAR-TERM, A TEMPORARY RESIDENT\n-- RESPITE THAT COULD DRAW AN UPSIDE AND YIELDS ENDED\nDOWNSIDE OF EQUITIES. KAILEY: THANK YOU SO MUCH FOR JOINING\nUS, KATIE STOCKTON OF FAIRLEAD STRATEGIES. MATT:\nCOMING UP, THE FORMER CEO "
    }
}