{
    "metadata": {
        "video_id": "ANYUFisRrF8",
        "title": "FTX Founder Sam Bankman-Fried on the Crypto Exchange's Collapse | WSJ",
        "link": "https://www.youtube.com/watch?v=ANYUFisRrF8",
        "duration": "11:29",
        "channel_name": "The Wall Street Journal"
    },
    "transcript": {
        "0": "- I think that what a lot of\npeople are struggling with here is that, you know, you\nwere an MIT physics major. - Yep. - You are, by all\naccounts, a very smart guy. How is it possible that\nyou overlooked this more than $5 billion problem? - I ask myself a lot how I\nmade a series of mistakes that seem, they don't just seem dumb, they seem like the type of\nmistakes I could see myself having ridiculed someone\nelse for having maked, the kind of mistakes that I\nwould've considered myself to have been above. (tense music) - As we've learned about what happened over the past few weeks, we've learned that there\nwere some issues involving where customer funds were put for FTX and some accounting issues. Can you walk us through what\nthe problem was on that side? - Right, you rewind to 2019, 2020. FTX didn't have bank accounts,\nand that was because as ",
        "1": "a global crypto exchange at the time, almost none of them were able to get, you know, global banking. Some customers still wanted to onboard fiat currencies though. You know, FTX was maintaining\ncryptocurrency wallets but not banking accounts,\nand so some of them would wire money to Alameda and then asked to be credited on their FTX account. (tense music) - How much of this\ncustomer money was wired to the Alameda bank accounts? - I don't have the numbers in front of me but my estimation is,\nI think more than half. - More than half. - More than half of\nAlameda's total position came via that method. - So how many billions of\ndollars are we talking about, at least ballpark? - I think north of five. - And so this was actually\nUS dollars that people, customers transferred to\nAlameda bank accounts. ",
        "2": "- Yeah. - And they were credited for it on FTX. - Yeah, that's right. - So more than $5 billion were transferred into these Alameda bank accounts. - Yep. - It was then credited\nso that customers saw that they had that balance on their screens.\n- [Sam] Yep. - What actually happened to the dollars sitting in those bank accounts? - One phrasing of it one\ncould use would be to say that Alameda effectively\nsent those dollars from its FTX account to the user, but that's a ledger transfer of course. Outside of that, the answer\nis they were wired to Alameda. I can only speculate about\nwhat happened after that. - So you don't know what\nhappened to those $5 billion? - They were, I mean, they\nwere wired to Alameda. I wasn't running Alameda,\nbut I can now go back and take a guess at what, you know, where they were ultimately\nspent or used or something, but dollars are fungible with\neach other, and so it's not like this $1 bill over here\nthat you can trace through ",
        "3": "from start to finish. What you get is more just omnibus pots of assets of various forms. (tense music) - Was there double counting going on? - There was not double\ncounting from FTX financials. FTX financials were correctly,\neffectively debiting this amount from total\ncustomer balances on FTX. - So let's say Bob wires $100 to one of these Alameda bank accounts. Bob checks his FTX screen. FTX has credited his account. - [Sam] That's right. - That says he's got $100. - Yep. - But behind the scenes, Alameda goes and does something with that money. - Yeah, Alameda has negative\none, was it $100 that? - $100, yeah. - Yeah, yeah. You know, Alameda then should\nhave negative $100 on FTX, right, because effectively,\nor at least that would be one way to mechanic this,\nright, would be Bob sends ",
        "4": "to Alameda over here off of\nFTX through wire transfer, then on FTX, Alameda sends to Bob, but the whole key there\nis you need to keep track of that negative Alameda\npiece, of the fact that Alameda is crediting other people. Thus, that should be\ndebiting from the funds that they have on FTX. - So this problem developed\nin which $5 billion, more than $5 billion of user\nfunds was sent to Alameda and it was not properly\nseen in the systems. It made Alameda's position seem larger. - Less larger than it was. - You only became aware at\nthe beginning of November. - I don't remember the exact date, but it is somewhere around there, yeah. I was surprised at what happened when you added those numbers together. I don't know exactly when\nthat notion became so large, that wire transfer piece. I think it was surprisingly recently, given that it was, because this was a sort of legacy system, right? We transitioned away from\nthis system over time, ",
        "5": "but I think that some\npeople just kept wiring to Alameda anyway, even\nafter we had built out our own payment networks\nand removed any traces of that old pathway, and\nso I think it was maybe surprisingly recently that a\nlot of that happened as well. - Was Alameda using this money\nthat came in to that account as part of its collateral on FTX? - I don't, not to my\nknowledge, but I'm not sure. - But that is possible that\nthat was how it was being used. - I don't know what they,\nyou know, what they did with which pieces of assets\nand given that dollars are fungible with each\nother at the end of the day, I'm not sure it's even\nwell defined to talk about whether it was those\ndollars or other dollars that were sent somewhere. - But if a dollar went in. - Yep. - To one of those Alameda bank accounts. - Yep. - Then it would've become\npart of the customer's margin position and part of\nAlameda's margin position. ",
        "6": "- It would've, if it had gone\nto an Alameda bank account then it would become part\nof the customer's collateral on FTX, right, and it would've increased Alameda's margin position\non FTX effectively. (tense music) - I wanted to ask about FTX terms of use. - Yep. - They say that you\ncontrol the digital assets held in your account. They can't be loaned out,\nexcept there's also another part of the terms of use that\ntalk about margin trading. - Yep. - In which there is\nactually language that says, your money could be loaned out. - Right. - And it could disappear if\nsomebody's trading goes bad. - Right. - On FTX, did you have to\nopt in to do margin trading? - So for the peer-to-peer borrow lending order book, you did, yes. - How many people and how much\nmoney was actually in that? - I don't know exactly\noff the top of my head. ",
        "7": "I think it was, I wanna say, eight or $10 billion at the peak. I don't know what it is today. - Were you sweeping\npeople into margin trading and allowing their\ncollateral to be loaned out? - I honestly, off the top of\nmy head, I don't know exactly what procedures we used to\ndetermine whether an account was, you know, doing margin trading or, I do remember, you know, a way\nthat people could have opted into it, but I don't know\noff the top of my head. - Was there a violation\nof the terms of use? - I don't know of a violation\nof the terms of use. I don't know every line\nof the terms of use. I can't confidently say there wasn't, but I don't know of one. (tense music) - In some of the court\nfilings, the new head of FTX ",
        "8": "has said that there was a\nsecret exemption for Alameda from the normal\nauto-liquidation protocols, which some people have called a backdoor. - Right. - Is, can you tell us about\nthis secret exemption? - I don't know exactly what\nwas being referred to there. I have, that has not\nbeen communicated to me beyond the public statements, nor was I consulted or asked on that. So I can only speculate about what was being referred to there. My guess is that that\nmay have been referring to wires sent to Alameda, I'm not sure. I, it may, I, yeah, I can't\nspeculate on exactly what, what he was referring to there. - But could Alameda be auto-liquidated like any other customer? - I don't, again have access\nto all this right now. I believe that there was a\nsystem in place that I think Alameda and some other accounts were using ",
        "9": "which did have some liquidation policies, but which were specific\nfor larger positions. I actually don't know the details of that. These were things that I\nthink like, account managers and legal were working out\ntogether over the last year and I was not deeply\ninvolved in that process. I do think that the larger\naccounts did have some amount of you know, extra margin\ncapacity in some cases. - So Alameda could take on riskier trades than other FTX customers? - I'm not sure, but I think\nthere may have been cases where at least they could\ntake on larger positions. - How is it that as a\n90% owner of the firm and founder of the firm who\nwas close with the leadership, you didn't know what was going on? - The thing is, I was busy. I was, you know, FTX was a full-time job. It was more than a full-time\njob and I didn't have enough brain cycles left\nto understand everything going on at Alameda if I wanted to. I also didn't want to\nbecause I was concerned ",
        "10": "about conflicts of interest\nand I felt like it would be inappropriate for me to\nbe, you know, looped into, you know, certainly to details\nof what was going on there. It caused me to not dig in\nvery much, to not try to engage very much on what Alameda was doing. It was a huge oversight,\nobviously, but, you know, the honest answer is, I mean,\nobviously I should have been. - Sam, what you've described sounds at a minimum like gross negligence. Obviously there are a lot of people there who think that you\ncommitted outright fraud. Do you expect to go to prison? - I'm not focusing on that right now. I don't think I, you know, tried to commit fraud anywhere here. I was trying to do the best I could. Obviously that wasn't nearly\nas good as I thought it was, but honestly it's not what\nI'm focusing on right now. ",
        "11": "I don't, this is about the\ncustomers at the end of the day. Like that's, there's one of me. There are millions of them,\nand I don't think it's right for me to be focusing on\nwhat happens to me here. I think I should be focusing on what can be done for customers. "
    }
}