{
    "metadata": {
        "video_id": "uGZrZq6z-Ig",
        "title": "FTX still has $1 billion to deploy, says CEO Sam Bankman-Fried",
        "link": "https://www.youtube.com/watch?v=uGZrZq6z-Ig",
        "duration": "5:28",
        "channel_name": "CNBC Television"
    },
    "transcript": {
        "0": "GOOGLE FREE. >> FOR NOTHING.  >> EITHER/OR >> TALKING ABOUT CRYPTO, MAYBE OTHER THINGS, LET'S TALK ABOUT WHAT'S GOING ON WITH SAM BANKMAN-FRIED. HE IS NOW WORTH AN ESTIMATED $11 BILLION. HE COULD HAVE BOUGHT THAT JORDAN JERSEY IF HE WANTED TO THE EXCHANGE IS WORTH $32  BILLION. IT BROUGHT IN ABOUT $1 BILLION REVENUE LAST YEAR. CNBC'S KATE ROONEY HAS MORE ON THE CEO'S RISE IN THE CRYPTO INDUSTRY THEY CALL HIM THE JPMORGAN OF  CRYPTO.  >> Reporter: THE MICHAEL JORDAN  OF CRYPTO. SAM BANKMAN-FRIED HAS PLAYED A BIG ROLE IN THE CRYPTO INDUSTRY. JUST THE ROLE THIS YEAR, ANDREW, HE SPENT HUNDREDS OF MILLIONS OF DOLLARS TO BAIL OUT STRUGGLING COMPANIES FACING BANKRUPTCY, LIQUIDITY, YOU NAME IT HE'S GOT A RELATIVELY  UNDERSTATED LIFE ",
        "1": "HE DRIVES A TOYOTA CAROLLA HE LIVES WITH TEN ROOMMATES. SOMETIMES SLEEPS UNDER HIS DESK  ON A BEAN BAG CHAIR AS WELL. I SAT DOWN WITH BANKMAN-FRIED TO TALK ABOUT HIS ROLE AS LENDER OF LAST RESORT. >> WE ONLY HAD A FEW DAYS TO MAKE THESE DECISIONS WHAT WE CAME TO BELIEVE WAS THE  FOLLOWING, THE FIRST WAS THAT IF POSSIBLE IT WOULD BE EXTREMELY VALUABLE TO THE ECOSYSTEM TO BACK STOP SOME OF THESE PLACES FIRST OFF BACKSTOPPING CUSTOMERS AND MAKING SURE THEY'RE OKAY STOPPING THE CONTAGION ANYONE THAT TRANS SITIVELILY DID BUSINESS WITH ANY CHAIN OF PEOPLE WHO DID BUSINESS WITH ONE OF THE TROUBLED ASSETS THEMSELVES BECAME TROUBLED THEN THE SECONDARY GOAL WAS  MAYBE THERE ARE GOOD TRADES. MAYBE THERE'S AN INVESTMENT OR ACQUISITION THAT CAN BE DONE AT  TERMS WE WOULD BE EXCITED ABOUT  ",
        "2": "GIVEN THE SORT OF NEED FOR CAPITAL RIGHT NOW. BUT THAT WAS USUALLY NOT THE STANDARD WE WERE ABLE TO HOLD  OURSELVES TO IN PRACTICE THE STANDARD WAS DO  WE FEEL OKAY ABOUT THIS FROM A FINANCIAL PERSPECTIVE? DOES THIS LOOK AT LEAST  MEDIOCRE NOT A HUGE LOSS. MAYBE GAIN IN EXPECTATION? MAYBE NOT. THAT WAS A BAR WE HAD TO CROSS IN ORDER FOR US TO FEEL  COMFORTABLE, YOU KNOW, INTERVENING THERE. OFTEN WE JUST WEREN'T SURE YOU LOOKED AT A LOT OF THESE CASES, YOU KNOW, FOUR DAYS BEFORE THEY WERE GOING TO FILE BANKRUPTCY AND SO WE HAD FOUR  DAYS TO DO ALL OF THE DILIGENCE  WE COULD ON THE COMPANY, ELEVEN  EVERYTHING ABOUT IT, UNDERSTAND  THE INDUSTRY, THEIR BUSINESS,  THEIR CUSTOMERS, UNDERSTAND HOW  WE THOUGHT THINGS WOULD UNFOLD VOIRGE GER CASE IS SORT OF EXTENDED A TWO-PIECE LINE OF ",
        "3": "CREDIT THE FIRST WAS 70 MILLION NO STRINGS ATTACHED. AND WE KNEW WE MIGHT LOSE THAT THEN THERE'S A LARGER LINE OF  CREDIT WHICH WOULD EVENTUALLY  HAVE PLUGGED OUR BEST GUESS AT THE TIME AS TO WHAT THE COMPLETE HOLE WAS, BUT WHICH HAD  CONDITIONS ON IT IF THERE'S JUST AN IMMEDIATE RUN ON THE BANK HERE AND THE BUSINESS IS GOING BELLY UP AND THERE'S NOTHING WE  CAN DO TO ACTUALLY SAVE THIS,  LIKE WE DON'T WANT TO KEEP GOING THROUGH IT WE MAY LOSE IT I DON'T SEE THAT HAPPENING >> DO YOU STILL HAVE ENOUGH CASH IF YOU NEEDED TO DO ANOTHER  BAILOUT? >> YEAH. YEAH WE DID WE TRY NOT TO EMPTY THE HOPPER SO TO SPEAK. WE HAD A COUPLE BILLION GOING  INTO THIS. IT LINES UP ROUGHLY WITH THE AMOUNT WE'VE RAISED OVER THE LAST YEAR AND ON TOP OF THAT WE  ",
        "4": "HAD BEEN PROFITABLE. >> SO A BILLIONISH TO DEPLOY >> YEAH. YOU HAVE THE ISSUE OF HOW MUCH DO WE FEEL COMFORTABLE IN  DEPLOYING? SAYING THERE'S ANOTHER PART  BILLION. THAT IS SORT OF COMPLETELY UNENCUMBERED CERTAINLY WILL GET YOU WITHIN A  FACTOR OF 2 IS THE RIGHT ANSWER. >> YOU SAID FTX HAS THE  RESPONSIBILITY TO SERIOUSLY  CONSIDER STEPPING IN WHY DID YOU HAVE THAT  RESPONSIBILITY >> IT'S NOT GOOD FOR ANYONE IF WE HAVE REAL PAIN, REAL  BLOWOUTS IT'S NOT FAIR TO CUSTOMERS IT'S NOT GOING TO BE GOOD FOR  REGULATION LIKE IT'S NOT EVEN GOOD FOR  ANYTHING AND SO FROM A LONGER  TERM PERSPECTIVE, IT'S JUST THAT WAS WHAT WAS IMPORTANT FOR THE ECOSYSTEM, IT IS WHAT WAS  IMPORTANT FOR PEOPLE TO OPERATE  IN THE ECO SYSTEM OTHER THAN BE  ",
        "5": "WORRIED IT WILL BLOW UP. >> IT'S TOO SOON TO TELL BANKMAN-FRIED HAS CONTINUED THAT WITH SKYBRIDGE CAPITAL BANKMAN-FRIED SAID FTX IS  PROFITABLE, THEY HAVE 1/10 OF  EMPLOYEES AND THE COMPANY HAS  RAISED "
    }
}