{
    "metadata": {
        "video_id": "2ozjiX1E7ZA",
        "title": "In Conversation With Sam Bankman-Fried",
        "link": "https://www.youtube.com/watch?v=2ozjiX1E7ZA",
        "duration": "20:03",
        "channel_name": "Bloomberg Live"
    },
    "transcript": {
        "0": "Hi I'm Joe Weisenthal and I am here with Sam Brinkman Freed. He\nis the CEO and founder of the crypto exchange RTX. But he's really got his hands in sort of numerous things having had an\nincredible few years in many aspects of the crypto world. So it's a thrill to have him here and get his perspective. Sam\nthank you so much for joining us. Yeah. Thanks for having me as always.\nYou know there's obviously somewhere to talk about. But you know one of the things that I've been thinking about lately is crypto\nregulation is always one of these things. People in Washington to talk about it and it really feels like it's coming to the\nfront burner particularly stable coin. So there are many aspects of crypto regulation that could theoretically touch a regulation\nthat could theoretically touch crypto but stable coins feels like a very front of mind topic right now. You're a user of\nstable coins. Your exchanges trade stay with coins. What are you looking for in terms of like a regulatory regime that makes\nsense for stable coins. Totally. And it is absolutely front of ",
        "1": "mind. You know the presidential working group recently released\na memoir on it. We've seen you know lawmakers regulators comment on it. We've gotten questions from regulators around the world\non it. And you know the way I see it there's sort of one one sort of like biggest piece of stable coin regulation\nwhich is missing today. And I think he is going to become really important which is basically ensuring that you know it's back to\nthe way that it says it is. And I you know I think you could design a sort of registration and transparency based regime\nwhere you know basically stable coin issuers have to give daily attestation as to exactly what is backing their stable coin.\nThere have to be no audits every six months or whatever you know to confirm that it is in fact what they say it is. And you know\nsome guidelines around what those things can be. And I don't know exactly where you draw the line from like dollars and U.S.\nbank account to treasuries like grade A plus the U.S. corporate ",
        "2": "paper like there is a spectrum here. I mean it's almost less\nimportant exactly where you draw the line than like drawing it somewhere being explicit about that to make sure it doesn't\nslide too far down into the really risky category. Maybe you have haircutting on you know grade plus corporate paper you know\na 10 percent haircut or whatever. So you need to be right for collateralized there and. So I may have frozen there. Maybe you could hear me. So your\nsense right now is that this clarity is is lacking in terms of like in terms of what's needed. Yeah.\nYeah. Looks like you know right. Yeah. Let's pivot a little bit on another stable coins related\nquestion. Yes. What about just the ability to track how they're used. And of course this is up from crypto from day one.\nThis has been a source of anxiety. And of course you know even ",
        "3": "before stable coins there was something called the Liberty\nReserve. And this idea like well you can't just like hold a dollar and a bank and then give someone a token representing it\nand then let them do whatever they want. Because you know the government sort of likes to know that people aren't engaging in\nyou know international drug dealing or terrorist finance or things like that. These are good sources of anxiety from crypto\nprice. It's a crypto was invented. Is that does there need to be anything further done on the stable coins from that perspective.\nSo I think that there could be service at least according fixation of you know what we're seeing right now.\nBut I do think that frankly there's already a lot being done on that front. On the money transmitting front. That's sort of been\nthe case where it's been if anything clearest how global regulations applied to the crypto currency industry. What we\nhaven't. First of all you need to be fully KYC in order to create or redeem a stable plane. And so the ultimate issuance\nand redemption of these are on. And then the issue is generally ",
        "4": "have the ability to blacklist addresses on the blocking that are\nknown to be associated with financial crime. And you know this has happened from time to time.\nAnd that that is sort of the core of the approach that's going on today combined with if you're using a stable plane on a\ncentralized platform on you know F jets or any other centralized exchange. Right. You need to go through that exchange KYC\nprocess as well. And so that that sort of is the core of what's being done.\nBut obviously on top of that whenever you have a public ledger which you have with all major box chains it actually provides a\npretty powerful tool for tracking and combating financial crimes. Because you know when you know where someone started\nwith some assets you can trace through exactly how those flow through the whole crypto and economic system by looking at you\nknow address to address where the coins move and your contacting ",
        "5": "any central ISE of organizations in that. So patching those\ntogether. There's already a pretty decent network of anti money laundering type of controls on this one or several coins.\nQuestion. I mean obviously as you mentioned front of mind here there was\njust a federal government paper that was released unstable control regulation. But you're going to FTSE operates all over\nthe world including in many emerging markets. And historically you know a lot of emerging markets particularly not fully open\nones have attempted to limit the ability of people to get dollar denominated assets and people might want dollar ISE assets. And\nyet that might be something that you know is limited or banks only allow so much good stable coins. The fact that I could send\nyou a stable coin just for my phone to your point phone anywhere in the world regardless it do. Are some of the other markets\nthat you operate in. Does that. Is that a source of anxiety for ",
        "6": "them.\nIt absolutely is. And I think they're sort of it's you know a few ways to look at this one from sort of a U.S. strategic point\nof view. Thinking about what is the reserve currency of the crypto economy going to be. Yeah. And right now it's\nunambiguously the U.S. dollar. And interestingly is the U.S. dollar whether or not you're looking at American crypto economy.\nIf you look at European crypto transactions Asian cryptic transactions Latin American African no matter where you look\nthere's a local on where people figure out how to get from their local currency into crypto. But once they're in crypto they're\ngoing back and forth between Bitcoin and U.S. dollar stable coins.\nSo right now Neal 95 percent of transactions are happening against a U.S. dollar U.S. dollar paid asset. And I think that\nthat's probably good for the U.S. strategically. And you know I think there's serious risk if there are a few regulations\nunstable stable become unworkable in the future. That while Evan ",
        "7": "is pretty happy right now with with with that that you know that\ncould change to a different currency maybe changing the euro or yen or maybe it changes to B so that that sort of one side when\nyou look at it from the local government's perspective what we've found is what they care about the most is this step where\nthe user goes from their local currency to something that isn't their local currency. And so when the user is going back and\nforth between Bitcoin and U.S. D.C. or Bitcoin whether the local governments don't tend to care very much because it's already\nnot in their local currency. To the extent that there is something there. Sure. Combat that already happened. And frankly\nwhen you're going between U.S. dollars and USD stable point they don't care that much because again that's already happened. But\nthe keys to where you often do see a lot of regulation is around going from local currency to non local currency. Each country\nhandles that differently. But you know in China we've seen a lot of crackdowns on the army base crypto markets in Korea basically\nonly Koreans can access the CAC W to crypto currency markets and ",
        "8": "patterns like that in a lot of different countries where there\nclearly is some concern from them about this being used as a vehicle to you know move money out of their economic control.\nLet's pivot to some of the market developments that we're seeing in crypto. You are I think as I've announced this morning\nbacking a new fund for Web 3.0 gaming. And this is a hot area. And the idea that OK with crypto blogging platforms there could\nbe done more than just trading and speculation. And we've seen them take off in a fairly big way over the last six months.\nMaybe there is a game called actually that's really popular. It's still not clear to me with some of these games whether\nthey're fun to play or whether people just play them because they can click their models and a few keys and over time make\nmoney right now. Like what do you see as the state of crypto ",
        "9": "gaming and what do you see as the potential for why it could be\nan improvement on sort of like mainstream games that exist on a corporate server. Totally and the first thing I say is I think\nyou're is a really big difference between crypto companies trying to make a game and gaming companies trying to introduce\ncrypto. You know I think that frankly it's really hard to make a really engaging video game. I don't think I could do it right. I\nmean you would take a long time to build up that expertise. And so when you hear about you know I talk to your gaming\npublisher looking to introduce crypto into their system I'm pretty bullish on that.\nWhen you look at the opposite direction I think by risk I like well why do we think this team that set off like a crypto team\nis gonna be able to build a great video game. Interesting. And I think that that's where some of the skepticism that that least\nI'm gonna have towards the crypto gave me that's coming not from the gaming industry but why the Im really excited about is you\ntake a top tier gaming studio that's making a great game and ",
        "10": "wants to have market mechanics and it wants to have real user\nownership of the digital assets in it. Yeah. And wants to use your block chain technology and payment rails and FTSE to enable\nthat. That is where I would guess you're going to see the biggest adoption early on. That's super interesting. Go to that\nlittle further because actually that wasn't the answer that I was expecting. But I do find that fascinating because it feels\nlike by and large legacy companies you know they often put out for years now put out put out some press releases about crypto.\nIt feels a little bit ham fisted often. They don't really know how to do it. But your sense is that the bets that you want to\nplace or at least many of them will be more on this side of OK. Here is a publisher of a very popular game. Maybe it's a\nmassively multiplayer game etc. and crypto can add something to ",
        "11": "that. What do you see crypto potentially adding that they'll\nwant to be attracted to. I'm not going to pump up his stock price today after the press release. Right. Right. Why would\nthey actually bother to follow through on the operation. So first of all markets can be extremely engaging. You know we see\nthat all over the place and adding markets to a game I can can can really help make the game more engaging for users on many\ngames already have economies built into them. But they're extremely illiquid because it's just like some random video game\ntrying to build an economy out of nothing. But if you get access through an integrated financial system that even people who\naren't playing the game can get access to outside of the game as well. That can create a much more liquid marketplace. And we've\nseen a lot of you know MMO RPG ease build. You know Eve online is an example of this. I mean you look at the World of Warcraft\nhas had this and May Games have miniature versions of this. So ",
        "12": "building out the liquid it's saying marketplaces in-game is one\npart of it. Making payments easy is another piece of this. And then a third is creating real social identity around in-game\nownership and and sort of you know accomplishments where you have an FTSE representing skins that you've bought or one FTSE\nrepresenting your performance in the game. You have a gallery that can be displayed in and out of games. You can tweet out\nyour profile from a game. You've got interaction based on your profiles and really bringing street to the user in a real direct\nownership sense an intractable sense a representation of who they are online. A sort of like I think the other piece of this\nthat has a ton of potential to get your point of will people actually do this. I think yes. I don't know when but I can say\nthat almost every major game studio is extremely actively ",
        "13": "actually looking into doing something tech wise here. It's not\ngoing to happen tomorrow. These are going to be the low trickle at the beginning. But I think almost all of them have decided\nthat they will eventually take the plunge somehow some way. I feel like if we were having this conversation like six months\nago maybe we would have talked about deep fire something before you brought up and FTSE. Do you feel like ultimately like an\nFTSE is the thing. And I know that's very broad. And some people just associate them with like ISE are really expensive art or\nweird profile characters. Defined broadly is the thing that sort of brings crypto to something resembling like a mass adoption\nthat goes beyond just pure trading. I would have given very low probability that a year ago now I\nwould give decent probability to that. I don't want to constantly say that will happen because I think it could be\npayment rails instead. I think that there's a few things it could be but I would now put an FTSE in that top category\nprobability wise on with a couple other things in terms of what ",
        "14": "brings a non crypto native audience to crypto for something\nother than financial investing where you know whether it's integrating with video games whether it's ticketing for venues\nor or events or or teams. You know I think that we're seeing really active movements on those fronts. It makes a lot of sense\nas a product and it's a pretty clean innovation layer to add on top of the existing structures. Let's talk about your growth\nplans. And I'm particularly interested in the US market right now because there is a lot happening and people in crypto like\nto complain about U.S. regulations. But when I look at the market overall I just see more and more happening. And now\nthere's Bitcoin Futures ETF which maybe a few years ago might have seemed unimaginable. RTX us. One of your subdivisions. What\nis it. What do you see as the opportunity in the U.S. market for that for that asset. Yeah. Massive. And you know the United\nStates generally has the deepest most liquid and the highest ",
        "15": "volume markets in the world. This is true in almost every asset\nclass. It's also true in almost every asset class that more than half the volume trades through derivatives and futures. There's\nnot a crisis specific phenomenon. This is you name. Name your favorite sector. Most of IBM's going up in features I buy in the\nUnited States right now. Crypto is an exception to that. If you look at global CAC volume. Right and I came just like pull up\nnumbers here from from from you know from today on on what is you know the sort of global crypto volume distribution work\nlike. And he looks really different internationally than it does in the United States where we see 170 billion dollars of volume\ntrading in the last day globally. It's a lot of volume first of all. That's the same order of magnitude as United States stocks\ndo. But I what's the breakdown of that internationally. We see ",
        "16": "it as I you know more derivative since Spot you know in general\nwill offer two to one derivatives to Spotify in the United States today. There has been one point seven billion dollars of\nfutures volume. It's you know 10 percent of the U.S. volume and 1 percent of the global volume are U.S. futures. You would\nexpect that to be the biggest source of global volume. But what's going on is almost all the volume goes through crypto\nnative players and none of them have licensing right for at least the big ones you for futures in the states. I think that's\nthe biggest missing liquidity source and crypto. I think that markets could be substantially more efficient substantially more\nregulated substantially more liquid were that there. And you know we would love to enter that space and we are working. So\nwhat does that happen. Because right. Right now there are people in the United States that would love\nto trade perpetual futures on FTSE. Com and they look at what's ",
        "17": "happening to excite us and it's not there. And obviously you\nknow there are all kinds of more interesting things that happen on the non U.S. side. What's blogging that. Who specifically and\nwho do you who has to give the green light in the US. Is it have to be on the legislative side or is it a regulatory side where\nit's like OK this is something that more retail focused exchanges can start. Who gives that green light. It's a C FTSE\nand this is actually within the scope of traditional CFTC licenses. There are potentially things that can be offered to a\nwide variety of users and they're pretty broad in terms of what products both in terms of the structure of the product and the\nunderlying that that you could offer futures or drifts on. We have a subsidiary of RTX U.S. Derivatives which has licensing\nfor this which has a DCF and a DCM and SCAF actually. And we're ",
        "18": "actively engaging with the CFTC discussing the products that we\nwould be excited to launch. You know talking through those and you were optimistic that we're going to be able to I really\nlaunch some exciting products in that area you know over the next year or two. And I think very little is completely outside\nthe scope of what that license could theoretically do. It's all it's all just a question of what we and the CFTC Tidjane Thiam\nparticularly the CFTC ultimately feels comfortable with. And you know it's probably can be an area of process. But I. But no\nthere doesn't need to be legislative changes for I crypto futures in the United States. That's something that that can\nalready exist with license. Like I said we have just a less than a minute to go. So real quickly you know we sort of think of\nthese two things as dual tracks. What about crypto RFID or token ISE traditional markets. What is the hurdle. Before we really\nwere to see like say people companies issuing stock or token ISE ",
        "19": "versions of stock futures or treasury futures running on crypto\nrails. Yeah absolutely so. You know I think the big question I'd ask is who would list that product. What exchange would. Yeah.\nAre you looking for FTSE or Coinbase solicit. Are you looking for the New York Stock Exchange listed. Are you looking for some\nthird type of flat for implicit. Is Robin Hood going to be able to. That's honestly the biggest question is what licensing would\none need to offer such a product. Would it be offered on crypto veils or traditional clearing rails. And I don't know what's\ngoing to happen there. But you know that's gonna be a discussion with the FCC. And I think you've heard Chair Gensler say you\nknow again again look we would love to see crypto platforms come in and register on. If I had to guess I would guess that he and\nthe FCC have been thinking about what the regime like that might look like. I would be surprised to see developments over the\nnext year on that. Sam Brinkman free CEO and founder of RTX thank you so much for\ncoming on. Thank you. "
    }
}