{
    "metadata": {
        "video_id": "DrBPQAiiAww",
        "title": "Sam Bankman-Fried is his own worst enemy, says former SEC official John Reed Stark",
        "link": "https://www.youtube.com/watch?v=DrBPQAiiAww",
        "duration": "8:15",
        "channel_name": "CNBC Television"
    },
    "transcript": {
        "0": "THE HIGH PROFILE FRAUD TRIAL OF  SAM BANKMAN-FRIED DID BEGIN  YESTERDAY WITH JURY SELECTION  KICKING OFF SEVERAL WEEKS OF  PROCEEDINGS TO DETERMINE IF HE'S GUILTY OF MISUSING BILLIONS OF  DOLLARS OF CUSTOMER FUNDS OR  NOT. JOINING US RIGHT NOW IS JOHN  STARK, FORMER CHIEF OF THE  S.E.C. OFFICE OF INTERNET  ENFORCEMENT, SENIOR LECTURING  FELLOW AT DUKE. OKAY. I'M GOING TO MAKE YOU, FOR THE  DAY, THE DEFENSE ATTORNEY, JOHN, FOR SAM BANKMAN-FRIED. WHAT WOULD YOU TELL THE JURY? >> THAT'S A REAL PROBLEM,  ANDREW. I WOULD HAVE PLED THE CASE A  LONG TIME AGO. THIS IS AN -- FIRST OF ALL, HE  WANTS TO CLAIM SOME KIND OF  RELIANCE ON COUNSEL DEFENSE,  WHICH IS A VERY TOP AFFIRMATIVE  DEFENSE TO DO BECAUSE IF YOU  WANT TO SAY YOUR LAWYERS TOLD  YOU ALL THIS WAS OKAY, YOU NEED  TO HAVE EVIDENCE THAT SHOWED YOU ",
        "1": "IT I ALL OF THEM ARE FORMER  EXECUTIVES AT THE COMPANY. THEY'VE SPENT THE LAST 11 MONTHS WALKING THE PROSECUTION THROUGH  EVERY SINGLE DOCUMENT, EVERY  E-MAIL, EVERY TEXT. WHY DID THEY DO THAT? BECAUSE THEY SIGNED PLEA  AGREEMENTS. THEY HAVE A STAKE IN THIS TRIAL. THEY HAVE TO PERFORM OR THEY'RE  NOT GOING TO GET THE DEAL. >> IF I WAS THE DEFENSE  ATTORNEY, WHAT YOU JUST SAID  ACTUALLY WOULD BE PROBABLY MY  BEST DEFENSE, WHICH IS I'D SAY  YOU CAN'T BELIEVE THESE PEOPLE. HOW CAN YOU BELIEVE THE  CREDIBILITY OF THESE INDIVIDUALS IF IN FACT THEY'VE ALL TAKEN  PLEA DEALS AND THEY ALL HAVE A  ",
        "2": "STAKE IN THE OUTCOME OF THE CASE BECAUSE THEIR STAKE IS MY STAKE? >> THAT'S THE TRUTH. THAT HAPPENS IN EVERY SINGLE  TRIAL. I WAS WITH THE SEC ENFORCEMENT  DIVISION FOR ALMOST 20 YEARS. EVERY WITNESS HAS A BIAS. YOU WALK THEM THROUGH THAT AND  EXPLAIN HOW THEY'RE HERE TO TELL THE TRUTH AND THEY EXPLAIN  DOCUMENT BY DOCUMENT. REMEMBER, YOU HAVE A LEGION OF  ACCOUNTANTS, OF FORENSIC  ACCOUNTANTS, LAWYERS,  TECHNOLOGY, ALL HIRED BY JOHN  RAY. RAY HAS PAID THEM OVER $200. THE  -- 200 MILLION. THEIR PRIMARY JOB IS TO GIVE LAW ENFORCEMENT WHAT THEY'RE ASKING  FOR. THEY'RE CHARGING SOMEWHERE ON  THE AVERAGE OF $1,800 AN HOUR. THEY'RE RUNNING OVER TO THAT  OFFICE GIVING THEM EVERY SINGLE  DOCUMENT, EVERY SINGLE TEXT,  EVERY SINGLE E-MAIL, EVERYTHING  THEY FIND AND IT'S FREE OF  ",
        "3": "CHARGE FOR THE PROSECUTORS. THIS IS UNPRESS DECEDENTED TO HO MANY PROSECUTION WITNESSES THAT  HAVE ACCESS TO EVERY PIECE OF  DATA. WHAT'S HIS DEFENSE? HE'S HIS OWN WORST ENEMY. HE'S GOT DIARRHEA OF THE MOUTH. HE TALKS ABOUT THE DUMB GAMES WE DUMB WESTERNERS PLAY. HE ADMITTED THAT THE ETHICS  STUFF WAS MOSTLY A FRONT. HE SPENT HIS TIME TALKING TO YOU GIVING YOU ALL SORTS OF  INKULPATORY EVIDENCE. HIS HIS OWN WORST ENEMY. >> JUST RUNNING THROUGH THE  DEFENSE WHEN HE WAS ASKING  QUESTIONS LIKE DO YOU KNOW  ANYONE WITH ADHD? IF ADHD IS AN EXCUSE, HALF THE  ",
        "4": "POPULATION HAS ADHD. AND HIS PARENTS ARE LAWYERS. >> DON'T GET ME STARTED ON THE  PARENTS. HIS FATHER GETS A $10 MILLION  SALARY. THEY GREAT 16.5 MILLION HOUSE  AND THEY'RE SAYING WE DIDN'T  KNOW WHEN WE SIGNED THE PAPERS  TO THAT HOUSE -- MY FATHER USED  TO USE THIS STATEMENT WHEN MY  BROTHER AND I WOULD GET INTO  TROUBLE, THE I DON'T KNOW  SYNDROME. I DON'T KNOW HOW THE CAR GOT ALL MESSED UP. YEAH, I WAS USING IT LAST NIGHT. ALL OF A SUDDEN YOU'RE THE  BIGGEST IDIOT IN THE WORLD AND  YOU WERE PAID $10 MILLION FOR  WHAT? MY CLOSING ARGUMENT -- I'M SORRY I DIDN'T ANSWER YOUR QUESTION  DIRECTLY. I'D RATHER BE THE PROSECUTOR  OBVIOUSLY. REMEMBER HAMILTON, BECKY, YOU  WANT TO BE IN THE ROOM WHERE IT  HAPPENED. SAY IT A \"A ROOM WHERE IT  HAPPENS.\" AND THIS WHOLE SNL SKIT, THE  ",
        "5": "CAVEMAN LAWYER. REMEMBER THAT SKIT IN.  >> NO. >> HE'S GOING TO SAY I'M JUST A  CAVEMAN, I DON'T UNDERSTAND, I  DON'T KNOW WHAT'S GOING ON. I'M NOT FAMILIAR WITH THESE  CORPORATE WAYS AND USING THAT  MONEY TO BUY AS MUCH POLITICAL  INFLUENCE AS I CAN AND GETTING  MY MOM TO HELP ME CONCEAL. >> YOU HAVE MADE A NUMBER OF  ACCUSATIONS ON THE AIR, NOT JUST AGAINST SAM BANKMAN-FRIED BUT  YOU'VE MADE A NUMBER OF  ALLEGATIONS AGAINST HIS PARENTS, HIS FATHER AND MOTHER. YOU SEEM TO BE IMPLICATING THEM  CRIMINALLY. DO YOU WANT TO SPEAK TO THAT? >> IT'S MY OPINION BUT  ABSOLUTELY. ABSOLUTELY. HOW DO YOU SAY YOU'RE GETTING  $10 MILLION AND YOU'RE A SENIOR  ",
        "6": "ADVISOR TO THE COMPANY AND YOU  SAY, GEE, I HAD NO IDEA AT ALL. THEY SHOULD AT LEAST BE RELIEF  DEFENDANTS FOR THE SEXT ACTION. >> SO WHY IS IT THEY'RE NOT? IF YOU'RE -- YOU'VE QUITE  EXPLICITLY JUST ACCUSED THEM OF  A CRIME. WHY DO YOU THINK THEY'RE NOT  BEING ACCUSED OF A CRIME BY THE  GOVERNMENT IN.  >> WELL, A COUPLE REASONS. THIS IS THE FIRST TRIAL. THERE WILL BE ANOTHER RILE FOR  THEY WEREN'T PEAR EXTRADITION -- >> I'M GOING TO SOP YOU BECAUSE  THE OTHER PIECE OF THIS IS YOU  DON'T THINK THAT IF HE'S  CONVICTED THEY WILL STOP? >> WHO WILL STOP? >> NO, NO. IF SAM BANKMAN-FRIED IS  CONVICTED IN THIS PARTICULAR  TRIAL, MY VIEW -- YOU MAY  DISAGREE WITH ME -- IT'S YOUR  ",
        "7": "UNDERSTANDING THERE ARE GOING TO BE SEPARATE TRIAL ON ALL THESE  OR CHARGES. WHAT I'M SAYING TO YOU AND YOU  MAY DID I AGREE WITH ME, I  BELIEVE THAT THE COURTS ARE NOT  GOING TO SPEND YOUR TAX DOLLARS  TO DO THIS FIVE MORE TIMES. >> IT'S UP TO THE PROSECUTOR. I DON'T KNOW THE IF ANSWER TO  YOUR QUESTION. IT DEPENDS HOW MANY COUNTS HE  GETS CONVICTED ON. IF ALLOWS THE JURY LEEWAY IF  TUSE THIS I DON'T KNOW ANYTHING  DEFENSE. IT'S BEEN STAGED SO IT NOT BLOOE BLO BUT TO YOUR QUESTION, WHY  HAVEN'T THEY NAMED THE PARENTS? >> THEY'RE OBVIOUSLY THEY'VE  ",
        "8": "WIST LISTst AND THEY'RE PROBABLY JUST THINKING LET'S KEEP THIS  CASE SIMPLE, WE'LL S "
    }
}