{
    "metadata": {
        "video_id": "wOtYNWd3tzg",
        "title": "The Truth about Sam Bankman-Fried & Effective Altruism",
        "link": "https://www.youtube.com/watch?v=wOtYNWd3tzg",
        "duration": "24:18",
        "channel_name": "Molly Elmore"
    },
    "transcript": {
        "0": "Hey, welcome to the show. Today we're going to talk about effective altruism. Sounds like a really nice, cool concept. Like, who doesn't want to be more altruistic and more giving? Well, like many of the things that the billionaires do, they don't always mean what they sound like. And effective altruism is, I think, my research one of those concepts that sounds great on paper but may not be what it appears to be. And we're going to dig into that right now. ",
        "1": "So I found this interesting quote in the article, was that one cannot fully understand what motivated Sam bankrupt's breeds to pursue this incredible Ponzi operation along with his network's media manipulation and DC lobbying campaigns without understanding the effective altruism movement. So in a nutshell, we have someone like Sam Bankman Freed who did a lot of really shady bad things, right? I mean, it's still kind of coming to surface what exactly happened. But at this point it appears like he stole a lot of money, he lied, he manipulated people. And one you ask yourself, what was he thinking? Was he really this evil bad guy? Was he just was he dumb? What was behind this? And it looks like this rationalization, which I don't think it is unique to him at all, was kind of behind it. ",
        "2": "And it's almost like an end justifies the means type of approach. Like if you're going to do something good, is it okay if you do something bad in the efforts to accomplish this good thing? And that's effectively what's at heart with Sam Bank Mcfried. And I don't want to disparage absolutely everybody who is part of this affected altruism movement, but it looks a lot like a way to concentrate power and concentrate wealth in the hands of a few for them to decide what to do with it. So I'm going to break down what I found out and please feel free to share in the comments if you have a different take on it or you think I'm maybe wrong about any of these points. All right, so my research started on the official effective altruism site and I decided when I was starting this that I was going to have an open mind and ",
        "3": "that maybe I was wrong about this and maybe this is a genuinely do gooder movement and I might have even scrapped doing this video. And the corresponding written stuff I'm going to have as well. But sure enough, on page one of the website, I was reminded why this is not what it appears to be. Homepage. So you can see here, this is literally the top of the site. What is effective altruism? Everyone wants to do good, but many ways of doing good are ineffective. It is literally the first sentence on the website. And that word ineffective, which you probably, maybe can't see on your screen, it's linked and it links to this article, which is about a forced sterilization program in India that was funded by the Ford and Rockefeller Foundation under the guise of population control, ",
        "4": "which is I wasn't expecting them to get right into it in the first sentence on the website that they are not disparaging this. Let's go back to this page here. Let's see what they say. So everyone wants to do good, okay. But many ways of doing good are ineffective. And it goes into this article about the forced vaccinations. Let me read some more about what's in this article. All right. Thankfully, the Ford and Rockefeller Foundation have worked hard to distance themselves from these practices in recent decades. We talked to Columbia historian Matt Connolly about how that happened and what foundations can learn from the disastrous history of population control when formulating programs to address other global challenges like climate change, pandemic disease and nuclear war. We know what a disastrous effort to tackle a global problem looks like. ",
        "5": "But then what then does a successful effort look like? And here's the URL link if you want to visit it. Okay, but here's the point. They're not saying that depopulation initiatives are bad. They're saying these billionaires tried to do a good thing, they just messed up in the delivery. So sentence number one says this is a globalist elite depopulation effort. They're not saying that they did this, but they're not disparaging it. They're saying we want to do better than the billionaires before us who kind of screwed up, which I OK, I'm not personally. I guess I'll have to share some of my own personal political views here. I'm not a fan of depopulation agendas. I don't think they are in the interests of humanity because you have generally a very small group of people deciding the fate of another group of people. ",
        "6": "And you're also saying that the small group are more important than the other people because they're not depopulating themselves. Remember, they're saying other groups of people need to be depopulated. And in the case of India, what they were doing is they were masterlizing people so that those families would not continue on, whereas the people making those decisions, I find it very unlikely that they went through those same procedures themselves. Okay, continuing on. All right, then we'll get into that was then. Now let's get into now what is the modern, effective altruism movement about on their own website? They list these are their core areas of focus. Number one, they want to prevent the next pandemic, which is interesting because you assume there will be another one. All right. Number two, providing basic medical supplies in poor countries. That's kind of vague, but all right. Number three, they're big into ",
        "7": "AI and their thought process. And what I read is that AI could be disastrously bad for humanity. Basically like Terminator movies, where this is how I interpret it, where the AI kind of develops a mind of its own and ends up trying to exterminate humanity or doing bad things to humanity, which I think is a legit concern. It's just sort of a strange thing that they think that is one of the most pressing concerns to humanity is Terminator movies. I think it's more Terminator two, I think is the one with Where Skynet and they kind of blow it up in the end. I've seen them all, but it's been a while. Alright, number three that is of big prior to them is ending factory farming. And this is one of those topics that I think is a little bit loaded because I don't know anybody who is a fan of inhumane farming techniques. ",
        "8": "But their suggestions generally aren't about finding other ways to get animal protein. They're basically going to the bug thing, I'm just going to spoil to the end, which I have no interest in eating bugs, nor will I ever change my viewpoint on that. And I think that it's very much the case in western cultures. I know that some cultures like bugs and that's your jam. Like alright, I don't have a problem with that. You do you I'm not personally interested in the bug things. OK, and the last one is the one that's most interesting to me because it basically ties into propaganda, which I've studied fair amount of. And one of the main tenets of effective altruism is to improve decision making. And they're not super clear whose decisions how that works, ",
        "9": "but to have a specific practice that manages how other people make decisions I think is very fascinating and is the key of influence, persuasion and propaganda. OK, let's continue on. All right, so I'm a big fan of Safadin Amus. I'm sorry if I said his name wrong. The Bitcoin Standard and Fiat Standard are both excellent books and I do find his economic views align with mine. And he often posts very interesting things that are aside from Bitcoin. And he had a great point about this effective altruism and he linked to this article which I'm going to have some quotes from a fascinating exploration of how effective altruism and utilitarianism, which is like the cousin of this movement, laid the foundation for the FTX ponzi. Because if you can convince yourself you're working for the greater good, all means you're justified. And that is, I think, the key to understanding what's going on with SBS and what's behind, I think, some ",
        "10": "of these elite agendas that seem nefarious and gross. Even if you were to talk about them very openly, you're like are these people like, do they hate humanity? Because in their mind they think they are justified because they are focused on very long term goals which we're going to talk about and they have this rationalization that what we're doing now, even if it looks horrible, is for the greater good of humanity in the future. I don't agree with this. My effort here was simply to try to understand like what makes these people tick because you can't, I think, effectively challenge someone if you don't understand what their logic and their rationale are. So basically, an ends justifies the means type of scenario, and miraculously, MIT shows up again in my research, and MIT wrote an article that actually contributed ",
        "11": "much to my challenging of this. So this is not like some loony fringe publication. This is the MIT Technology Review that talks about this idea around consolidating decisionmaking. All right, here's what it says. The Giving Philosophy, which has adopted a focus on the long term, is a conservative project consolidating decisionmaking among a small set of technocrats. So this is the heart of what I have a problem with around this elite globalist agenda is that you have this very small group of people who have the arrogance to think they can make decisions for everyone. On the planet and that they think they're smart enough, qualified enough and in a position that's even that that's their right to make these decisions for a bigger group of people. And that's the heart of this movement. They're like, we're going to figure out ways to make tons and tons of money. Then we're going to decide what these ",
        "12": "charitable causes that we support are. They align with our specific political agenda and our longterm goals. Now, I'm a live and let live type person. So if you go and make a lot of money and you want to spend it however you want, if you want to support various charitable causes, go for it. Like, you're free to do that. But if you rig the system and you steal from people to that, then we're talking about a whole nother situation, which I don't really agree with or don't agree with at all. So digging more into this article inside effective altruism, where the far future counts a lot more than the present. And this, I think, is a key part to understand about this movement is they think that people in the future matter more than people present today. So their rationalization is that we can sacrifice people's lives, their freedoms, their standard of living, all the ",
        "13": "sort of things that you would use to describe your life at this moment, those are all secondary to two or three generations in the future, which is kind of crazy. And we'll talk about that in a minute. The Giving Philosophy, which has adopted a focus on the long term, is a conservative project consolidating decisionmaking. I read that already. Okay. Okay. This is a good quote that I found. For effective altruists, a good cause is not good enough. Only the very best should get funding in the areas most in need. These are usually by EA calculations, developing nations personal connections that might encourage someone to give to a local food bank or donate to the hospital that treated a parent or a distraction, or worse, a waste of money. There's so much in this quote that I was like, wow, this is crazy. First of all, you have this very small group of people deciding in their mind globally what are the worthy ",
        "14": "causes, and it says that you should not be focused at all on your local community where people you actually know, people you can interact with, those are secondary to these causes we have designated in faraway lands. Now, there are very likely absolutely people in faraway lands who need support and resources, but there's a shadiness to that. And should I not give to the homeless community in my town because I'm going to worry about two generations in the future whether or not they will be impacted by artificial intelligence, it's definitely a subjective call. And for them to say that they're not even vague about it, they're like, we only support these specific causes that we deem the very best. Everything else is a waste of money. That's a pretty broad and harsh viewpoint. ",
        "15": "Sorry, it's not a broad viewpoint. It's a pretty harsh viewpoint that only these causes that we consider are most important in developing nations count. Nothing else matters. I think that's crazy. Okay. Bank midfried's views are influenced by long termisms utilitarian calculations, which flatten lives into single units of value. So it's a very depersonalized thing. By this mass, the trillions of humans yet to be born represent a greater moral obligation than the billions alive today. Any threats that could prevent future generations from reaching their full potential, either through extinction or through technological stagnation, which McCaskill deems equally dire in his new book, are priority number one. So threats to future generations are more important than anything going on now, and everyone alive now is just a unit of value. That's a big deal. I feel like before the planet decides this is now our model for giving out aid. ",
        "16": "We need to have an open on this conversation about that. You're saying that people alive today are less important than two generations in the future. What if we don't even make two generations in the future? I don't really buy that this is the best plan, I guess, is where I'm going with this. And this was what was motivating. According to my research, sandbank and Fridge justification for pilfering his clients and investors money was to funnel into these future causes that he deemed most worthy. Now, part of my lens of viewing this comes from another book, Other Side from Creature from Jackie's Island that influenced me tremendously, which is John Perkins Confession of an Economic Hitman. I highly recommend reading this if you're a reader and you want to understand more about things like the IMF giving loans to emerging market nations. And this reminds me so much of that, because what ",
        "17": "is happening here is that people are discouraged from giving money locally where you could actually see the impact. Instead, you're supposed to take all your money and give it to some initiative that helps in the future in a place you are not physically. So you have no idea where that money really goes, right? You have no idea if that money is actually giving an impact. Instead, it could be funneled to all sorts of nefarious causes that you don't know because I doubt you're going to get an audit of it. And what happens in John Perkins book, he was a CIA guy, and this was his actual experience he did these things, was they would say some third world country needs a dam, so we're going to give them a loan for $10 million or whatever for this dam, and the first couple of million goes off to US. Multinational corporations for consulting, and some of it gets kicked back to politicians who approved it. ",
        "18": "Some of the money ends up in the country, but not the vast majority of it. Lots of it goes off to different places, and there are never any audits to track any of this stuff, or they're not certainly released publicly. And then what happens is these nations are in situations where the thing doesn't get done, and if it does get done, it doesn't solve the problem that they were told it would solve. And now they're in debt and they can't make these payments, and it creates this sovereign debt crisis type situation that we're about to embark on. And so it looks like it's this generous altruistic thing, oh, we're going to give you these loans and help you have a better life, but it ends up harming more than it does helping. And I'm very curious how much of that is going on here and that we, you know, these billionaires or these EA people say, we're going to raise all this money and give it to these great causes. All right, is there a lot of transparency going on about where that money is actually going and how much of it gets siphoned off and how much of it is used to fund luxurious meetings in exotic places that ",
        "19": "are all paid for by this money? I don't know. It just seems eerily reminiscent to the John Perkins book, which I highly recommend. Great read. Okay, this was another interesting quote that spoke to me about this situation. EA's long termisms whole idea that you can predict the future accurately enough to make decisions now on the basis of how far future people may be affected is just so ridiculously naive. And I think that's key about this arrogance that we're going to rob people to put funnel money into a cause that we deem worthy, and we've decided that people in the future need to be saved, but we have honestly zero idea what's going to happen in two years from now. So I don't think the math adds up. ",
        "20": "The idea that you can rationalize any of this sam make bin freed nefarious activity and pull it away from causes that would have an immediate impact in your community, from people starving, out of work, homeless, whatever with this justification that people in the future need to be saved from an AI computer takeover is insane. Sorry, that is my official opinion on this. Feel free to disagree with me in the comments. I would welcome any feedback. But I wanted to dig into what Sam Bancn's Breed's effective altruism philosophy was and he's part of this broader movement, so it's certainly not only him. It seems like Jeff Bezos types, Bill Gates types, they have this history of creating these programs that sometimes are harmful to people in the short term. I mean, a depopulation agenda which is linked on the ",
        "21": "site of this movement isn't like some person making a claim that this is the part of their agenda. It's the first sentence on their website that that is somehow justified because they have decided they know what's going to happen in the future, which is insane unless they maybe have time travel stuff. Until I know that for a fact that they are speculating. And at best they're wrong. At worst, they're just being incredibly deceptive and it's essentially a theft thing to steal wealth from the majority of people and hoard it amongst the sort of billionaire elite class. So I'm having a really hard time coming up with a conclusion that paints this as being a productive and helpful cause. Now, the thing is, you go to the website, ",
        "22": "I spent a lot reading up some articles about it too, like it sounds really good on paper. And you know what? I bet you in this movement there are some genuinely good, caring, kind people. But this is the type of policy that can be so easily manipulated and people will be harmed, innocent people will be harmed in the short term as money is pulled from things that would benefit them. To siphon off to this group of billionaires who are going to decide subjectively what they think are the most important causes. And they are very clear that they think futurist societies, future societies, are more in need than people today. So I will let you make your own conclusions. I will not be joining this movement. If you are a member of it and would like to challenge me on some of my beliefs, feel free to correct me because I'm not in this movement, so I can't speak as an insider. But I was very curious what was Motivating, sam Bingham Freed and some of these other billionaires? ",
        "23": "Jeff Bezos just had a similar thing where they appear to be so altruistic and they're earning to give with this intent of helping society. And it sounds so nice, but when you dig into what exactly are we talking about here, it actually looks to be very harmful to lots of people, which I'm not a fan of, and they're dishonest in that they don't really know what's going to happen in the future. So to say with conviction we need to prevent an artificial intelligence attack three generations down the road and billions of dollars need to be prioritized this and that. This is the most important thing I think is insane. So that is my opinion. All right, if you'd like to like the video, I'd appreciate it. Feel free to subscribe to the channel so you get notifications on future videos. ",
        "24": "And I would love to see you in my community two steps ahead, Locals.com, where we can talk about this stuff in greater detail. And I do a report every other week to break down some of these types of concepts which are important on understand in greater detail. But alright, I will see you in the next video. "
    }
}