{
    "metadata": {
        "video_id": "AbgRB3arCpY",
        "title": "The FTX Collapse, Explained | WSJ What Went Wrong",
        "link": "https://www.youtube.com/watch?v=AbgRB3arCpY",
        "duration": "6:04",
        "channel_name": "The Wall Street Journal"
    },
    "transcript": {
        "0": "- [Narrator] Over $150 billion. In three days, that's how much the world's 15 largest cryptocurrencies\nlost in market value. It's because of the Crypto\nExchange platform FTX, which is behind this token, named FTT. On November 6th, the\ntoken's value began to fall, losing more than 80% of its\nworth in the span of 72 hours. Once seen as a survivor\nin a struggling market, the fall of FTX has sent shockwaves through the cryptocurrency industry. So, what went wrong? FTX is the brainchild\nof Sam Bankman-Fried. He's commonly known as\nSBF on social media. He's been previously hailed as a savior of the crypto industry. - You were called the JP Morgan of crypto. - [Sam] Yep. - Does that bother you or not? - It doesn't bother me too much. - [Narrator] Bankman-Fried founded the quantitative trading firm\nAlameda Research in 2017. Two years later, he started\nFTX, an exchange platform for buying or selling cryptocurrencies. ",
        "1": "Right now, he's the majority\nowner of both firms. - That kinda aroused some\nskepticism among industry players and traders, investors, stakeholders, that there could be some\nsort of conflict of interest in terms of whether research was getting preferential treatment on FTX, vice versa. But the official narrative\nthat SBF gave in the past is that the two companies\nare separate entities. - [Narrator] After its launch, FTX attracted major\ninvestments from Silicon Valley and Wall Street. - Yeah, we'd raised a few billion dollars over the course of the last couple years and we're a profitable business. - [Narrator] It grew\ninto the fourth largest cryptocurrency exchange\nfor derivatives trading. Celebrities promoted the platform in ads. - I'm getting into crypto with FTX. You in? - It's FTX. It's a safe and easy\nway to get into crypto. - I don't think so. - [Narrator] FTX was gaining steam, and in the process, often\ntussled with Binance, the world's largest\ncrypto exchange by volume. - When FTX was getting started,\nBinance invested in FTX ",
        "2": "and it was one of the crypto\nexchange's earliest investors. But FTX, as we know, grew really rapidly and became a very\nsubstantial rival to Binance. - [Narrator] As FTX grew in the industry, Bankman-Fried furthered his\nreputation as a Crypto savior, when digital asset prices\ncollapsed earlier this year. - It's not fair to customers. - [Narrator] He bailed out firms, spending about a billion dollars. - It's okay to do a deal\nthat is moderately bad in bailing out a place. - [Narrator] But that image didn't last. On November 2nd, CoinDesk\npublished a report based on a leaked Alameda balance sheet. According to the leaked\ndata, Alameda claimed it had over 14 billion in assets\nat the end of June, but most of that was FTX's tokens. Alameda CEO Caroline Ellison tweeted that the balance sheet wasn't complete. - Caroline also said\nits financial situation ",
        "3": "is under control, the\ncompany is doing well. However, it seems like the market just didn't really buy that, and then traders continue\nto withdraw from FTX. - [Narrator] FTX and\nAlameda did not respond to a request for comment. Things escalated on November 6th, when Binance said it would offload hundreds of millions of dollars of FTT. Binance did not respond\nto a request for comment. The announcement sparked mass withdrawals. That day, FTX processed $4\nbillion of transactions, many times the normal amount for a day. Some got backlogged, which\nsparked demand for more. By November 7th, that number\nballooned to $6 billion. On the 8th, a day later,\nFTX's finances were in crisis. Binance stepped in and said\nit would buy the company. It seemed like FTX might have\nsolved its liquidity problem. But on the 9th, Binance backed out of the non-binding acquisition. The next day, The\nJournal reported that FTX ",
        "4": "used money from customers\nto fund risky bets made by Alameda. - It's a shocking revelation\nfor a lot of people in the industry, because even though there\nhas been a lot of speculation about FTX and Alameda research\nbeing joined at the hip, nobody could have foreseen\nthat SBF was willing to transfer billions of customer funds at his crypto exchange to\nhelp his crypto trading firm. - [Narrator] The Securities\nand Exchange Commission and Justice Department\nare investigating FTX, according to a person\nfamiliar with the matter. - This is not like the New\nYork Stock Exchange or Nasdaq. They take people's money,\nthey borrow against it. It's not much disclosure. And then they trade\nagainst their customers. - [Narrator] A spokesperson\nfor the Justice Department declined to comment. Bankman-Fried told investors that FTX couldn't cover withdrawals\nsince its collateral was dropping in value and\ncouldn't be liquidated, ",
        "5": "according to people\nfamiliar with the matter. On the 11th, Bankman-Fried resigned as CEO and FTX and Alameda filed for bankruptcy. Afterwards, FTX said it was\nprobing a potential hack. More than 370 million\nworth of crypto funds appeared to be missing, according to crypto\nanalytics firm Elliptic. On the 12th, The Journal\nreported that Alameda and FTX executives knew that FTX had lent its customers money to Alameda. - So a lot of retail traders\nand investors I've talked to are feeling desperate or frustrated. The majority of the people in the industry could not have seen this coming because FTX is such a dominant player. - [Narrator] The fallout\nhas led other companies to tout their reserves and\ncall for more transparency in the industry. As of November 11th, according\nto the bankruptcy filing, FTX is estimation of their liabilities would make it the largest\ncrypto related bankruptcy ever filed. "
    }
}