{
    "metadata": {
        "video_id": "XqwGt69pDXQ",
        "title": "The Collapse Of FTX: Insiders Tell All | CNBC Documentary",
        "link": "https://www.youtube.com/watch?v=XqwGt69pDXQ",
        "duration": "38:37",
        "channel_name": "CNBC"
    },
    "transcript": {
        "0": "(indistinct group chatter) He had become a celebrity.\nThere's no question. One of the richest people on the planet and certainly one of the youngest\nrich people on the planet. He was on the cover of Fortune this year, being compared to Warren Buffet. 30-year-old billionaire Sam Bankman-Fried, better known as SBF, saw a meteoric rise as\ncrypto's golden boy. The more time I spent with Sam, the smarter I felt that he was. My goal is to be able to\ndonate almost everything that I make. A seemingly altruistic billionaire looking to have a big impact. I don't give a (beep) a about my legacy, like I care about the impact that I have. He struck me as somebody that was really trying to\ndo something transformative. Which is why the crypto\nscandal that engulfed him shocked the world. News overnight. Sam Bankman-Fried is now\nin custody in the Bahamas. His $32 billion cryptocurrency exchange. FTX goes bankrupt in a matter of days. $8.9 billion in customer\nfunds are missing. ",
        "1": "I thought he was the Mark\nZuckerberg of crypto. Is he now the Bernie Madoff of crypto? Top Minds on Wall Street, Silicon Valley venture capitalists, A-list celebrities and\nmillions of crypto traders flocked to FTX trusting\nBankman-Fried with their money. I lost over $2 million on the FTX platform when it went down. Now FTX customers who lost millions are sharing their stories. It's really, really sad. Really sad not only how it's affected me, but how it's affected\nmillions of people globally. Investors who gave FTX\ntens of millions in capital are speaking out. So you feel betrayed. Oh, 1,000%. I'm betrayed and disappointed. And the former president of FTX US who resigned less than two months before its collapse tells all. What Sam did was\nold-fashioned financial fraud. So far all anyone has from\nBankman-Fried is an apology. ",
        "2": "I'm deeply sorry about what happened. And customers want answers. I had never lost that much money that amount of time before. This was probably one of the most scariest times like ever. I am definitely pissed at\nSBF. This was an entrepreneur who could have done really great things. How did it all go so spectacularly wrong? I'm not gonna revise history.\nI liked him, and trusted him. How could so many have been fooled? With an entity like FTX, there were clearly glaring red flags beyond any that I'd ever seen before. And will his customers\never get their money back? I'm in a quite a big hole right now. I am probably gonna have\nto file for bankruptcy. (bright music) A stones throw from the turquoise water and pristine beaches in the Bahamas, Sam Bankman-Fried sets up\nFTX headquarters in Nassau. What was the actual headquarters like? ",
        "3": "I think they had three or four, what effectively looked\nlike suburban office buildings that they were conjoining. It looked like a very large trading floor not too dissimilar to what\nyou would see on Wall Street. In less than two years, this little office park in the Bahamas becomes home to one of the\nlargest cryptocurrency exchanges in the world built by traders for traders. The platform worked. It was probably the\nbest platform out there in terms of user experience. More than 5 million users flocked to the exchange according to FTX and they were trading big money. You know, we have 10, $15 billion of daily trading volume on the platform. From Wall Street to Silicon Valley, Some of the smartest\nmoney becomes desperate to get in on the action. And he was a industry leader and a first mover in\ncryptocurrency exchanges. Had a big vision for the future and he was minting money. Investments in FTX pour in\ntotaling nearly $2 billion. I think their impression was Sam was the ideal tech founder ",
        "4": "who had landed on a goldmine. He had this way of making everyone really want him to succeed. He was this person who\nwas incredibly smart. He was ambitious. He was well pedigreed. He had gone to MIT, his parents were Stanford\nUniversity professors. He had worked at Jane Street, an organization that everybody\non Wall Street respects. And so that combination of things is a pretty interesting thing. For retail trader Sunil Kavuri, who's worked in traditional\nfinance at Morgan Stanley and JP Morgan hearing\nabout these investments gave FTX major street cred. They raised yes,\nsignificant amount of funds, about $900 million from Sequoia, Paradigm. I thought, okay, this is a\nvery safe institutionally backed exchange. Kavuri moves millions to the\nexchange. Crypto enthusiast, Evan Luthra does the same. ",
        "5": "A 100%, I was aware about all the VCs that invested in FTX and that is also building out of trust. Seemingly out of nowhere, Bankman-Fried and FTX start\nbecoming the biggest names in crypto. This is a tale as old\nas time to some degree. Some young charismatic\nguy in Bermuda shorts with the floppy hair, got\ncharmed the 20 best investors in the world. The young billionaire crypto\ntitan's overnight success featured in magazines and on TV. Thanks for having me. In the otherwise secretive world of crypto where the owners of exchanges\nare camera shy, Bankman-Fried, stands out welcoming the publicity. I would say definitely\nplayed a little bit of role that we knew who was actually behind FTX. I think what what really\ngave him credibility was the exponential profits he\nwas making for the investors and the the billions of dollars he was throwing around\nlike monopoly money. The co-founder of FTX is spending millions promoting the exchange with high profile\ncelebrity endorsement deals to bring in more and more customers. ",
        "6": "It became an obsession. More sports teams, more\nsports celebrities, different kinds of properties\nthat we could put our name on. NFL Superstar Tom Brady\nbecomes an investor and is featured in FTX commercials. FTX is the safest and easiest\nway to buy and sell crypto. Comedian Larry David\nstars in a Super Bowl ad that cost millions. FTX, it's a safe and easy\nway to get into crypto. Eh? I don't think so. The marketing works. For FTX, the first time I heard about it was on the Super Bowl ads. I was like, oh my goodness, there's all these big\nname people utilizing FTX. All the A-list names associated with FTX gives customers the impression there's been ample due\ndiligence done on the exchange. Did the celebrities make\nme feel more comfortable about using FTX? Personally, it did. But in reality everyone involved is gambling on the success of FTX and placing their trust in its founder. ",
        "7": "Remember when you're talking\nabout a venture capitalist, you're talking about a\nrisk taker with capital, you're going to go one for 10, you're gonna go one for 15 and in that one you may find the Google or the Facebook and so Sam was one of those\none for 15 or one for 20. But customers placing\ntheir faith in the exchange have much more to lose. The money was meant to be\nused for buying a house. I don't have that anymore. I own this condo. I've\nowned it for six years. I don't want to just have to part with it. And in November of 2022, the entire operation\nunravels in just a few days. (dramatic music) The implosion of FTX begins\nin the suburbs of Chicago. Nick Baker, the\neditor-in-chief at CoinDesk, a crypto news website, is working from home\nwhen one of his reporters reaches out with a story. ",
        "8": "Ian Allison, our reporter,\nstarted hearing Alameda, This trading firm owned\nby Sam Bankman-Fried, may not be on the most\nsolid financial footing. Ian heard this from a source. As a journalist you hear\na tip and that's great, but the challenge is, well\nthen how do you prove that. They confirmed the tip with a leaked copy of Alameda's balance sheet. What the document showed was\nthat in a very powerful way, that there was a very strong\nfinancial entanglement between these two companies. Their article goes live on November 2nd, exposing for the first\ntime that nearly half of the $14.6 billion in\nassets on the balance sheet of Bankman-Fried's\nsecretive crypto hedge fund were listed as FTT tokens, digital currency Bankman-Fried\nand his co-founders created for FTX customers back in 2019. That's a red flag potentially because it tells you that\nso much of this empire is supported on a foundation of money that comes from a sibling company. To better understand why that revelation leads to the collapse of FTX, you need some background on FTT. ",
        "9": "The FTT token is basically the\ntoken for the platform FTX. The benefits you get from the FTT token is you get reduction in trading fees. I invested about $200,000\nin the FTT token. SBF would regularly show\nthat he was personally buying FTT token so I held it. When FTT first hits the\nmarket in July of 2019, a token costs around two bucks. By 2021, it skyrocketed to nearly $80. And in November of 2022,\nit's trading around $22. The idea was to give people almost like an equity-like stake in ftx.com. If you were someone outside the US. But Harrison and FTX customers say they didn't know the FTT token was not widely distributed, which is key to having the\nmarket determine its price. A substantial portion of all\nthe FTT tokens in existence, were sitting on the\nbalance sheet of Alameda. According to the criminal complaint, SBF engineered the price\nof FTT by directing Alameda ",
        "10": "to buy large amounts of the\ntoken to maintain its price and that creates a huge problem. Alameda could not have sold\nits billions of dollars of FTT tokens without crashing its price. Their presence there, there's so such a substantial\npresence on that balance sheet was a suggestion that perhaps\nthis is a house of cards. To make matters worse, Alameda began using it as\ncollateral to obtain billions of dollars in loans from\nthird party lenders, leaving Alameda exposed to\nsignificant financial risks according to the complaint. And by the summer of\n2022, several of Alameda's major lenders go bankrupt. After a $2 trillion crash\nin the crypto markets. It was probably an\nopportunity for Sam to say, \"Wow, I just got smoked\nout alongside of Terra Luna and Celsius and Three Arrows. I'm shutting down Alameda and I'm going to focus\nall my energy on FTX.\" I think if he had done that, I don't think we'd be in this situation. ",
        "11": "Instead, at the direction\nof Bankman-Fried, Alameda greatly increased its\nusage of FTX customer funds to meet its external debt obligations. According to the CFTC. FTX customers are completely in the dark about what's happening with their money. Their first indication there\ncould be problems at FTX happens on November 6th, four days after the CoinDesk article\nreveals the billions of dollars worth of FTT tokens on\nAlameda's balance sheet. One of FTX's biggest\ninvestors gets spooked. The CEO of Binance, the world's largest\ncryptocurrency exchange, who goes by his initials CZ, makes an announcement in a tweet to his 7 million followers saying, we have decided to\nliquidate any remaining FTT on our books. And recently with the news\nof them becoming insolvent carried by CoinDesk first we just said, \"Well, we wanna sell those tokens.\" That's all we did. The single tweet from CZ is enough to make some customers panic. A lot of market participants\nwere getting spooked ",
        "12": "and were withdrawing the money. We're seeing a run on the bank start. And that was leading to $4 billion a day of client withdrawals. At that point, we started\ncalling prospective, sources of financing\nbecause I was nervous. But publicly Bankman-Fried\nis telling customers a different story. On November 7th, he tweets a competitor is trying to go after\nus with false rumors. FTX is fine, assets are fine. SBF came on Twitter and then he said, \"A competitor is attacking us. We do not take client deposits and we don't invest them in\nanything, even treasuries.\" So I think that put my\nmind at rest that okay, this is just fear on the\npart of market participants. Sunil Kavuri, Jake Thacker and Evan Luthra ",
        "13": "keep their crypto on FTX. I did not think this was actually a cause of concern 'cause\nI had all that faith and trust in the system and\nalready built it up over time. But the very next day,\nBankman-Fried deletes that tweet. According to the SEC, the price of FTT drops more than 75% and it's now apparent that\nSam's Empire is crumbling and investors like Anthony\nScaramucci are concerned. I went to The Bahamas\non November the eighth. I flew down there. Sam seemed sort of\ndisassociated like the scene in \"Private Ryan\" where you\nknow the battle's happening and somebody loses his arm and they're actually holding their own arm in their hands. He was having a hard time processing that all of this was happening to him as quickly as it was happening. I left the Bahamas saying, \"Okay, there's a huge problem here.\" In a last ditch effort\nto save the company, Bankman-Fried makes a\nsurprising move calling the CEO of Binance with an offer to sell them FTX. But the deal never gets off the ground. Patrick Hillman, ",
        "14": "Binance's chief strategy\nofficer at the time, got a firsthand look at FTX's finances as part of its due diligence team. It was like a bomb went off in that place. We're getting on calls,\npeople are crying even though, we were within the first like 12 hours of this crisis for them. So it was complete pandemonium over there. What did Binance end up finding in the due diligence process? We weren't able to do due\ndiligence for that long. You asked for specific\ninformation figures. The most basic like figure is how much cash do you have on reserves and what are your liabilities, right? How much do you owe versus\nwhat you have today? And we couldn't make heads or tails of it. The potential deal with Binance falls apart in less than 48 hours. I'm thinking to myself,\nBinance pulled out, this is something very serious. When CZ and Binance basically said, \"We're not doing the deal.\" That's when I was like, uhoh, now I gotta do whatever I can\ndo to get whatever I got left. This was probably one of the\nmost scariest times like ever. ",
        "15": "And for many customers, it's too late to withdraw their funds. I requested all withdrawals\nof all my assets, but none of them completed. None of the withdrawals ever came through. You're just helpless. Like, what do I do? I was just in so much shock\nthat that could happen. I had a huge amount of money obviously on the exchange and I thought, okay, there's something wrong. Why would he stop withdrawals? 'Cause the exchange is if\neveryone takes the money out, all that's what should be\nleft is the exchange assets. I thought this seriously\nwrong. I felt really sick. It's clear FTX and Alameda cannot survive. And on the morning of\nNovember 9th, around 10:00 AM at an all hands meeting, Caroline Ellison, the CEO of Alameda tells\nstaff earlier that year in response to an accounting\nor bookkeeping problem, Bankman-Fried and other\nindividuals decided to use FTX customer funds for Alameda. According to the CFTC's complaint, FTX and Alameda file for\nbankruptcy two days later. ",
        "16": "It's basically bloody November. (upbeat music) Bankman-Fried spends the\nnext month in the Bahamas inside the $30 million\nocean front penthouse where he lived with other\nFTX and Alameda executives. It's one of more than\n30 properties purchased by the FTX group according\nto the bankruptcy team. Many people actually just sort of worked from this place where Sam lived and spent only sort of\nsporadic time in the office. It was sort of like a dorm, it was like a college campus that they had created for themselves. I traveled to The Bahamas\nshortly after the collapse to ask Bankman-Fried how this happened. My first stop, FTX headquarters. Do you know if anyone\nfrom FTX is in there? No one is here. No one's there? Just three months before\nthe collapse of FTX I interviewed Bankman-Fried\nat the company's headquarters. At the time, he was a\nfrequent guest on CNBC. Sam, it's great to have you back. The founder and CEO of FTX. Being featured on the cover of magazines ",
        "17": "and making headlines for bailing out other struggling crypto companies. When I asked about the\nsurprising resilience of his businesses during\na major crypto crash, his answer seemed plausible. How did you and your\ncompany's FTX and Alameda survive that crash? I mean, I think like,\nand first of all, FTX, just like our corporate treasury in cash. I mean, our business office incredibly like related to the crypto markets, but we kept cash on hand\nand it's not meant to be something that has direct market exposure. I also asked Bankman-Fried\nto explain the ties between his two companies. What about the relationship\nbetween FTX and Alameda? I think there's some questions on kind of where those lines are. Are there any potential\nconflicts of interest in running as many companies\nas you do in the same space? Yeah, I've put a lot of\nwork over the last few years into trying to eliminate\nconflicts of interest there. And one big piece of this is just like, ",
        "18": "I don't run Alameda anymore.\nI don't work for it. None of FTX does separate SaaS and the way that we\nview FTX is as a neutral piece of market infrastructure. During the two hour interview, he talked about giving\nmoney away to charity. My goal is to, put myself in a position where I'll be able to donate\nalmost everything that I make. And appeared to be an\nidealistic young billionaire. If you spend $300 million buying a yacht, like that's thousands of lives that you probably could have\nsaved in Sub-Saharan Africa. Like most reporters at that time, I took Bankman-Fried at his word. FTX and Alameda were private companies that didn't have to\ndisclose their financials in the same way a publicly\ntraded company would. But that interview didn't age well. And a few months later, I found myself back at FTX headquarters this time covering the\nstory of how the guy ",
        "19": "who made billions over five years lost it all in a matter of days. I'm here to give Sam a chance\nto set the record straight. FTX's headquarters here in Nassau Bahamas is looking a lot different than when we were here\njust a few months ago. There was a massive FTX\nsign out here that's gone. The parking lot is\nessentially empty right now. And Sam Bankman-Fried, who\nwas pretty camera friendly, has become pretty camera shy. I pushed for an interview\nand after lots of texts back and forth, okay, well\nwe just heard from Sam. Bankman-Fried invites me to meet with him behind these walls and\nsecurity cameras at Albany, but declines to go on camera. I shared part of our conversation on CNBC despite being ousted from FTX\nin the company's bankruptcy, he says he's still spending most of his time still\ntrying to broker a bailout. A few weeks later in an\ninterview with CNBC's Andrew Ross Sorkin for the\nNew York Times Deal Book, Bankman-Fried admits he would've\ndone things differently. I've made a lot of mistakes or things I would give anything\nto be able to do over again. ",
        "20": "I didn't ever try to\ncommit fraud on anyone. But FTX customers who\nwatched aren't buying it. I have no respect for\nthe person at this point, like zero and anything\nthat that person says is invalidated in my opinion. I think that's just and media narrative like he's trying to\nframe the media narrative to benefit him. So that part really pisses me off. I could see literally I\nknew that he was lying. He thought he could spin this story. Less than two weeks later. As the sun sets in NASA on December 12th, the Royal Bahamas police arrive at Albany. Police pull the former billionaire from the comfort of his penthouse and lock him up in this Bahamian prison. It's a hellish week for\nthe former crypto titan who follows a strict vegan diet. He reportedly survived on peanut butter and stale wonder bread. But for those impacted the\nmost Bankman-Fried's arrest still doesn't feel like justice. SBF going to prison doesn't help me. ",
        "21": "I'm not getting up and\npopping bottles of champagne in the morning and have\na mimosas with my dog over SBF getting arrested\nright then and there. I still feel battered and bruised and completely demoralized. Billions of dollars are still not back in FTX customer's hands and\nthey want Bankman-Fried to pay. I think he should spend the\nrest of his life in jail. Literally, 100% is\nprobably an easy way out relative to the suffering he has caused a lot of other victims. Extradited to New York in handcuffs. Bankman-Fried is now facing\na dozen federal charges in Manhattan court related to the collapse of FTX and Alameda. From 2019 until earlier this year, Bankman-Fried and his co-conspirators stole billions of dollars\nfrom FTX customers. In some ways it's very, very straightforward what's being alleged, which is that Sam Bankman-Fried\ntook digital assets or other forms of assets from FTX, ",
        "22": "moved them over to Alameda where he could have more control over them and use that money as his\nown private piggy bank. John Ray, the former chief\nrestructuring officer for the Enron scandal\nappointed as FTX's new CEO is at the helm of a massive team tasked with following the money. This is really old\nfashioned and embezzlement. This is just taking money from customers and using it for your own purpose. What Ray discovered after his first look at\nthe books is shocking. There's no record keeping whatsoever. It's in the absence of record keeping. Employees would communicate,\ninvoicing and expenses on Slack. They use QuickBooks, multi-billion dollar\ncompany using QuickBooks. There's no independent board, right? We had one person really controlling this. How did so many people miss? What on the surface appears to\nbe so many obvious red flags? What did due diligence look\nlike on the investor side? ",
        "23": "You went through a standard\nchecklist of due diligence, questionnaire, background\nchecks, data room accounting, financial analysis, audited accounting. He had everything. I mean, you don't dupe 25 of the world's most sophisticated venture capitalists if you're not going\nthrough the list, you know. So he had all the paperwork\nthat any high profile experienced investor would really look to. Yes, he did. There was no smoke in any\nquarter of the business. Brett Harrison was\nrunning the US side of FTX from Chicago. What was your sense of the\nfinancial health of FTX when you left? I had no reason to suspect\nthat FTX wasn't anything other than extremely\nprofitable and in great shape. Sam was embarking on fundraising. Again, he had said both on some internal, all hands and externally that ftx.com had 2 billion in excess capital ",
        "24": "for as a result of its raises and FTX US has six or $700 million and\nthey were in amazing shape. You think FTX is gonna, eat the world because it's so profitable. So some of the top\nemployees at the time of FTX really didn't have a sense of\nthe actual financial health of the company. I can only speak for the\npeople on the US side. We had absolutely no clue. How is that possible? Well, look, imagine\nyourself in our position like you are in a high ranking position, but you're not the CEO,\ndo you think, okay, Sam has made all this\npublic and private reporting about the financial of the company. I should really get all\nof the bank statements. I should get access to all of those and I should rummage through them and see if I agree with the accounting. Sam testified in front of Congress, he's getting public accolades\nfrom the top investment firm. Should I also distrust\neverything he's saying in those two forums? I think anyone in our position would be hard pressed to think, okay, this is the time where I'm supposed to\nsuspect something is wrong ",
        "25": "at the company. Whether or not you can understand how some of the red flags go unnoticed, it is clear that many feel duped. Their explanation for how\nthey think Bankman-Fried could have pulled this off. Good financial services organizations have lots of checks and balances around because there will always\nbe a person of conscience that will protect the organization from a group of fraudsters. And so he had a very\nclose knit group of people that he was working with. I would have to think that\nhis closest inner circle of the people in the Bahamas, that at least to other\nfounders had to know. (dramatic music)\n(siren wailing) On the evening of December 21st, a convoy of SUVs transporting\nSam Bankman-Fried arrives at a private jet hanger in Nassau. And as soon as the\nprivate jet is in the air flying Bankman-Fried to New\nYork to face criminal charges, the Department of Justice holds an unexpected press conference. ",
        "26": "The Southern District of New York has filed charges\nagainst Caroline Ellison, the former CEO of Alameda Research, and Gary Wang, a co-founder of FTX. Both Ms. Ellison and Mr. Wang have pled guilty to those charges and they're both cooperating. Gary Wang, the 29-year-old mysterious co-founder of FTX\nflipped on Bankman-Fried. In court testimony, Wang\nsaid I was directed to and agreed to make certain\nchanges to the platform's code. I executed those changes, which I knew would give Alameda Research special privileges on the FTX platform. The coding guru testifies, he knew what he was doing was illegal. Gary was someone who was very difficult to get to talk at FTX when I would go and occasionally try to\nvisit the office in Bahamas. Gary was someone who\nnever spoke to anyone. He would show up at 5:00\nPM and leave at 4:00 AM. 27-year-old Nishad Singh,\nFTX's, director of engineering also pleads guilty to fraud charges. ",
        "27": "Brett Harrison says he raised\nconcerns about Gary and Nishad in a letter to Bankman-Fried\njust before he left the company. Gary Wang, the CTO of\nboth FTX and FTX rise and Nishad Singh, the director of engineering\nof both FTX and FTX US had written 90 plus\npercent of all the code for the exchanges. And they did very little, I thought to really\ndisseminate the knowledge such that if either one of them suddenly, ended up in the hospital and\ncouldn't come to work anymore, I think the exchange would've been done. It would've been over\nbecause all of the knowledge was in those two guys' heads. Caroline Ellison, the 28-year-old\nCEO of Alameda Research also shares what she\nknows telling the court: I understood that FTX would\nneed to use customer funds to finance its loans to Alameda\nand that most FTX customers did not expect that FTX would lend out their digital asset holdings\nand fiat currency deposits. ",
        "28": "We don't really do any technical analysis. In this bizarre interview\nwith the El Momento podcast, less than six months\nbefore Alameda's meltdown, Ellison makes some surprising admissions about running the crypto hedge fund. We use very little math, use a lot of like elementary school math. We tend not to have\nthings like stop losses. Later Ryan Salame, the former\nhead of FTX digital markets, pled guilty to two criminal counts related to the FTX case. Guilty pleas from SBFs top lieutenants gives investigators valuable information for their case against him. And one expert says all that\nintel from the criminal case could also help the bankruptcy team track down customers and\ninvestors missing money. If there's a fraud and there are a number\nof agencies involved in doing investigations, then you're gonna spend a lot\nof time with the attorneys and have your attorneys\nreally sort of staying in getting close to those investigations. Greg Rayburn is the chief\nrestructuring officer ",
        "29": "who presided over the WorldCom scandal, the largest bankruptcy\nin the US at the time. When we stepped into WorldCom, we didn't know how deep the fraud was, but we knew what we had in\nterms of a group of assets. We understood what the business was. We didn't have to go and\ndo a lot of guesswork. With FTX, you don't know what you have. And figuring out where the\nassets are could take years. I think FTX is gonna be probably one of the longer cases just because of the sheer\namount of litigation that's gonna be required. So far, John Ray and his team have recovered $7.3 billion in assets. The recovery process benefiting from a rise in crypto prices. The recoveries, the bankruptcy court is gonna provide priorities\nin terms of who gets paid what out of whatever the recoveries are. When it comes to chapter 11 bankruptcy, especially when it comes to\nexchanges and things like that, the chances of you getting even some or most of your money back is very low. ",
        "30": "For now, only FTX customers in Japan have been able to withdraw\nany of their funds due to strict crypto\nregulations in the country. The company says its Japanese customers have been able to\nwithdraw 6.6 billion yen, which is nearly $50 million. For other customers it\ncould take much longer to get any of their money back. I knew in one second that\nas soon as the bankruptcy was finalized and declared that I'm not getting\naccess to any of this money for the next few years. I've resigned to the fact that I will not get all of it back. It will be a miracle, I think if all of the money is found wherever it may be hidden or not hidden. And while the bankruptcy\nprocess is ongoing, the value of those assets\nin a volatile crypto market could go up or down. I'm generally an optimist, so I hopefully we can see some money back. But Sunil Kavuri is hedging his bets, joining a lawsuit with\nsome other FTX customers suing FTX's celebrity endorsers in an effort to recover\nsome of their losses. ",
        "31": "Adam Moskowitz is his attorney. Sam knew who to go after. He was gonna go after the\npeople that most people would respect. So he went\nafter Tom Brady, Larry David, Steph Curry, Shaquille O'Neal. We're seeing each of the\ncelebrities got paid millions and millions of dollars to voice this opinion that it was quote, a safe investment and they\nneed to be liable for that. Attorneys for the celebrities named in the lawsuit declined\nour request for comment. While the bankruptcy process\nand other legal cases attempting to recover\nmoney from the FTX fiasco wind their way through the courts. Some customers who need cash now are turning to other options. Multiple companies or individuals can actually go ahead and put in a bid for your bankruptcy claim. (dramatic music) The biggest question on the minds of more than a million\ncustomers and investors who lost billions on FTX, ",
        "32": "will they ever get any of their money back and how much of it. On FTX I had almost 60% of my portfolio of crypto portfolio based on\nall the other bankruptcies and everything that happened\nin the crypto market, I was really, really worried\nabout getting anything back and then how long I would have to wait. I started looking at\nother ones like Mt. Gox and they took almost\nlike eight to 10 years before the people even\ngot a portion of it back. So Bhagamshi Kannegundla goes online to see if he has any options to recover at least some of his money more quickly. I started looking into\nhow can I get something for these bankruptcy claims. He found a company that\nwould help him sell his bankruptcy claim\nfor a small percentage of its value for cash. Here's how it worked. The bankruptcy claim was for $174,000. The buyer was after all the\ndue diligence and everything, it went down to like 11% of the 174,000, ",
        "33": "and I think that came out to\nalmost around 19,000 or so. So I got a certain percentage back. I guess the best way to say it is it's 11 cents for the dollar. Years later. If the bankruptcy process\nrecovers more than 11 cents on the dollar for that claim, then the buyer of Kannegundla's claim pockets the difference and turns a profit. Let's say in like the\n174,000 that I lost in FTX gets recovered in 10 years, right? I will have zero regrets. Zero regrets because Kannegundla\nhas a different strategy. I wanted to get the cash\nfrom the bankruptcy claim primarily to invest in crypto again, I felt like as if there was a good chance for me to make money in\nthe next five to 10 years. So mine is always a long-term perspective. For other FTX customers,\nit's a waiting game. And as time goes on, the highly specialized investigators working around the clock\non the FTX bankruptcy ",
        "34": "are billing by the hour. What's interesting about this bankruptcy is you do have an incredible\nwindow in vivid detail as to every penny that\nevery consultant is earning from the $1,300 an hour\nthat John Ray is charging to the average $1,800 an hour\nthat Sullivan and Cromwell is filing is charging. Seven months into the FTX bankruptcy case. The retained professionals\nalready have requested more than $200 million in fees according to a court appointed\nfee examiner's report. That's nearly $1.5 million a day, the report says the fees are remarkable, but so is the professional's performance. The firm's named in the examiner's report declined our request for comment. What's really concerning is that, all the lawyers have to\nbe paid in the bankruptcy before we get paid out. Because the number of\nprofessionals involved and the hours they work changes over time, it's impossible to calculate\nhow much the bankruptcy fees ",
        "35": "will ultimately cost FTX customers. The real winners in all of\nthis will be the attorneys who worked on the bankruptcy. They're not just the real winners. They're gonna be the only winners. So far, none of the customers we spoke to have received any\nof their money back from FTX and you may be surprised to hear that this whole experience has not shaken their faith in crypto. I think cryptocurrencies\ngenerally should be here to stay. I think that, and it hasn't shaken my faith in the underlying asset itself. I do want everybody to understand that the mistake here was not Bitcoin. The mistake here was not crypto. The mistake was one bad actor, SBF who's really the one who's\nto blame for all of this, and the fundamental\nreason why we buy Bitcoin, why we use Bitcoin has not changed. I would encourage people\nto still invest in crypto. Would I encourage them\nthe way I had before? No, I probably would give\nthem some different advice ",
        "36": "at this point and say, \"Hey, you know, here's what I learned. Don't make the state mistakes I did.\" Sam Bankman-Fried has\nbeen willing to admit he's made some mistakes as well. I've made a lot of mistakes or are things I would give anything to be able to do over again. I didn't ever try to\ncommit fraud on anyone. Though Bankman-Fried's\nversion of the story is difficult for FTX customers to believe. Were you truthful with us today? I was as truthful as I as you know, I'm knowledgeable to\nbe, there's some things I wish I knew more about, but yes, I was. Truthful or not the question\nof whether Bankman-Fried, broke the law is now up\nto the courts to decide. Bankman-Fried's pled not\nguilty to all charges. I don't see how all of the evidence that's now been sort of\nlaid out there in the open against him could be\nconstrued any other way than him having committed\nfinancial crimes. We asked those impacted the\nmost by the collapse of FTX. ",
        "37": "If they have a message for Bankman-Fried. I don't have anything to\nsay to Sam. Not at all. I'm disappointed in the betrayal of trust. I'm disappointed in the\nlack of understanding for the need for integrity. I don't know if it would\nget through to him, but I believe the worst thing he has done is the suffering he has caused to millions of victims worldwide. I would tell Sam, I mean,\nit's great that at least, you're saying in the media\nthat you wanna make sure all the customers are alright, I guess do the right thing then. I mean, serve your time,\npay your penalties, and do the best you can for your users. My biggest advice to him is\nfigure out what you can do to help all those people who\nlost their life savings in FTX. I don't know how you're gonna\ndo it or what you're gonna do, get it done. If I had a chance to\nconfront Sam face to face, I would just honestly\nbe curious to know like ",
        "38": "what he was actually trying to do? Like, were you trying to do good or were you just really bad person and promoted yourself really well in order to swindle a bunch of people, like just gimme an honest answer. (dramatic music) "
    }
}