raw_data: dict[str, str] = {
    "identified_character": "陈晓旭",
    "personality_narrative": "陈晓旭以在电视剧版红楼梦中出演林黛玉闻名，她气质高雅，清新脱俗，聪颖过人，但却经常郁郁寡欢，因此选择遁入空门，出家为尼。",
    "decision_reasoning": {
        "openness": "陈晓旭曾经出演电视剧红楼梦，她在中国是家喻户晓的影视明星，她出演的黛玉气质高雅，格调高洁，才气过人，虽然偶尔略显刻薄，但才女和美女的形象深入人心，可以想象她是一个非常敏感和富有想象力的人。她经常沉浸在诗意的思考中，并对自然和美学有着深刻的欣赏。这表明她在Openness上得分很高。",
        "conscientiousness": "她细心、周到，通常表现出很高的责任心。然而，她的体弱多病，出世的态度和对佛学的倾向可能有时会妨碍她展现出持续的勤奋和组织能力。.",
        "extraversion": "陈晓旭在少年时期表现出内向和孤独的性格，没有很多朋友，沉迷于自己的内心世界，以及文学，美学和阅读。这可能意味着她在外向性方面得分较低。.",
        "agreeableness": "，她是一个善良、富有同情心和温柔的灵魂，通过学佛和冥想寻找内心的平静和满足，具有一种温和和宜人的性格.",
        "neuroticism": "她的生活经历和选择中，我们可以看到她可能是一个深思熟虑和感性的人。",
    },
"keywords": {
"openness": [
"艺术性","富有想象力","内省","反思","欣赏"
],
"conscientiousness": [
"有组织",
"负责任",
"坚定",
"有抱负",
"细致"
],
"extraversion": [
"内向","保留","孤独","安静","反思"
],
"agreeableness": [
"富有同情心",
"善解人意",
"温柔",
"善良",
"理解"
],
"neuroticism": [
"情感化",
"敏感",
"焦虑",
"忧郁",
"内省"
]
},
"ocean_scores": {
"openness": 8,
"conscientiousness": 7,
"extraversion": 3,
"agreeableness": 8,
"neuroticism": 7,
},
}


